[
  {
    "title": "IT Support Technician Level II",
    "company": "HB Mechanical",
    "description": "Job Description Job Description We empower our employee owners to make this a great place to work and create value. SUMMARY: The IT Support Technician Level II is the primary point of contact for all technology related support requests for the organization. The role requires a strong customer service mindset and is responsible for demonstrating professional, educational, and efficient technical support while assisting employees. To be successful you must possess these core value characteristics…",
    "location": "Harleysville, Montgomery County",
    "posted_date": "2025-04-20T12:14:47Z",
    "url": "https://www.adzuna.com/details/5154467334?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£51,044 - £51,044",
    "is_remote": false,
    "matched_keywords": []
  },
  {
    "title": "IT Support Technician Level II",
    "company": "HB Global",
    "description": "We empower our employee owners to make this a great place to work and create value. SUMMARY : The IT Support Technician Level II is the primary point of contact for all technology related support requests for the organization. The role requires a strong customer service mindset and is responsible for demonstrating professional, educational, and efficient technical support while assisting employees. To be successful you must possess these core value characteristics: Trust: Clear Communication. B…",
    "location": "Harleysville, Montgomery County",
    "posted_date": "2025-04-20T20:21:10Z",
    "url": "https://www.adzuna.com/details/5154836326?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£50,948 - £50,948",
    "is_remote": false,
    "matched_keywords": []
  },
  {
    "title": "Digitial Service Technician",
    "company": "Grimco",
    "description": "Job Description Job Description DIGITAL SERVICE TECHNICIAN Are you fascinated by the ever-evolving world of technology and eager to be at the forefront of digital innovation? - A career as a digital service technician might be your perfect fit. You'll dive into the heart of cutting- edge digital printing systems, troubleshooting, maintaining, and optimizing them to ensure seamless operation. Your role will be pivotal in helping businesses harness the power of technology to drive efficiency and …",
    "location": "Easton, Northampton County",
    "posted_date": "2025-04-20T13:53:28Z",
    "url": "https://www.adzuna.com/details/5154645198?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£46,833 - £46,833",
    "is_remote": false,
    "matched_keywords": []
  }
]