[
  {
    "title": "Software Developer Engineer",
    "company": "TRINITY GLOBAL CONSULTING",
    "description": "Job Description Job Description THIS ROLE IS 100% ON-SITE IN CHANTILLY, VA THIS ROLE IS NOT REMOTE. Clearance: TS, SCI/Poly eligible Level: T2 DESCRIPTION: We have an IMMEDIATE NEED for a Mid-Level Software Development Engineer to provide Agile DevOps support to mission critical systems. As a Software Development Engineer on this program, you will have the opportunity to build strong systems and software utilizing cloud capabilities and gain agile development experience in support of an Enterpr…",
    "location": "Chantilly, Fairfax County",
    "posted_date": "2025-04-17T11:08:43Z",
    "url": "https://www.adzuna.com/land/ad/5149773997?se=ur4-Uvcb8BG-i3PTGXcHCQ&utm_medium=api&utm_source=71cf92b8&v=CD1757CA80F2EF9AF6E04F857D5FC171874D1E9A",
    "skills": [],
    "salary_range": "£145,152 - £145,152",
    "is_remote": false,
    "matched_keywords": [
      "developer"
    ]
  },
  {
    "title": "Marketing Product Manager",
    "company": "Aquent Talent",
    "description": "Our client offers an exciting opportunity to contribute across their business, living at the intersection of hardware, games and community. As a key member of the team, you’ll provide critical go-to-market (GTM) support for devices, helping to drive impactful launch and sustain campaigns. You’ll collaborate closely with cross-functional teams to execute outbound marketing plans, ensuring seamless execution of product launches and ongoing initiatives. Responsibilities: End-to-end product launch …",
    "location": "Washington, Washington, D.C.",
    "posted_date": "2025-04-17T14:10:38Z",
    "url": "https://www.adzuna.com/land/ad/5150188226?se=ur4-Uvcb8BG-i3PTGXcHCQ&utm_medium=api&utm_source=71cf92b8&v=DC50E8035E30D172F960228FA95DBC2ABD3FC0AD",
    "skills": [],
    "salary_range": "£121,830 - £121,830",
    "is_remote": false,
    "matched_keywords": [
      "product manager"
    ]
  },
  {
    "title": "IT Systems Development Supervisor",
    "company": "Great West Casualty Company",
    "description": "This position offers an optional hybrid work schedule, with three days working in the office and two days working remotely. Are you an experienced IT professional with a passion for leadership and innovation? Do you thrive in a dynamic, fast-paced environment where you can make a significant impact? If so, apply to join our growing team as a IT Systems Development Supervisor. As the IT Systems Development Supervisor, you will lead a team of 6 to 8 skilled developers focused on supporting the Ac…",
    "location": "Sioux City, Woodbury County",
    "posted_date": "2025-04-17T11:51:32Z",
    "url": "https://www.adzuna.com/land/ad/5149822559?se=ur4-Uvcb8BG-i3PTGXcHCQ&utm_medium=api&utm_source=71cf92b8&v=23B80C33C9B40D356D6CC73FD271B6790395F035",
    "skills": [],
    "salary_range": "£87,455 - £87,455",
    "is_remote": false,
    "matched_keywords": [
      "developer"
    ]
  },
  {
    "title": "Software Engineer / Developer",
    "company": "Global C2 Integration Technologies",
    "description": "SOFTWARE ENGINEER / DEVELOPER San Diego, CA - Full-time - Not a remote position Global C2 Integration Technologies is looking for talented and enthusiastic Software Engineer / Developer. You will be responsible for the design, development, documentation, implementation, integration, and management of the multi-tiered components associated with mobile tactical command and control (C2) and communications systems, fundamental to providing robust, scalable, and efficient communication services and …",
    "location": "Ocean Beach, San Diego County",
    "posted_date": "2025-04-17T20:49:06Z",
    "url": "https://www.adzuna.com/details/5150823630?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£140,000 - £170,000",
    "is_remote": false,
    "matched_keywords": [
      "software engineer",
      "developer"
    ]
  },
  {
    "title": "Mulesoft Developer",
    "company": "TMS",
    "description": "Role: Mulesoft Developer Duration: Long Term Location: 1 st Choice- Tampa, FL & 2 nd Choice- New York City, NY- Remote (Need Local) Job Description Bank is seeking an experienced Lead Software Developer to join our team with a strong background doing significant implementations using Java /MuleSoft products in a high-volume professional environment. This position is responsible for performing the duties of Lead Software Developer working closely with onshore/offshore team. Responsibilities incl…",
    "location": "East Lake-Orient Park, Hillsborough County",
    "posted_date": "2025-04-17T07:45:17Z",
    "url": "https://www.adzuna.com/details/5149420704?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£114,400+",
    "is_remote": false,
    "matched_keywords": [
      "developer"
    ]
  },
  {
    "title": "Senior Software Developer",
    "company": "Noblis",
    "description": "This position is for potential upcoming work . Protecting our nation’s security requires the best and brightest minds our country has to offer. Noblis MSD scientists, engineers, technical staff, analysts, and program managers identify and deploy new shipboard technologies, integrate information technology across shipboard platforms and shipboard systems, and develop computing and networking strategies to support the Warfighter. Noblis MSD employees create strategic solutions to help our US Navy…",
    "location": "Ocean Beach, San Diego County",
    "posted_date": "2025-04-17T21:05:23Z",
    "url": "https://www.adzuna.com/details/5150834601?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£200,489 - £200,489",
    "is_remote": false,
    "matched_keywords": [
      "program manager",
      "developer"
    ]
  },
  {
    "title": "Web Developer III",
    "company": "MITSUBISHI LOGISNEXT AMERICAS INC",
    "description": "Job Details Job Location Grand Rapids - GRAND RAPIDS, MI Position Type Full Time Job Category Information Technology Description About Us: Mitsubishi Logisnext Americas Inc. has helped customers Move The World Forward for more than 100 years as a technology-driven forklift manufacturer. In addition to being a forklift manufacturer, we are also a total solutions provider offering scalable products and services from material handling and automation to extensive fleet support. About the role: The …",
    "location": "Grand Rapids, Kent County",
    "posted_date": "2025-04-17T15:36:01Z",
    "url": "https://www.adzuna.com/details/5150487564?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£84,068 - £84,068",
    "is_remote": false,
    "matched_keywords": [
      "web developer",
      "developer"
    ]
  },
  {
    "title": "Senior Developer",
    "company": "TD Bank",
    "description": "Work Location : New York, New York, United States of America Hours: 40 Line of Business: Technology Solutions Pay Detail: $115,000 - $160,000 USD TD is committed to providing fair and equitable compensation opportunities to all colleagues. Growth opportunities and skill development are defining features of the colleague experience at TD. Our compensation policies and practices have been designed to allow colleagues to progress through the salary range over time as they progress in their role. T…",
    "location": "Grand Central, Manhattan",
    "posted_date": "2025-04-17T10:52:27Z",
    "url": "https://www.adzuna.com/details/5149756520?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£114,258 - £114,258",
    "is_remote": false,
    "matched_keywords": [
      "developer"
    ]
  }
]