[
  {
    "title": "Civil Engineer Project Manager",
    "company": "Van Cleef Engineering Associates LLC",
    "description": "Job Description Job Description Van Cleef Engineering is currently seeking a full time qualified and motivated Civil Engineering design professional to join our dynamic team in Bethlehem, PA in a project management capacity . The ideal candidate should possess a minimum of 6-8 years of progressive experience in the design of private subdivision and land development projects. Van Cleef provides a fun, flexible, and challenging environment and embraces the core values of integrity, quality, accou…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-14T14:38:19",
    "url": "https://www.adzuna.com/land/ad/5144560501?se=FsU39KYZ8BGWASUOPXcHCQ&utm_medium=api&utm_source=71cf92b8&v=B0ABF42B0221984F0BD229A8BE8ADC04FB889A9A",
    "skills": [],
    "salary_range": "£81,703"
  },
  {
    "title": "Project Manager",
    "company": "CyberCoders",
    "description": "Project Manager We are a commercial GC based in Lanham looking for qualified project managers to add to our team Founded in 1990, we specialize in customer driven markets and projects like hospitality/restaurant buildings, retail spaces and fitness clubs. We bring exceptional value and workmanship to the table to deliver all of our clients' needs If you are a project manager interested in joining a diverse and inclusive company and have the drive to be 1, then apply immediately Responsibilities…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-14T01:33:48",
    "url": "https://www.adzuna.com/details/5143853921?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£110,000 - £125,000"
  },
  {
    "title": "Project Manager/Engineer (PE)",
    "company": "Remington & Vernick Engineers",
    "description": "Job Description Job Description POSITION SUMMARY: The Project Engineer is a Professional Engineer with 10-15 years of experience. This individual will design and/or manage a variety of infrastructure projects (owned by municipalities and local school districts) and will report directly to the principal. Such projects shall include roads, underground utilities, public buildings, recreational facilities, and land use applications submitted by private developers. This candidate will work in the Al…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-14T00:08:44",
    "url": "https://www.adzuna.com/details/5143807017?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£93,707"
  },
  {
    "title": "Project Civil Engineer",
    "company": "Cannonball Recruiting LLC",
    "description": "Job Description Job Description Project Civil Engineer (Land Development) Pay: $90k-120k/yr. (depending on experience and certifications) Description: Cannonball Recruiting is seeking a Project Engineer (Land Development) to contribute to a multi-discipline design team on a full-time direct basis. The person will have the opportunity to lead a variety of public & private site development projects as well as working with various municipal clients across various markets. Requirements: Bachelor's …",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-14T02:27:44",
    "url": "https://www.adzuna.com/land/ad/5143930837?se=FsU39KYZ8BGWASUOPXcHCQ&utm_medium=api&utm_source=71cf92b8&v=3A8FCD3C39A6948AEBCFF48C369AA3F64C4E15FA",
    "skills": [],
    "salary_range": "£107,571"
  },
  {
    "title": "Operations Manager",
    "company": "CyberCoders",
    "description": "Operations Manager Operations Manager Position Overview The Operations Manager will oversee and coordinate various operational aspects of the company, ensuring efficient execution of projects. This role is pivotal in managing resources, scheduling, and liaising between different teams to meet project goals and timelines, particularly in substational electrical construction. Key Responsibilities  Oversee daily operations and project execution in substational electrical construction.  Ensure comp…",
    "location": "Macungie, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-14T01:34:10",
    "url": "https://www.adzuna.com/details/5143855047?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "£120,000 - £150,000"
  },
  {
    "title": "Community Engagement Specialist",
    "company": "Wider Circle",
    "description": "Wider Circle is looking for a Community Engagement Specialist - Medicaid to play a vital role in our groundbreaking program, which connects neighbors for better health outcomes. The successful candidate will radiate confidence and empathy, establish trust with our members, and skillfully switch between group and one-on-one interactions. They will tirelessly utilize any means necessary to connect and engage with members, including in-person/virtual group events, home visits, and telephone outrea…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-14T15:23:08",
    "url": "https://www.adzuna.com/details/5144603055?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£20 - £21"
  },
  {
    "title": "Senior Controls Engineer",
    "company": "Messer",
    "description": "Job Description Job Description Company Description Messer is the world’s largest privately held industrial gases company and what we do matters because it is woven into every part of life, from the medical gases that patients rely on to the essential elements needed to safely and sustainably produce the goods our communities depend on. The true strength of Messer is our people—at every level and in every role. Join us and take pride in the impact you will make by providing solutions essential …",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-14T02:24:53",
    "url": "https://www.adzuna.com/details/5143928488?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "£143,581"
  },
  {
    "title": "Hotel Front Office Manager",
    "company": "Tko Employment Services Delaware",
    "description": "Job Details Allentown, PA Description The Front Office Manager is responsible for directing and administering all Front Office operations, ensuring exceptional guest service and efficient registration processes, including check-in and check-out procedures. This role oversees room inventory and availability while implementing guest service standards and initiatives to enhance overall product quality and profitability. Additionally, the Front Office Manager manages budgeting and forecasting, enfo…",
    "location": "Wescosville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-14T19:30:12",
    "url": "https://www.adzuna.com/details/5144829876?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£47,585"
  },
  {
    "title": "COOP Product Design SAPB",
    "company": "Boston Beer Company",
    "description": "Job Description We are currently hiring a Product Design COOP for our Research & Development Team at the Sam Adams Pennsylvania Brewery (SAPB) in Breinigsville, PA . This position is from July-December. This role is full time on site, which requires that our coworkers reside within commuting distance to be onsite 5 days per week. Here at The Boston Beer Company, we are always eager to find competitive, motivated, hardworking people who love beer and want to join our team. We work hard and we pl…",
    "location": "Breinigsville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-14T15:34:38",
    "url": "https://www.adzuna.com/details/5144617930?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£46,561"
  },
  {
    "title": "Management Trainee Job Details | Cintas",
    "company": "Cintas",
    "description": "Job Description Cintas is offering an exciting Management Trainee program designed to kickstart your professional career. We are seeking a motivated and dynamic Management Trainee to join this well-structured program, where you'll gain in-depth knowledge of our business through hands-on rotations in various departments. This position is designed for individuals looking to develop their leadership skills and gain hands-on experience in various aspects of our business operations. The Management T…",
    "location": "Emmaus, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-14T12:36:56",
    "url": "https://www.adzuna.com/details/5144318875?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£40,214"
  },
  {
    "title": "Lead Zoho Software Developer - Hybrid",
    "company": "The Kyle David Group, LLC d/b/a KDG",
    "description": "Job Description Job Description Are you ready to take the next step in your job search? Click here to complete a virtual interview, and get your full application hand-reviewed by the department leader - the perfect way to stand out from the competition. Take the leap and get started today As a Lead Zoho Developer, your primary responsibility will be to create web and tech solutions that deliver results for our customers at a complex level using critical thinking to proactively deliver quality s…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-14T01:36:30",
    "url": "https://www.adzuna.com/details/5143863103?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£52,406"
  }
]