[
  {
    "title": "Journeyman Carpenter",
    "company": "SERVPRO of Allentown",
    "description": "Job Description Job Description Benefits: 401(k) 401(k) matching Bonus based on performance Company car Dental insurance Free uniforms Health insurance Paid time off Vision insurance Servpro is an industry leader in property damage restoration with over 2,200 locations nationwide. Our local franchises serve Allentown, Lehigh County, Carbon County, and the Poconos. Position Description: Our Reconstruction Department specializes in restoring residential and commercial structures affected by prope…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T02:16:51",
    "url": "https://www.adzuna.com/details/5141829383?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£110,392",
    "match_percentage": null
  },
  {
    "title": "Design Engineer - Dynamic Engineering",
    "company": "Dynamic Engineering Consultants, PC",
    "description": "Founded in 2004, Dynamic Engineering Consultants, P.C., and its Family of Companies; Dynamic Earth, Dynamic Survey, and Dynamic Traffic, has emerged as one of the top Land Development Consulting Firms in the nation. Originating in New Jersey, the firm has grown to over 350 employees and 15 offices nationally. Dynamic caters to the demands of various Fortune 500 Companies, as well as an array of independent owners and developers of all sizes. We have built our company to offer a unique consultin…",
    "location": "Fountain Hill, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-12T21:40:00",
    "url": "https://www.adzuna.com/details/5142785130?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£98,385",
    "match_percentage": null
  },
  {
    "title": "Mobile Technician",
    "company": "ABM Industries",
    "description": "The Mobile Technician is responsible for performing a variety of maintenance tasks to ensure that the building, equipment, and systems are properly maintained and operating efficiently. This role includes surveying, troubleshooting, basic repairs, and preventive maintenance on mechanical, electrical, HVAC, plumbing, refrigeration, and other systems within the facility. The Mobile Technician will work closely with account manager and project manager to ensure projects and surveys are completed i…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T21:45:49",
    "url": "https://www.adzuna.com/land/ad/5142792182?se=Njs9EyAY8BGlD81SPiZXLA&utm_medium=api&utm_source=71cf92b8&v=8AAAA2A3944813C2E27870ACDE9EFBA0AA768273",
    "skills": [],
    "salary_range": "£41,335",
    "match_percentage": null
  },
  {
    "title": "Senior Transportation Project Manager-Civil Engineer",
    "company": "Fisher Associates, P.E., L.S., L.A., D.",
    "description": "Full-time Description Remote, however candidate must reside near Allentown, PA Are you ready to drive success? Fisher Associates is on the hunt for a dynamic Senior Transportation Project Manager to help lead our Transportation Group. If you're passionate about business development, adept at managing both technical and administrative projects, and skilled in transportation management, we want you to be on our team. Take charge of our day-to-day operations, logistics, and project management, and…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T03:23:31",
    "url": "https://www.adzuna.com/details/5141866629?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£120,000 - £150,000",
    "match_percentage": null
  },
  {
    "title": "Mold Shop Supervisor - 2nd Shift",
    "company": "B. Braun US Device Manufacturing LLC",
    "description": "B. Braun Medical, Inc. Company: B. Braun US Device Manufacturing LLC Job Posting Location: Allentown, Pennsylvania, United States Functional Area: Other Areas Working Model: Onsite Days of Work: Friday, Thursday, Wednesday, Tuesday, Monday Shift: 5X8 Relocation Available: No Requisition ID: 3841 B. Braun Medical Inc., a leader in infusion therapy and pain management, develops, manufactures, and markets innovative medical products and services to the healthcare industry. Other key product areas …",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T11:53:28",
    "url": "https://www.adzuna.com/details/5142143402?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£75,544",
    "match_percentage": null
  }
]