[
  {
    "title": "Registered Nurse - Emergency Department - Days, Evenings, Nights - Up to $10,000 Sign-On Bonus - Utica NY",
    "company": "Mohawk Valley Health System - Utica, NY",
    "description": "Registered Nurse - Emergency Department - Days, Evenings, Nights - Up to $10,000 Sign-On Bonus - Utica NY at Mohawk Valley Health System - Utica, NY summary: Join Mohawk Valley Health System as a Registered Nurse in the Emergency Department, where you can earn up to $20,000 in sign-on bonuses based on your experience. In this role, you will collaborate with a multidisciplinary team to provide exceptional care in a state-of-the-art environment designed for efficiency and patient-centered care. E…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T16:35:29",
    "url": "https://www.adzuna.com/details/5137712633?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£66,912"
  },
  {
    "title": "Field Sales Account Manager - Post Acute Care, Pittsburgh",
    "company": "McKesson",
    "description": "McKesson is an impact-driven, Fortune 10 company that touches virtually every aspect of healthcare. We are known for delivering insights, products, and services that make quality care more accessible and affordable. Here, we focus on the health, happiness, and well-being of you and those we serve – we care. What you do at McKesson matters. We foster a culture where you can grow, make an impact, and are empowered to bring new ideas. Together, we thrive as we shape the future of health for patien…",
    "location": "Butztown, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T13:08:09",
    "url": "https://www.adzuna.com/land/ad/5137366178?se=ZN6UfMwV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=5F03158110634F42B773B4FC75FA809CE4FE4C63",
    "skills": [],
    "salary_range": "£92,399"
  },
  {
    "title": "Line Cook (PT/FT)",
    "company": "Unknown Company",
    "description": "Line Cook Do you have a taste for great food and an eye for amazing presentation? Do you take pride in knowing that every guest is delighted by the food you have expertly prepared? Show off your skills in the kitchen and bring us your culinary talent Duties of the position include consistent excellence in food preparation, always observing safety protocols and cleanliness standards, set up of equipment, and verification of stock. Qualified line cooks will need to have great communication skills…",
    "location": "Butztown, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T14:14:40",
    "url": "https://www.adzuna.com/details/5137463910?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£59,088"
  },
  {
    "title": "Travel Nurse RN - OR - Operating Room - $2,563 per week",
    "company": "Summit Medical Staffing Nursing",
    "description": "Summit Medical Staffing Nursing is seeking a travel nurse RN OR - Operating Room for a travel nursing job in Allentown, Pennsylvania. Job Description & Requirements Specialty: OR - Operating Room Discipline: RN Start Date: 04/28/2025 Duration: 13 weeks 40 hours per week Shift: 10 hours, days Employment Type: Travel Contact Jace Noble 402-512-9594 About Summit Medical Staffing Nursing Summit Medical Staffing was founded in 2014 and is based in Fremont, Nebraska. Summit is a Veteran and Employee-…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T16:00:18",
    "url": "https://www.adzuna.com/land/ad/5137649558?se=ZN6UfMwV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=32D1213DA875886B54BA6E994E0D4A16AD49F3D8",
    "skills": [],
    "salary_range": "Up to £133,276"
  },
  {
    "title": "Accounting Intern",
    "company": "UWGLV AmeriCorps",
    "description": "Job Description Job Description This internship is for anyone interested in pursuing a career in accounting, finance management or general business support. The successful candidate will demonstrate some education or work experience in accounting and/or business administrative functions. There are opportunities to \"look under the hood\" at non-profit financials and understand deeper accounting functions as the intern may desire beyond the basic projects included in the day-to-day. This internshi…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:10:45",
    "url": "https://www.adzuna.com/land/ad/5136723244?se=ZN6UfMwV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=681C342BBA6251F738845E7873844A8C1FA52870",
    "skills": [],
    "salary_range": "£22,959"
  },
  {
    "title": "Travel Nurse RN - ED - Emergency Department - $1,837 per week",
    "company": "ARMStaffing",
    "description": "ARMStaffing is seeking a travel nurse RN ED - Emergency Department for a travel nursing job in Allentown, Pennsylvania. Job Description & Requirements Specialty: ED - Emergency Department Discipline: RN Start Date: 04/21/2025 Duration: 1 weeks 36 hours per week Shift: 12 hours, days Employment Type: Travel ARMStaffing Job ID 31288658. Pay package is based on 12 hour shifts and 36.0 hours per week (subject to confirmation) with tax-free stipend amount to be determined. Posted job title: RN:ER,07…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T15:58:28",
    "url": "https://www.adzuna.com/land/ad/5137640375?se=ZN6UfMwV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=22740B033D2EF138230AFA6D8A5FA66B0A459D5F",
    "skills": [],
    "salary_range": "Up to £95,524"
  },
  {
    "title": "CDL A Company Driver, Local, Tanker trailer",
    "company": "OLD GLORY EXPRESS INC",
    "description": "Job Summary Company Driver (W2, Solo) Tanker trailer Local $700 - $3,000 total weekly avg. pay 1,000 - 2,500 avg. miles per week Dedicated Day shift 100% Driver Load/Unload Home Time 6 days on, 1 day off Home at least one weekend per month Benefits Medical, Dental, Vision, Life and Disability Paid holidays Paid vacation Core Responsibilities include, but are not limited to Inspection of vehicle, equipment, and cargo to ensure everything is safe, legal, and secure. Maintaining a driver's log in …",
    "location": "Emmaus, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T22:39:31",
    "url": "https://www.adzuna.com/details/5138097197?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "£36,400 - £156,000"
  },
  {
    "title": "WEB DEVELOPER",
    "company": "Outlier",
    "description": "Outlier helps the world’s most innovative companies improve their AI models by providing human feedback. Are you an experienced software engineer who would like to lend your coding expertise to train AI models? We partner with organizations to train AI large language models, helping cutting-edge generative AI models write better code. Projects typically include discrete, highly variable problems that involve engaging with these models as they learn to code. There is no requirement for previous …",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T15:28:01",
    "url": "https://www.adzuna.com/details/5137564642?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£91,118"
  },
  {
    "title": "IT Services Manager/Lead Services Engineer",
    "company": "Stand 8",
    "description": "STAND 8 provides end to end IT solutions to enterprise partners across the United States and with offices in Los Angeles, New York, New Jersey, Atlanta, and more including internationally in Mexico and India. We're seeking a visionary IT leader to revolutionize our digital workplace experience through next-generation endpoint management, AI-assisted automation, and proactive service delivery. This role will architect our Zero Trust security model, implement predictive IT analytics, and cultivat…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T09:21:09",
    "url": "https://www.adzuna.com/details/5137157714?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "rust"
    ],
    "salary_range": "£90,000 - £110,000"
  },
  {
    "title": "Nurse Practitioner or Physician Assistant (PRN)",
    "company": "Premise Health",
    "description": "Healthcare Without Rival New to working in Employer Health? Premise Health serves large organizations and their employees with exceptional healthcare. Our mission is to help others get, stay, and be well. Come join us and make a difference. Visit premisehealth.com to learn more about us and what we do. Premise offers a wide range of dynamic, purpose-driven career opportunities. We are currently looking for a PRN Nurse Practitioner or Physician Assistant to join our Occupational Health team in A…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:28:17",
    "url": "https://www.adzuna.com/land/ad/5136769295?se=ZN6UfMwV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=1E97E695A249F50CBDAD3098372C27893852E7D6",
    "skills": [],
    "salary_range": "£159,170"
  },
  {
    "title": "Nanny Needed For My Children In Nazareth.",
    "company": "Care.com",
    "description": "Hi I am expecting a baby middle-end of October. Looking for a nanny for Saturdays and Sundays from 8:30 a.m. to about 7:30 p.m. There are days where I can get home around 6/6:30 p.m. I do have a small dog named Biscuit and 2 cats (Peanut and Nala) that are very friendly. I can come home on lunch to take the dog out so you would not have to worry about taking him out. Thank you",
    "location": "Nazareth, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T12:09:42",
    "url": "https://www.adzuna.com/details/5137252958?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£47,524"
  },
  {
    "title": "Licensed Clinical Social Worker",
    "company": "Headway",
    "description": "Remote Licensed Clinical Social Worker (LCSW) Wage: Between $86-$120 an hour Are you a Licensed Clinical Social Worker looking to launch a private practice, or grow your existing practice? Headway can help you earn more through insurance Headway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run a flourishing …",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:32:03",
    "url": "https://www.adzuna.com/land/ad/5136783057?se=ZN6UfMwV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=98550B37DFD9FD9AB4196CBC6781CBBA4ED5737C",
    "skills": [],
    "salary_range": "£105,361"
  },
  {
    "title": "Graphic Design for Corporate Communications",
    "company": "The Pennsylvania State University",
    "description": "APPLICATION INSTRUCTIONS: CURRENT PENN STATE EMPLOYEE (faculty, staff, technical service, or student), please login to Workday to complete the internal application process. Please do not apply here, apply internally through Workday. CURRENT PENN STATE STUDENT (not employed previously at the university) and seeking employment with Penn State, please login to Workday to complete the student application process. Please do not apply here, apply internally through Workday. If you are NOT a current e…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T15:38:48",
    "url": "https://www.adzuna.com/details/5137582594?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£59,652"
  },
  {
    "title": "Truck Driver",
    "company": "U.S. Army",
    "description": "No Experience Necessary ABOUT THIS JOB THIS POSITION REQUIRES AN ENLISTMENT IN THE U.S. ARMY OR ARMY RESERVE As a Motor Transport Operator, you'll play an important part of the Army's transportation logistics team. You'll supervise and operate wheeled vehicles over all types of terrain to safely transport cargo, troops, and provide advanced mobility on all missions. You'll manage loading, unloading, and report any vehicle problems or damage. Skills you'll learn align with Vehicle Operations, Lo…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:33:38",
    "url": "https://www.adzuna.com/land/ad/5136788734?se=ZN6UfMwV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=8A8477FD64B9620422D62B869657FE6AFC9238F0",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "£57,886"
  },
  {
    "title": "Warehouse Clerk 1",
    "company": "Ryder",
    "description": "Ryder is immediately hiring a Full Time Clerk 1 in Alburtis, PA Warehouse Positions Pay Weekly Hourly Pay: $20.00 per hour Apply Here with Ryder Today Click here to see and hear it from a Ryder Supply Chain Employee: https://rydercareers.video/DiscoverRyder We want the right Warehouse Employees to join us at Ryder to work with State of the Art Equipment in the Safest Warehouse Environment Various warehouse fulfillment specialist roles at Ryder support distribution across the US. Apply here with…",
    "location": "Alburtis, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T02:40:53",
    "url": "https://www.adzuna.com/details/5136894644?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£27,939"
  },
  {
    "title": "Night Shift - CDL A Company Driver Local Dry Van",
    "company": "JOHANNA FOODS INCORPORATED",
    "description": "About the Company Johanna Foods is a state-of-the-art food manufacturer located in Flemington, New Jersey. Privately operated since 1995, Johanna Foods is now one of the country’s largest producers and distributors of fruit juices, drinks and yogurt. Our products include the popular La Yogurt and Sabor Latino yogurt, Tree Ripe juices, Earth Wise juice beverages, Ssips and Sabor Latino drinks and nectars, and Ssips aseptic drink boxes, all using cutting-edge technologies and only the freshest, h…",
    "location": "Macungie, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T23:06:51",
    "url": "https://www.adzuna.com/details/5138124992?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£52,000 - £104,000"
  },
  {
    "title": "Travel Medical Lab Technician - $1,785 per week in Allentown, PA",
    "company": "PRIDE Health",
    "description": "A Medical Technologist performs complex laboratory tests and analyses to assist in diagnosing and treating medical conditions. Responsibilities include preparing specimens, conducting tests, analyzing results, and ensuring quality control within the lab. \\n\\nApply for specific facility details.",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:11:47",
    "url": "https://www.adzuna.com/land/ad/5136730651?se=ZN6UfMwV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=4C03875E7690231A6D3E19D442C01A531CAD0F83",
    "skills": [
      "AI"
    ],
    "salary_range": "£85,689"
  },
  {
    "title": "Primary Care Physcian",
    "company": "AMN Healthcare",
    "description": "Job Description & Requirements Primary Care Physcian StartDate: ASAP Available Shifts: M-F Pay Rate: $275000.00 - $275000.00 Hiring Primary Care Physicians for Outpatient Internal Medicine clinics due to growth near Allentown, PA. Opportunity Highlights Prime Location — Enjoy a great location ranked a Best Place to Live and Best Place to Retire (US News) Solid Receive $100,000 in signing and retention bonuses Flexible Work Schedules — Enjoy flexible Monday – Friday work schedules, with some loc…",
    "location": "Wescosville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T05:38:56",
    "url": "https://www.adzuna.com/land/ad/5137010095?se=ZN6UfMwV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=A618589ADDB586E5C20AF45B1A350C210EB5983D",
    "skills": [
      "AI"
    ],
    "salary_range": "£74,074"
  },
  {
    "title": "$27-$32/hour for CNAs - 2nd shift",
    "company": "Delta-T Group Inc.",
    "description": "Job Description Job Description Location: Allentown, PA 18103 Date Posted: 04/05/2025 Category: Nursing Education: HS Graduate/GED One of our clients is seeking CNAs (Certified Nursing Assistants) to service patients in a long-term care facility located in Allentown, PA 18103  \"Point Click Care\" experience is REQUIRED CLIENT HOURS/COMPENSATION DETAILS: $27 - $32 per hour 3 PM11 PM AVAILABILITY IS A MUST Availability for weekends is a plus. 6 month block schedules are available. CLIENT'S REQUIRE…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T01:08:53",
    "url": "https://www.adzuna.com/details/5138262597?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "£56,160 - £66,560"
  },
  {
    "title": "In Home Caregiver",
    "company": "Honor",
    "description": "Job Description \\n\\n \\n\\n\\n What is Honor?\\n \\n Honor was created to make life better for our parents, the people who love them, and the caregivers who look after them. Since starting in 2014, we work with more than 50 local agencies and franchises to set high standards of care for older adults across the country.\\n \\n Job Description\\n \\n We call our caregivers Care Professionals (Care Pros) because they are true experts at helping older adults live better lives. They play a key role in our mi…",
    "location": "Parryville, Carbon County",
    "is_remote": false,
    "posted_date": "2025-04-09T08:08:27",
    "url": "https://www.adzuna.com/details/5137097723?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£58,596"
  },
  {
    "title": "Security Officer - Flex Truck Gate",
    "company": "Allied Universal",
    "description": "Allied Universal, North Americas leading security and facility services company, provides rewarding careers that give you a sense of purpose. While working in a dynamic, diverse and inclusive workplace, you will be part of a team that fuels a culture that will reflect in our communities and customers we serve. We offer medical, dental and vision coverage, life insurance, retirement plan, employee assistance programs, company discounts, perks and more for most full-time positions Allied Universa…",
    "location": "Whitehall, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T02:16:27",
    "url": "https://www.adzuna.com/details/5136849234?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£35,172"
  },
  {
    "title": "Security Officer - College Campus",
    "company": "Allied Universal",
    "description": "Allied Universal, North Americas leading security and facility services company, provides rewarding careers that give you a sense of purpose. While working in a dynamic, diverse and inclusive workplace, you will be part of a team that fuels a culture that will reflect in our communities and customers we serve. We offer medical, dental and vision coverage, life insurance, retirement plan, employee assistance programs, company discounts, perks and more for most full-time positions Unlock Your Pot…",
    "location": "New Tripoli, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:47:56",
    "url": "https://www.adzuna.com/details/5136814445?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£39,171"
  },
  {
    "title": "Line Cook, 18",
    "company": "Dorney Park",
    "description": "Overview: $ 16 / Hour Joi ning our Dorney Park team means yo u'll prepare, portion, and cook food items to quality specifications . You'll also Cooks, cools, and prepares food items in accordance to Serv Safe specifications Ensure you are prom o t i n g o u r s a f e t y c u l t u r e , t o i n c l u d e u s e a n d maintenance o f P P E Follow correct prepping procedures and utilize prep charts . Earn a PAID food handler certificate. Keeps work area clean, sanitary, and orderly P roperly store…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:27:45",
    "url": "https://www.adzuna.com/land/ad/5137916204?se=ZN6UfMwV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=835B57D8484A3490C1C527C68E262D1480A778F6",
    "skills": [
      "AI"
    ],
    "salary_range": "£48,289"
  },
  {
    "title": "LMHT (Remote)",
    "company": "Headway",
    "description": "Remote Licensed Mental Health Therapist (LMHT) Wage: Between $86-$120 an hour Are you a Licensed Mental Health Therapist looking to launch a private practice, or grow your existing practice? Headway can help you earn more through insurance Headway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run a flourishin…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": true,
    "posted_date": "2025-04-09T01:32:04",
    "url": "https://www.adzuna.com/land/ad/5136783104?se=ZN6UfMwV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=1E017D68E31E72DE72903ED90EDF64D8BD29F044",
    "skills": [],
    "salary_range": "£92,515"
  },
  {
    "title": "Restaurant Delivery (Emmaus)",
    "company": "DoorDash",
    "description": "Why Deliver with DoorDash? DoorDash is the 1 category leader in food delivery, food pickup, and convenience store delivery in the US, trusted by millions of customers every day. As a Dasher, you’ll stay busy with a variety of earnings opportunities and can work when it works for you. Whether you’re looking for a side hustle or a full-time gig, delivering with DoorDash gives you the opportunity to earn extra cash on your terms. - Multiple ways to earn: Whether you’re delivering meals, groceries,…",
    "location": "Emmaus, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:55:24",
    "url": "https://www.adzuna.com/land/ad/5137961867?se=ZN6UfMwV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=341A778C497A1A0E5A3CCE4E7513549679C6584F",
    "skills": [
      "Go"
    ],
    "salary_range": "£53,993"
  },
  {
    "title": "91B Light-Wheel Vehicle Mechanic",
    "company": "Army National Guard",
    "description": "As a Light-Wheel Vehicle Mechanic for the Army National Guard you’ll ensure that anything that moves on wheels is ready to hit the road. In this role, you will primarily be responsible for supervising and performing maintenance and recovery operations on wheeled vehicles in the field and in the shop. Your duties will include inspecting, servicing, maintaining, repairing, testing, adjusting, and replacing of systems and components; performing recovery operations, and servicing electrical systems…",
    "location": "Weissport, Carbon County",
    "is_remote": false,
    "posted_date": "2025-04-09T08:11:52",
    "url": "https://www.adzuna.com/details/5137100937?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£47,473"
  },
  {
    "title": "Warehouse Custodian / Janitor",
    "company": "Uline, Inc.",
    "description": "Warehouse Custodian / Janitor Pay from $21 to $24 per hour per hour with significant growth and earning potential Plus $2 Shift Differential Pennsylvania Branch 700 Uline Way, Allentown, PA 18106 Morning Call’s Top Large Employer of 2025 Care a lot about cleanliness? Obsessed with organization? We are too. Uline’s best-in-class warehouses are bright, spotless and organized - making it the ideal spot for your next Custodian position Hours: Tuesday - Friday, 7 AM to 3:30 PM PLUS Saturday, 8 AM to…",
    "location": "Slatington, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T11:14:24",
    "url": "https://www.adzuna.com/land/ad/5137222212?se=ZN6UfMwV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=A05FACACBE46B37E8D48CDA39C8D61592A3EB0EB",
    "skills": [],
    "salary_range": "£42,431"
  },
  {
    "title": "15h Left Restaurant Delivery - Sign Up and Start Earning (Bowmanstown)",
    "company": "DoorDash",
    "description": "Why Deliver with DoorDash? DoorDash is the 1 category leader in food delivery, food pickup, and convenience store delivery in the US, trusted by millions of customers every day. As a Dasher, you’ll stay busy with a variety of earnings opportunities and can work when it works for you. Whether you’re looking for a side hustle or a full-time gig, delivering with DoorDash gives you the opportunity to earn extra cash on your terms. - Multiple ways to earn: Whether you’re delivering meals, groceries,…",
    "location": "Bowmanstown, Carbon County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:55:04",
    "url": "https://www.adzuna.com/land/ad/5137960379?se=ZN6UfMwV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=538EDC211412A5934F9FBD94338F425FD23DFC33",
    "skills": [
      "Go"
    ],
    "salary_range": "£73,193"
  },
  {
    "title": "▷ (3 Days Left) Dashers - Sign Up and Start Earning (Coopersburg)",
    "company": "DoorDash",
    "description": "Why Deliver with DoorDash? DoorDash is the 1 category leader in food delivery, food pickup, and convenience store delivery in the US, trusted by millions of customers every day. As a Dasher, you’ll stay busy with a variety of earnings opportunities and can work when it works for you. Whether you’re looking for a side hustle or a full-time gig, delivering with DoorDash gives you the opportunity to earn extra cash on your terms. - Multiple ways to earn: Whether you’re delivering meals, groceries,…",
    "location": "Coopersburg, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:55:12",
    "url": "https://www.adzuna.com/land/ad/5137960972?se=ZN6UfMwV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=218B2C894DEA1E4C4609986FB46E22B2D695A418",
    "skills": [
      "Go"
    ],
    "salary_range": "£77,593"
  },
  {
    "title": "CDL Class A/B Local Delivery Driver, Based Allentown, PA",
    "company": "ZILKA & CO",
    "description": "About the Company Zilka & Company is a family-owned and operated company. Our family has been in the bakery supply business since 1923. About the Job We have dedicated customers so we deliver to the same places on a regular schedule. Job Summary Company Driver (W2, Solo) Box Delivery Local $1,000 - $1,200 total weekly avg. pay 1,000 - 1,750 avg. miles per week Dedicated Day shift 100% Driver Load/Unload Home Time 5 days on, 2 days off Home every weekend Benefits Medical, Dental and Vision Paid …",
    "location": "Tatamy Borough, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T00:24:38",
    "url": "https://www.adzuna.com/details/5138196262?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£52,000 - £62,400"
  },
  {
    "title": "Tow Truck Operator",
    "company": "AUSTINS AUTO SERVICE",
    "description": "Austin's Auto Service Austin's Auto Service of the Lehigh Valley is a family owned company. We are looking for motivated and professional tow truck operators. Pay is hourly and with commission. We offer benefits after 90 days of employment As well as a 401k plan with company matching. Vacation/Personal/Sick time is offered after a year of employment as well. Not only does the company perform Towing, founded in 1977, Austin's Auto Service is the trusted name in replacement tires, and automotive …",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T10:40:39",
    "url": "https://www.adzuna.com/details/5137193969?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£40,708"
  },
  {
    "title": "Travel Physical Therapist - $2,073 per week",
    "company": "ALOIS Healthcare",
    "description": "ALOIS Healthcare is seeking a travel Physical Therapist for a travel job in Easton, Pennsylvania. Job Description & Requirements Specialty: Physical Therapist Discipline: Therapy Start Date: 04/14/2025 Duration: 13 weeks 40 hours per week Shift: 8 hours, days Employment Type: Travel The responsibilities of a physical therapist include: Diagnosing movement dysfunction and developing a treatment plan. Teaching patients how to properly use therapeutic exercise techniques. Providing stimulation or …",
    "location": "Palmer, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:03:37",
    "url": "https://www.adzuna.com/land/ad/5137894838?se=ZN6UfMwV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=2DFE9A2F19DC9C530458BDDFD97F9E0A6304498B",
    "skills": [],
    "salary_range": "Up to £107,796"
  },
  {
    "title": "HVAC Commercial Service Technician",
    "company": "The Tuckey Companies",
    "description": "Job Description Job Description Benefits: Employee Assistance Program Uniform Program Life Insurance Short Term Disability LifeLock Protection opportunity AFLAC Opportunity Paid Holidays 401(k) Dental insurance Employee discounts Health insurance Opportunity for advancement Paid time off Parental leave Training & development Tuition assistance Vision insurance Wellness resources  Family Values, Local Work  Advancement opportunities await you Are you looking for a HOME? Tuckey Mechanical Service…",
    "location": "Northampton, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T01:10:23",
    "url": "https://www.adzuna.com/details/5138269396?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£57,196"
  },
  {
    "title": "Finance and Accounting Intern - Financial Accounting",
    "company": "Cedar Point",
    "description": "Overview:Why Join Us? At Six Flags Entertainment Corporation, we value a collaborative atmosphere where new ideas are welcomed. If you’re looking to grow your skills and make a difference while having FUN, we’d love to hear from you Overview: The Finance and Accounting Intern will be part of a collaborative team in a Shared Accounting Services (SAS) environment. The Intern will be responsible for ensuring the completion and accuracy of accounting and finance functions of Six Flags Entertainment…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T15:34:34",
    "url": "https://www.adzuna.com/details/5137570192?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£46,129"
  },
  {
    "title": "Security Officer - Flex Truck Gate",
    "company": "Allied Universal",
    "description": "Allied Universal, North Americas leading security and facility services company, provides rewarding careers that give you a sense of purpose. While working in a dynamic, diverse and inclusive workplace, you will be part of a team that fuels a culture that will reflect in our communities and customers we serve. We offer medical, dental and vision coverage, life insurance, retirement plan, employee assistance programs, company discounts, perks and more for most full-time positions Allied Universa…",
    "location": "Center Valley, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:47:55",
    "url": "https://www.adzuna.com/details/5136814335?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£37,280"
  },
  {
    "title": "Licensed Marriage and Family Therapist (Virtual)",
    "company": "Headway",
    "description": "Remote Licensed Marriage and Family Therapist (LMFT) Wage: Between $86-$120 an hour Are you a Licensed Marriage and Family Therapist looking to launch a private practice, or grow your existing practice? Headway can help you earn more through insurance Headway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run …",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:32:01",
    "url": "https://www.adzuna.com/land/ad/5136782670?se=ZN6UfMwV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=F697AA37B6F60E20D7C9EE268BAC376EB8E73362",
    "skills": [],
    "salary_range": "£100,891"
  },
  {
    "title": "Power Distribution Make Ready Designer (Remote)",
    "company": "Sigma Technologies, Ltd.",
    "description": "Job Description Job Description Description: Power Distribution Make Ready Designer (Remote) Allentown, PA Are you a skilled Power Designer looking to join a supportive, passionate team? We have an attractive opportunity for you Sigma Technologies is a growing engineering and design firm with over 500 team members across 30 states. For more than 25 years, our work for the power and telecommunications industries has helped create a positive impact in communities across the country. Our core valu…",
    "location": "Coplay, Lehigh County",
    "is_remote": true,
    "posted_date": "2025-04-10T01:09:32",
    "url": "https://www.adzuna.com/details/5138264906?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£58,288"
  },
  {
    "title": "In Home Caregiver",
    "company": "Honor",
    "description": "Job Description \\n\\n \\n\\n\\n What is Honor?\\n \\n Honor was created to make life better for our parents, the people who love them, and the caregivers who look after them. Since starting in 2014, we work with more than 50 local agencies and franchises to set high standards of care for older adults across the country.\\n \\n Job Description\\n \\n We call our caregivers Care Professionals (Care Pros) because they are true experts at helping older adults live better lives. They play a key role in our mi…",
    "location": "Northampton, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T08:09:37",
    "url": "https://www.adzuna.com/details/5137098484?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£55,869"
  },
  {
    "title": "MyChart Customer Support Analyst",
    "company": "e4health",
    "description": "ABOUT US At e4health, we Empower Better Health . The e4health Team is on a relentless mission to care for those teams who care for others. We bring our passion, ingenuity, and expertise to every engagement. In joining our Team, we want your help to provide our customers with powerful solutions in the pursuit of quality, integrity, clinical and financial value across healthcare. Our People make the difference. Serving more than 400 hospitals and health systems nationwide for nearly two decades, …",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T00:08:42",
    "url": "https://www.adzuna.com/details/5136645480?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£45,585"
  },
  {
    "title": "▷ Apply Now Delivery Driver (Bowmanstown)",
    "company": "DoorDash",
    "description": "Why Deliver with DoorDash? DoorDash is the 1 category leader in food delivery, food pickup, and convenience store delivery in the US, trusted by millions of customers every day. As a Dasher, you’ll stay busy with a variety of earnings opportunities and can work when it works for you. Whether you’re looking for a side hustle or a full-time gig, delivering with DoorDash gives you the opportunity to earn extra cash on your terms. - Multiple ways to earn: Whether you’re delivering meals, groceries,…",
    "location": "Bowmanstown, Carbon County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:54:28",
    "url": "https://www.adzuna.com/land/ad/5137957607?se=ZN6UfMwV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=0FBCAB8AFD02CF8151CAD2D6196CF5A153796C58",
    "skills": [
      "Go"
    ],
    "salary_range": "£57,896"
  },
  {
    "title": "Housekeeper-MCM EVS",
    "company": "Unknown Company",
    "description": "Position: Housekeeper Status: Part-time Wage: $15.40 Metz Environmental Services has great new opportunities in your area We are hiring for a Housekeeper. We are a family-owned and operated company focused on providing a high level of service to the community we serve, all while doing our best to have fun. Our compensation package has the following available for full time employees: health insurance, vision insurance, dental insurance, life insurance, PTO and more We are a growing company withi…",
    "location": "Center Valley, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T14:14:20",
    "url": "https://www.adzuna.com/details/5137462203?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£61,913"
  },
  {
    "title": "Inventory Coordinator",
    "company": "Ace Hardware Home Services",
    "description": "Compensation Details: Pay Range: $22-25 / hour Job Description: PURPOSE AND SCOPE: The Warehouse Coordinator will be responsible for managing inbound and outbound inventory, and truck inventory. The Warehouse Coordinator will also develop and implement short- and long-term plans in accordance with Ace objectives and strategic plans and is responsible for the warehouse’s success. PRIMARY RESPONSIBILITIES AND ACTIVITIES: Responsible for the overall operation of the inbound and outbound functions …",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T23:41:56",
    "url": "https://www.adzuna.com/details/5138152082?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£45,760 - £52,000"
  },
  {
    "title": "[3 Days Left] Restaurant Delivery (Macungie)",
    "company": "DoorDash",
    "description": "Why Deliver with DoorDash? DoorDash is the 1 category leader in food delivery, food pickup, and convenience store delivery in the US, trusted by millions of customers every day. As a Dasher, you’ll stay busy with a variety of earnings opportunities and can work when it works for you. Whether you’re looking for a side hustle or a full-time gig, delivering with DoorDash gives you the opportunity to earn extra cash on your terms. - Multiple ways to earn: Whether you’re delivering meals, groceries,…",
    "location": "Macungie, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:55:07",
    "url": "https://www.adzuna.com/land/ad/5137960553?se=ZN6UfMwV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=2D474C137BD7CFAE351DF010150B71E6B28A64ED",
    "skills": [
      "Go"
    ],
    "salary_range": "£64,664"
  },
  {
    "title": "Store Sales Representative - Flemington, NJ",
    "company": "Sherwin-Williams",
    "description": "This position is required to grow top line sales at assigned Lowes stores within geographic territory through implementing sales/marketing programs, training activities, service and merchandising responsibilities. The store count will range based on geography and store volume. Store count ranges between 3-5 stores, average territory contains 4 stores. Lowes Stores: 1590 - Philipsburg, NJ 1656 - Hillsborough, NJ 1759 - Easton, PA 1938 - Hackettstown, NJ 2552 - Flemington, NJ Job duties involve c…",
    "location": "Palmer, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T17:06:37",
    "url": "https://www.adzuna.com/land/ad/5137764309?se=ZN6UfMwV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=DA485EC86C261FC37F7B9B0C2E11D3FAAF2C155F",
    "skills": [
      "AI"
    ],
    "salary_range": "£43,992"
  },
  {
    "title": "Class A Company Driver, Local, Dry Van",
    "company": "HCSC",
    "description": "Job Summary Company Driver (W2, Solo) Dry Van Local $700 - $900 total weekly avg. pay 300 - 700 avg. miles per week Dedicated Day shift 100% Driver Load/Unload Home Time 5 days on, 2 days off Home at least 3 weekends per month Benefits Medical, Dental, Vision, Life and 401K Paid holidays Paid vacation Core Responsibilities include, but are not limited to Maintaining a clean, sanitary, and safe work area. Inspection of vehicle, equipment, and cargo to ensure everything is safe, legal, and secure…",
    "location": "Coplay, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T00:05:13",
    "url": "https://www.adzuna.com/details/5138177510?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "£36,400 - £46,800"
  },
  {
    "title": "Director of Nursing (DON)",
    "company": "Slate Belt Health & Rehab Ctr",
    "description": "Slate Belt Health & Rehab Ctr - This position is located at Slate Belt Health and Rehab Center, 701 Slate Belt Blvd, Bangor, PA 18013. Join us at Slate Belt Health & Rehabilitation Center Personal Attention-Proven Results This is our Advantage: On Demand Pay-get paid tomorrow for work done today Or choose our Weekly Pay Competitive Salaries Great Benefits POSITION SUMMARY: As the Director of Nursing it is your responsibility to organize, develop, manage, and direct the overall operations of the…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T06:55:23",
    "url": "https://www.adzuna.com/details/5137039564?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "£86,758"
  },
  {
    "title": "Class A Team Contract Driver (1099), OTR, Refrigerated",
    "company": "GREEN STATE TRANSPORTATION LLC",
    "description": "Job Summary Contract Driver (1099, Team) Refrigerated OTR $3,000 - $3,400 gross total weekly avg. pay per team 4,000 - 5,000 avg. miles per week per team No Driver Load/Unload Home Time 5 expected days out Get 2 days of home time for every 5 days worked Home every weekend Core Responsibilities include, but are not limited to Maintaining a clean, sanitary, and safe work area. Inspection of vehicle, equipment, and cargo to ensure everything is safe, legal, and secure. Hiring Requirements Class A …",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T00:32:30",
    "url": "https://www.adzuna.com/details/5138204245?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "£156,000 - £176,800"
  },
  {
    "title": "Remote Mental Health Therapist",
    "company": "SonderMind",
    "description": "Remote Mental Health Therapist at SonderMind summary: SonderMind is seeking licensed mental health therapists to join their innovative platform that revolutionizes therapy services. As a therapist, you will have the flexibility to set your own hours while providing high-quality clinical care to individuals in need. With a supportive community, guaranteed pay, and opportunities for professional development, SonderMind enables you to thrive in your practice. SonderMind is a leading mental health …",
    "location": "Orefield, Lehigh County",
    "is_remote": true,
    "posted_date": "2025-04-09T13:08:15",
    "url": "https://www.adzuna.com/land/ad/5137366781?se=ZN6UfMwV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=AFB25869A879CDBFA2D89806D6CE0E4B114A6D47",
    "skills": [],
    "salary_range": "£71,054"
  },
  {
    "title": "CDL B Team Company Driver, Local, Dry Van",
    "company": "O'BRIENS MOVING AND STORAGE",
    "description": "About the Company O’Brien’s Moving & Storage is committed to providing the highest level of service. We selectively employ only those individuals who will be able to live up to the standards of excellence that have become an integral part of our company culture. Every potential candidate is subject to a detailed interview process that includes background checks and drug testing. That is why we only use our own professionally trained crew members on our moves, resulting in better service to our …",
    "location": "Catasauqua, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T23:06:47",
    "url": "https://www.adzuna.com/details/5138124828?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£52,000 - £67,600"
  },
  {
    "title": "Development Director",
    "company": "American Heart Association",
    "description": "Since our founding in 1924, we've cut cardiovascular disease deaths in half, but there is still so much more to do. To overcome today’s biggest health challenges and accelerate this progress, we need passionate individuals like you. Join our movement, be part of the progress, and help ensure a healthier future for all. You matter, and so does the impact you can make with us. We are currently hiring a Development Director in Northeast PA market (can be located in Scranton, Wilkes-Barre, Laporte,…",
    "location": "Fountain Hill, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T00:07:58",
    "url": "https://www.adzuna.com/details/5136644891?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£96,265"
  }
]