[
  {
    "title": "Part time Digital Marketing Specialist",
    "company": "APR Consulting",
    "description": "Part time Digital Marketing Specialist Location: Allentown, Pennsylvania Type: Contract Job 80277 APR Consulting, Inc. has been engaged to identify a Digital Marketing Specialist Location: Allentown, PA 18103 Position: Digital Marketing Specialist Pay Rate: $40/hr Duration: 52 weeks (1 year) Expected Shift: 10am to 2pm, 20 hrs/week JOB SUMMARY Local candidates preferred, hybrid schedule. Ideally, candidates should provide work samples for review and be willing to complete an initial assignment.…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T17:42:24",
    "url": "https://www.adzuna.com/details/5142654056?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£58,989",
    "match_percentage": null
  },
  {
    "title": "Cashier / Host / Attendant",
    "company": "Patel, Patel and Patel dba Golden Corral",
    "description": "Our franchise organization, Patel, Patel and Patel dba Golden Corral, is currently seeking energetic, friendly individuals to join our team Entering and leaving Golden Corral are two of the most critical moments in the guest’s experience because lasting impressions are formed during these moments. The Cashier / Host’s interactions with our guests and these impressions ultimately dictate whether the guest will return. Guest Service: Greets guests as they enter the restaurant and offers a sincere…",
    "location": "Whitehall, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T09:07:35",
    "url": "https://www.adzuna.com/details/5142066808?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "go"
    ],
    "salary_range": "£18,973",
    "match_percentage": null
  },
  {
    "title": "Cashier / Host / Attendant",
    "company": "Patel, Patel and Patel dba Golden Corral",
    "description": "Benefits: Competitive salary Employee discounts Flexible schedule Free food & snacks Training & development Our franchise organization,is currently seeking energetic, friendly individuals to join our team Entering and leaving Golden Corral are two of the most critical moments in the guest’s experience because lasting impressions are formed during these moments. The Cashier / Host’s interactions with our guests and these impressions ultimately dictate whether the guest will return. Guest Service…",
    "location": "Whitehall, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T09:15:23",
    "url": "https://www.adzuna.com/details/5142068309?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "go"
    ],
    "salary_range": "£20,800 - £31,200",
    "match_percentage": null
  }
]