[
  {
    "title": "Bartender (PT/FT)",
    "company": "Unknown Company",
    "description": "Do you have a passion for serving amazing drinks, making on-point recommendations, and transforming casual customers into your regular crowd? Drink knowledge and experience is valuable for sure, but we are seeking rock stars who think fast, have fun, and bring great hustle to every shift, every time. Our bartenders know that being sales savvy, having an outgoing personality and a natural ability to maintain the bar's rhythm leads to good times and good money. Who are we looking for? Guys and gi…",
    "location": "Butztown, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T14:14:51",
    "url": "https://www.adzuna.com/details/5137464729?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "go"
    ],
    "salary_range": "£35,658"
  },
  {
    "title": "Part-Time Cleaning Team Member",
    "company": "The Maids",
    "description": "Apply Today and Become a Professional House Cleaner Work daytime hours, NO nights and NO weekends ¡Aplica hoy y sea un limpiador profesional de casas ¡Trabaja un horario de dia, NO trabajamos de noche y NO trabajamos los fines de semana ¡Hablamos Espanol PROVIDED FOR YOU: Sign-on bonus of $300 after 90 days of employment  Daily schedule on the days of your choice with no night or weekend work Paid transportation to jobs in a company vehicle Fun, friendly team environment Increased wages for tea…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T00:25:31",
    "url": "https://www.adzuna.com/details/5138199231?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£27,834"
  },
  {
    "title": "Director of Nursing",
    "company": "Valley Manor",
    "description": "Valley Manor - Valley Manor is a 180-bed skilled nursing facility committed to quality care to our residents/patients. The Director of Nursing coordinates and manages the nursing department. Maintains quality care that is consistent with company and regulatory standards. Assumes responsibilities of daily operations in the absense of facility administrator. Oversees nursing staff for quality and appropriate resident/patient care that meets or exceeds company and regulatory standards. Schedules a…",
    "location": "Coopersburg, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T06:55:26",
    "url": "https://www.adzuna.com/details/5137039910?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£116,255"
  },
  {
    "title": "Remote Mental Health Therapist",
    "company": "SonderMind",
    "description": "Remote Mental Health Therapist at SonderMind summary: SonderMind is seeking licensed mental health therapists to join their innovative platform, allowing for flexible work hours and the ability to impact clients' lives. Therapists will benefit from a supportive community, guaranteed pay, and professional development opportunities while maintaining clinical autonomy. The role requires a Master’s degree in a relevant field and the ability to provide independent therapy. SonderMind is a leading me…",
    "location": "Breinigsville, Lehigh County",
    "is_remote": true,
    "posted_date": "2025-04-09T13:04:45",
    "url": "https://www.adzuna.com/land/ad/5137352552?se=vhXog8wV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=50C578FB9DB7D0D355303171821AAA049CED3861",
    "skills": [
      "AI"
    ],
    "salary_range": "£71,094"
  },
  {
    "title": "Experienced Diesel Mechanic - $28-36/hr",
    "company": "Messer",
    "description": "Diesel Mechanic - 2 yrs EXP Required Are you an Experienced Diesel Mechanic? Messer is the largest privately held industrial gas business in the world and a leading industrial and medical gas company in North America, South America, Asia and Europe. We're a technology and applications leader with the industry knowledge and applications expertise to meet customer needs across industrial, food, medical, chemical and electronics industries. We offer over 125 years of proven experience in the safe …",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T04:33:36",
    "url": "https://www.adzuna.com/land/ad/5136977525?se=vhXog8wV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=E8291437BA6D9E0CA017DBB0784456EFC0BE229C",
    "skills": [],
    "salary_range": "£58,240 - £74,880"
  },
  {
    "title": "In Home Caregiver",
    "company": "Honor",
    "description": "Job Description \\n\\n \\n\\n\\n What is Honor?\\n \\n Honor was created to make life better for our parents, the people who love them, and the caregivers who look after them. Since starting in 2014, we work with more than 50 local agencies and franchises to set high standards of care for older adults across the country.\\n \\n Job Description\\n \\n We call our caregivers Care Professionals (Care Pros) because they are true experts at helping older adults live better lives. They play a key role in our mi…",
    "location": "Neffs, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T08:09:01",
    "url": "https://www.adzuna.com/details/5137098101?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£54,091"
  },
  {
    "title": "W2 Solo OTR Class A - 100% No driver touch",
    "company": "Z TRANSPORTATION INC",
    "description": "About the Company Z Transportation truck drivers are the key to success of the company. Our drivers are known to be some of the best in the business. As a result, Z Transportation offers some of the most attractive truck driving careers, backed by a commitment to safety and better CSA scores, a commitment to keeping drivers busy and productive, a commitment to meeting home-time promises, and the very best pay available. About the Job Riders must be 18 Job Summary Company Driver (W2, Solo) Dry V…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T22:39:15",
    "url": "https://www.adzuna.com/details/5138095333?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£78,000 - £109,200"
  },
  {
    "title": "W2 CDLA OTR Open Top",
    "company": "IOWA MOTOR TRUCK TRANSPORT INC",
    "description": "About the Company We are a step deck flatbed RGN company old school. Job Summary Company Driver (W2, Solo) Single Drop, Flatbed trailer and Removable Gooseneck OTR $1,400 total weekly avg. pay 2,500 - 3,000 avg. miles per week 100% Driver Load/Unload 50% tarping Home Time 21 expected days out You can stay out longer if you want to Get 4 days of home time for every 21 days worked Home at least one weekend per month Benefits Medical, Dental and Life Paid vacation Core Responsibilities include, bu…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T00:25:19",
    "url": "https://www.adzuna.com/details/5138198746?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "£72,800"
  },
  {
    "title": "Travel Rad Tech in Bethlehem, PA",
    "company": "AlliedTravelCareers",
    "description": "AlliedTravelCareers is working with Fusion Medical Staffing to find a qualified Rad Tech in Bethlehem, Pennsylvania, 18017 About The Position Interested in making a positive impact? You’ve come to the right place. At Fusion Medical Staffing, our goal is to improve the lives of everyone we touch, and we’re always looking for people like you to join our mission. And making a difference isn’t the only perk of traveling with us. Start your medical travel career with Fusion Medical Staffing and gain…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T03:04:10",
    "url": "https://www.adzuna.com/land/ad/5136911281?se=vhXog8wV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=19AD783375FC1AA69735321881CD2AFC8221275F",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "£78,254"
  },
  {
    "title": "CDL A Contract Driver (1099), OTR, Flatbed trailer",
    "company": "Starmount Transportation",
    "description": "Job Summary Contract Driver (1099, Solo) Dry Van and Flatbed trailer OTR $1,400 - $2,000 gross total weekly avg. pay 2,000 - 3,500 avg. miles per week Dedicated No Driver Load/Unload No tarping Home Time 5 - 14 expected days out You can stay out longer if you want to Get 2 days of home time for every 5 days worked Home at least 2 weekends per month Core Responsibilities include, but are not limited to Daily customer interactions and maintaining good customer relations. Maintaining a driver's lo…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T22:50:17",
    "url": "https://www.adzuna.com/details/5138105576?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "£72,800 - £104,000"
  },
  {
    "title": "Yard Jockey / Forklift Operator",
    "company": "Altium Packaging LP",
    "description": "Location Address: 6831 Ruppsville Road, Allentown, Pennsylvania 18106 Work Shift: 8hr-1st Shift (United States of America) The Yard Jockey/Forklift Operator is responsible for operating a forklift truck to stack and retrieve supplies and materials as well as following our company's Good Manufacturing Practices. Essential Duties & Responsibilities: Ensure compliance with corporate and plant safety standards and with applicable laws and regulations issued by regulatory agencies Load trucks and se…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:27:51",
    "url": "https://www.adzuna.com/details/5137916419?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AWS",
      "Go"
    ],
    "salary_range": "£50,881"
  },
  {
    "title": "Class A Company Driver, Local, Dry Van",
    "company": "HCSC",
    "description": "Job Summary Company Driver (W2, Solo) Dry Van Local $700 - $900 total weekly avg. pay 300 - 700 avg. miles per week Dedicated Day shift 100% Driver Load/Unload Home Time 5 days on, 2 days off Home at least 3 weekends per month Benefits Medical, Dental, Vision, Life and 401K Paid holidays Paid vacation Core Responsibilities include, but are not limited to Maintaining a clean, sanitary, and safe work area. Inspection of vehicle, equipment, and cargo to ensure everything is safe, legal, and secure…",
    "location": "Fogelsville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T00:05:13",
    "url": "https://www.adzuna.com/details/5138177512?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "£36,400 - £46,800"
  },
  {
    "title": "Business Development Manager - Enterprise Thermal (Northeast Territory)",
    "company": "Toshiba America Business Solutions",
    "description": "First year potential total compensation is $200,000.00.Base: $91,000.00 to $100,000.00 depending on experience.First-year on-track earnings at 100%, including base, commission, bonus, and expense allowance of $200,000.00 (approximate)Toshiba America Business Solutions, Inc. is a global industry leader in digital displays, document security and software solutions. We currently have an excellent opportunity for a Business Development Manager - Enterprise Thermal to work remotely, home-based in th…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T14:40:46",
    "url": "https://www.adzuna.com/details/5137495016?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "Git"
    ],
    "salary_range": "£87,192"
  },
  {
    "title": "Travel X-Ray Tech in Bethlehem, PA",
    "company": "Pacer Healthcare Solutions",
    "description": "Job Title: X-Ray Technician Location: LVH - Muhlenberg, Bethlehem, PA Job Summary: Pacer Staffing is seeking a skilled and dedicated X-Ray Technician to join our team at LVH - Muhlenberg in Bethlehem, PA. The ideal candidate will be responsible for performing diagnostic imaging procedures, ensuring high-quality results, and providing excellent patient care. This is a full-time position with a weekly guaranteed schedule of 40 hours. Key Responsibilities: Perform X-ray imaging procedures in accor…",
    "location": "Fountain Hill, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T00:41:11",
    "url": "https://www.adzuna.com/land/ad/5136688071?se=vhXog8wV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=CE0C8E71A654AC025EDC7A612363968F8EFA631E",
    "skills": [],
    "salary_range": "£70,116"
  },
  {
    "title": "Customer Service Representative",
    "company": "Uline",
    "description": "Customer Service Representative Pay from $22 to $27 per hour with significant growth and earning potential Pennsylvania Branch 700 Uline Way, Allentown, PA 18106 Morning Call’s Top Large Employer of 2025 Customer Service is the heartbeat of Uline As a Customer Service Representative, you’ll dig into order details to deliver an exceptional experience our customers love. Our company continues to grow, creating new career opportunities and job stability you can count on. Position Responsibilities …",
    "location": "Wescosville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T13:13:56",
    "url": "https://www.adzuna.com/land/ad/5137373802?se=vhXog8wV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=EB4E744E376C4CA9A2E046EC1C45FAF56C57B2B9",
    "skills": [
      "AI"
    ],
    "salary_range": "£63,391"
  },
  {
    "title": "Lifeguard- Same Day Apply and Hire",
    "company": "Dorney Park",
    "description": "Overview: $15 / Hour During training, hourly rate is $14 until completion of lifeguard certification. Joining our Dorney Park team means you’ll keep guests safe at our pools in our Wildwater Kingdom Waterpark. You’ll also Earn a PAID lifeguard license. Monitor and enforce the waterpark rules in our pools, slides, and lazy rivers. Receive continuous in-service training and lifesaving skills. Learn to properly use and store rescue equipment that can be utilized in real world Respond to medical an…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T05:07:07",
    "url": "https://www.adzuna.com/details/5136992275?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£45,207"
  },
  {
    "title": "Travel Physical Therapist - $1,737 per week",
    "company": "Solomon Page",
    "description": "Solomon Page is seeking a travel Physical Therapist for a travel job in Easton, Pennsylvania. Job Description & Requirements Specialty: Physical Therapist Discipline: Therapy Start Date: 04/14/2025 Duration: 13 weeks 40 hours per week Shift: 8 hours, days Employment Type: Travel Our client is seeking a Physical Therapist to join their growing team. As a Physical Therapist, you will work closely with patients to learn more about their conditions and create a personalized care plan. You will cons…",
    "location": "Palmer, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T22:27:46",
    "url": "https://www.adzuna.com/land/ad/5138081488?se=vhXog8wV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=74AE93FC5A5FF3AA98F128436A8C8DBBBF057317",
    "skills": [],
    "salary_range": "Up to £90,324"
  },
  {
    "title": "Safety Investigator, Seasonal",
    "company": "Dorney Park",
    "description": "Overview:$18 / Hour Joining Dorney Park will teach you to be a risk manager in an entertainment environment Inspect and audit safety systems in a 200-acre facility. Conduct incident investigations and provide recommendations. Participate, develop, and improve safety training. Project work to meet your educational institution’s requirements. Some of our amazing perks and benefits: Paid Training FREE Uniforms FREE Admission to Dorney Park and our other properties FREE tickets for friends and fami…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T05:07:23",
    "url": "https://www.adzuna.com/land/ad/5136993291?se=vhXog8wV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=014AE6F34ED9D2B7945C4476BAFD87F7214EC5FD",
    "skills": [
      "AI"
    ],
    "salary_range": "£55,178"
  },
  {
    "title": "Travel Radiology Technician",
    "company": "MedPro Healthcare Allied Staffing",
    "description": "Job Description MedPro Healthcare Allied Staffing is seeking a travel Radiology Technician for a travel job in Bethlehem, Pennsylvania. Job Description & Requirements - Specialty: Radiology Technician - Discipline: Allied Health Professional - Start Date: 05/19/2025 - Duration: 13 weeks - 40 hours per week - Shift: 8 hours, days - Employment Type: Travel MedPro Healthcare Staffing, a Joint Commission-certified staffing agency, is seeking a quality X-Ray Tech for a contract with one of our top h…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T00:53:47",
    "url": "https://www.adzuna.com/land/ad/5138229005?se=vhXog8wV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=5119F23FECEE3EEF9E8D774E0C3F5E50D2EE5AB4",
    "skills": [],
    "salary_range": "£94,126"
  },
  {
    "title": "Consumer Lending Advisor",
    "company": "OneMain Financial",
    "description": "At OneMain, Consumer Loan Sales Specialists empower customers – listening to their needs and providing access to friendly, fast, and affordable financing for life’s expenses. Consumer Loan Sales Specialist will learn the lending and servicing business at OneMain allowing them to grow their career. In the Role Deliver results related to individual and branch sales goals as well as customer expectations Develop new relationships – and maintain existing relationships - working with customers throu…",
    "location": "Whitehall, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T05:09:21",
    "url": "https://www.adzuna.com/details/5136999393?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "£42,082"
  },
  {
    "title": "BACHELOR LEVEL THERAPIST",
    "company": "Unknown Company",
    "description": "The Bachelor Level Therapist is responsible for assessing client's mental health status, developing a client specific treatment plan, providing individual, group and family therapy and completing all required clinical documentation that is in compliance with KidsPeace and regulatory requirements. QUALIFICATIONS: A person with a bachelor's degree with 5 years of clinical training and experience. Experience with acute emotionally challenged children or adolescents preferred. Bilingual Spanish/Eng…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T14:15:03",
    "url": "https://www.adzuna.com/details/5137465760?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£46,368"
  },
  {
    "title": "Remote Mental Health Therapist",
    "company": "SonderMind",
    "description": "Remote Mental Health Therapist at SonderMind summary: SonderMind is a leading mental health care platform looking for licensed mental health therapists to join its network. As a remote therapist, you will enjoy flexibility, clinical autonomy, and ongoing professional development while making a meaningful impact on clients' lives. The platform streamlines credentialing and billing processes, allowing therapists to focus on delivering high-quality care and achieving positive clinical outcomes. So…",
    "location": "Butztown, Northampton County",
    "is_remote": true,
    "posted_date": "2025-04-09T12:49:30",
    "url": "https://www.adzuna.com/land/ad/5137304846?se=vhXog8wV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=C97715977FB1D5793501954274D74669E67C6555",
    "skills": [
      "Go"
    ],
    "salary_range": "£72,085"
  },
  {
    "title": "Host/Hostess, FT, 6:00am - 2:30pm, Bethlehem Campus",
    "company": "St. Lukes Hospital",
    "description": "St. Luke's is proud of the skills, experience and compassion of its employees. The employees of St. Luke's are our most valuable asset Individually and together, our employees are dedicated to satisfying the mission of our organization which is an unwavering commitment to excellence as we care for the sick and injured; educate physicians, nurses and other health care providers; and improve access to care in the communities we serve, regardless of a patient's ability to pay for health care. The …",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T00:55:22",
    "url": "https://www.adzuna.com/details/5136696136?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£44,171"
  },
  {
    "title": "Caregiver - Immediate Openings",
    "company": "Honor",
    "description": "Job Description \\n\\n \\n\\n\\n What is Honor?\\n \\n Honor was created to make life better for our parents, the people who love them, and the caregivers who look after them. Since starting in 2014, we work with more than 50 local agencies and franchises to set high standards of care for older adults across the country.\\n \\n Job Description\\n \\n We call our caregivers Care Professionals (Care Pros) because they are true experts at helping older adults live better lives. They play a key role in our mi…",
    "location": "Coopersburg, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T08:09:41",
    "url": "https://www.adzuna.com/details/5137098521?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£56,109"
  },
  {
    "title": "Design Engineer I",
    "company": "Rotating Machinery Svcs Inc",
    "description": "JOB SUMMARY This role as a Design Engineer I is an entry-level role. Individuals will apply their academic training to the inspection, disposition, modeling, and design calculations associated with assigned product or equipment lines. The Engineer I will interface with experienced engineers for guidance and training. Daily responsibilities typically involve the review of drawings, review of inspection results, writing technical reports, performance of design calculations, electronic modeling of…",
    "location": "Butztown, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:56:11",
    "url": "https://www.adzuna.com/details/5137965373?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£69,597"
  },
  {
    "title": "Security Officer - Flex Overnight Weekends",
    "company": "Allied Universal",
    "description": "Allied Universal, North Americas leading security and facility services company, provides rewarding careers that give you a sense of purpose. While working in a dynamic, diverse and inclusive workplace, you will be part of a team that fuels a culture that will reflect in our communities and customers we serve. We offer medical, dental and vision coverage, life insurance, retirement plan, employee assistance programs, company discounts, perks and more for most full-time positions Allied Universa…",
    "location": "Emerald, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T02:33:55",
    "url": "https://www.adzuna.com/details/5136872046?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£47,865"
  },
  {
    "title": "Remote Mental Health Therapist",
    "company": "SonderMind",
    "description": "Remote Mental Health Therapist at SonderMind summary: As a Remote Mental Health Therapist at SonderMind, you will provide impactful therapy to clients through a flexible and supportive platform. You will enjoy clinical autonomy while being part of a community that fosters professional growth and collaboration. Our streamlined credentialing process and guaranteed pay for sessions, including no-shows, ensure that you can focus solely on delivering high-quality care. SonderMind is a leading mental…",
    "location": "Danielsville, Northampton County",
    "is_remote": true,
    "posted_date": "2025-04-09T13:07:44",
    "url": "https://www.adzuna.com/land/ad/5137362940?se=vhXog8wV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=A7964DAF77F8A49DE24B73C55A48C0CBFB04FA02",
    "skills": [],
    "salary_range": "£73,557"
  },
  {
    "title": "Universal Banker PT (20hrs) - Central Allentown",
    "company": "Truist",
    "description": "The position is described below. If you want to apply, click the Apply Now button at the top or bottom of this page. After you click Apply Now and complete your application, you'll be invited to create a profile, which will let you see your application status and any communications. If you already have a profile with us, you can log in to check status. Need Help? (https://www.brainshark.com/bbandt/careers-site-faq) If you have a disability and need assistance with the application, you can reque…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T11:32:45",
    "url": "https://www.adzuna.com/details/5137234677?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£62,014"
  },
  {
    "title": "Lehigh Valley Health Network",
    "company": "LVHN",
    "description": "The award-winning physicians at Lehigh Valley Heart and Vascular Institute are all board-certified, many having served fellowships or received additional training with leading programs. Our expert clinicians utilize continuing medical education to further research and enhance collaboration, leading to better patient outcomes. Per-diem coverage support of the 11-bed cardiothoracic surgery ICU (Open Heart Unit). Work in conjunction with the attending cardiothoracic surgeon, and non-surgical provi…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T20:48:58",
    "url": "https://www.adzuna.com/details/5138005917?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£74,143"
  },
  {
    "title": "▷ [Urgent] Dashers - Sign Up and Start Earning (Emmaus)",
    "company": "DoorDash",
    "description": "Why Deliver with DoorDash? DoorDash is the 1 category leader in food delivery, food pickup, and convenience store delivery in the US, trusted by millions of customers every day. As a Dasher, you’ll stay busy with a variety of earnings opportunities and can work when it works for you. Whether you’re looking for a side hustle or a full-time gig, delivering with DoorDash gives you the opportunity to earn extra cash on your terms. - Multiple ways to earn: Whether you’re delivering meals, groceries,…",
    "location": "Emmaus, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:54:43",
    "url": "https://www.adzuna.com/land/ad/5137958927?se=vhXog8wV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=BD7276F1770FBB6D8620F77367DE84A2B339C041",
    "skills": [
      "Go"
    ],
    "salary_range": "£74,105"
  },
  {
    "title": "Make Your Own Schedule - Deliver With Gopuff",
    "company": "Gopuff",
    "description": "Job Description Job Description Do more than make ends meet. Deliver with Gopuff and get paid to deliver what your neighbors need from a Gopuff facility near you With one centralized pickup location and smaller delivery zones, Gopuff makes earning effortless. It's simple: deliver from a facility near you straight to the customer You’ll be delivering everyday essentials, from cleaning supplies, home needs and OTC medications to food, drinks and more. Sign up to be a Gopuff Delivery Partner today…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T01:08:41",
    "url": "https://www.adzuna.com/details/5138261048?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "£69,395"
  },
  {
    "title": "CDL B Team Company Driver, Local, Dry Van",
    "company": "O'BRIENS MOVING AND STORAGE",
    "description": "About the Company O’Brien’s Moving & Storage is committed to providing the highest level of service. We selectively employ only those individuals who will be able to live up to the standards of excellence that have become an integral part of our company culture. Every potential candidate is subject to a detailed interview process that includes background checks and drug testing. That is why we only use our own professionally trained crew members on our moves, resulting in better service to our …",
    "location": "Palmerton, Carbon County",
    "is_remote": false,
    "posted_date": "2025-04-09T23:06:47",
    "url": "https://www.adzuna.com/details/5138124832?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£52,000 - £67,600"
  },
  {
    "title": "Chartis Consulting Corporation is hiring: Land Mobile Radio Technician in Allent",
    "company": "Chartis Consulting Corporation",
    "description": "Job Description Job Description Description: Chartis Federal is a leading systems engineering and integration firm specializing in mission-critical IT and communications for law enforcement, homeland security, and defense. With over $160 million in task order awards as a prime contractor, we employ more than 100 staff across 22 states, delivering vital services and solutions globally. Our commitment to excellence is reflected in our consistent year-over-year growth, earning us recognition as a …",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T15:38:29",
    "url": "https://www.adzuna.com/details/5137580611?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£86,061"
  },
  {
    "title": "Restaurant Delivery (Coopersburg)",
    "company": "DoorDash",
    "description": "Why Deliver with DoorDash? DoorDash is the 1 category leader in food delivery, food pickup, and convenience store delivery in the US, trusted by millions of customers every day. As a Dasher, you’ll stay busy with a variety of earnings opportunities and can work when it works for you. Whether you’re looking for a side hustle or a full-time gig, delivering with DoorDash gives you the opportunity to earn extra cash on your terms. - Multiple ways to earn: Whether you’re delivering meals, groceries,…",
    "location": "Coopersburg, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:55:49",
    "url": "https://www.adzuna.com/land/ad/5137963712?se=vhXog8wV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=27416ABA8FA67B1335FA0B556AC0C6C81C5D1C4D",
    "skills": [
      "Go"
    ],
    "salary_range": "£55,276"
  },
  {
    "title": "Warehouse Custodian / Janitor",
    "company": "Uline, Inc.",
    "description": "Warehouse Custodian / Janitor Pay from $21 to $24 per hour per hour with significant growth and earning potential Plus $2 Shift Differential Pennsylvania Branch 700 Uline Way, Allentown, PA 18106 Morning Call’s Top Large Employer of 2025 Care a lot about cleanliness? Obsessed with organization? We are too. Uline’s best-in-class warehouses are bright, spotless and organized - making it the ideal spot for your next Custodian position Hours: Tuesday - Friday, 7 AM to 3:30 PM PLUS Saturday, 8 AM to…",
    "location": "Limeport, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T14:45:22",
    "url": "https://www.adzuna.com/land/ad/5137495537?se=vhXog8wV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=0B123266A24636B6D9BFD3D8ACD2CD557234D063",
    "skills": [],
    "salary_range": "£39,708"
  },
  {
    "title": "U.S. Army Soldier-Infantry",
    "company": "U.S. Army",
    "description": "ELIGIBLE FOR UP TO A $12K SIGNING BONUS. TALK TO YOUR RECRUITER FOR DETAILS. ABOUT THIS JOB THIS POSITION REQUIRES AN ENLISTMENT IN THE U.S. ARMY OR ARMY RESERVE As a first step toward becoming an Infantryman, you'll train in the use of small arms, anti-tank, and other weapons systems. You will be responsible for capturing, destroying, and repelling enemy ground forces during missions. This is also the starting point for many advanced schools, such as Special Forces, Airborne School, Ranger Sch…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:33:38",
    "url": "https://www.adzuna.com/land/ad/5136788755?se=vhXog8wV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=EEEB83E92832A1A6ED311C3DF3790E48DE1B20BF",
    "skills": [
      "AI"
    ],
    "salary_range": "£48,543"
  },
  {
    "title": "Caregiver - Immediate Openings",
    "company": "Honor",
    "description": "Job Description \\n\\n \\n\\n\\n What is Honor?\\n \\n Honor was created to make life better for our parents, the people who love them, and the caregivers who look after them. Since starting in 2014, we work with more than 50 local agencies and franchises to set high standards of care for older adults across the country.\\n \\n Job Description\\n \\n We call our caregivers Care Professionals (Care Pros) because they are true experts at helping older adults live better lives. They play a key role in our mi…",
    "location": "Neffs, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T08:10:05",
    "url": "https://www.adzuna.com/details/5137098900?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£56,872"
  },
  {
    "title": "Remote Mental Health Therapist",
    "company": "SonderMind",
    "description": "Remote Mental Health Therapist at SonderMind summary: As a Remote Mental Health Therapist at SonderMind, you will provide compassionate therapy services to individuals seeking mental health support. The role offers flexibility in scheduling, clinical autonomy, and the opportunity to join a supportive community of therapists. With guaranteed pay and commitment to professional development, you will have the resources needed to make a meaningful impact in your clients' lives. SonderMind is a leadi…",
    "location": "Schnecksville, Lehigh County",
    "is_remote": true,
    "posted_date": "2025-04-09T12:35:29",
    "url": "https://www.adzuna.com/land/ad/5137282132?se=vhXog8wV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=27E94BF3CB95B1B0B5451BCAB0FE5D8D6D745D0A",
    "skills": [],
    "salary_range": "£70,974"
  },
  {
    "title": "Stylist in Training - Easton",
    "company": "Supercuts Careers",
    "description": "Are you a soon-to-be graduate or already a graduate from Beauty School ? If so, we have Stylist-in-Training positions. We look forward to continuing to train our future stylist and to help you learn the business by supporting you every step of the way, on your very first day. We have the best training in the industry for recent graduates of beauty school And you get paid while you are learning and gaining confidence.  Please note that you must be enrolled or a graduate from Beauty School and ha…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:24:58",
    "url": "https://www.adzuna.com/land/ad/5137912566?se=vhXog8wV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=C5A1007276F9C13BFB7533683989D9563E11DAC4",
    "skills": [
      "AI"
    ],
    "salary_range": "£37,758"
  },
  {
    "title": "Class A Company Driver, Local, Dry Van",
    "company": "HCSC",
    "description": "Job Summary Company Driver (W2, Solo) Dry Van Local $700 - $900 total weekly avg. pay 300 - 700 avg. miles per week Dedicated Day shift 100% Driver Load/Unload Home Time 5 days on, 2 days off Home at least 3 weekends per month Benefits Medical, Dental, Vision, Life and 401K Paid holidays Paid vacation Core Responsibilities include, but are not limited to Maintaining a clean, sanitary, and safe work area. Inspection of vehicle, equipment, and cargo to ensure everything is safe, legal, and secure…",
    "location": "Aquashicola, Carbon County",
    "is_remote": false,
    "posted_date": "2025-04-10T00:05:13",
    "url": "https://www.adzuna.com/details/5138177476?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "£36,400 - £46,800"
  },
  {
    "title": "Warehouse Wave Planning Coordinator",
    "company": "GEODIS Career",
    "description": "WAVE PLANNING COORDINATOR Text DELIVER to 88300 to apply or check out more jobs at www.workatGEODIS.com  Look what you’ll get by joining the GEODIS team Get Good Money – Fair pay and some jobs come with bonus opportunities. Get the Right Job/Right Schedule – Part-time, full-time, seasonal – days, nights, weekends, and even gig work. We have the job and shift you want. Get Paid Early – Pay day as early as you want. Access your earnings on demand. Get Free Healthcare – Access to telemedicine from…",
    "location": "Northampton, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T00:34:10",
    "url": "https://www.adzuna.com/details/5136678851?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "£47,543"
  },
  {
    "title": "Travel X-Ray Tech - $2,158 per week in Bethlehem, PA",
    "company": "OneStaff Medical",
    "description": "We. Are. OneStaff. Medical. An independently-owned, nationally-recognized and amazingly awesome staffing firm ready to work for you A work ethic forged in the Midwest, we are here to stand by your side and help you find your dream assignment anywhere in this great country. We want the same like-minded, awesome candidates to travel with us. Be bold. Enjoy work again. Let us help. THE POSITION: X-ray Technologist use cutting-edge imaging methods to visualize the inside of the human body. The pict…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T08:29:42",
    "url": "https://www.adzuna.com/land/ad/5137121166?se=vhXog8wV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=7B6C35B6317CA6909F40A4787F11FF9911131655",
    "skills": [
      "AI"
    ],
    "salary_range": "£103,586"
  },
  {
    "title": "Associate Dean of Performing Arts",
    "company": "DeSales University",
    "description": "ASSOCIATE DEAN OF PERFORMING ARTS OVERVIEW: DeSales University, in Center Valley, PA, is a private, coeducational, four-year liberal arts Salesian, Catholic university, under the leadership of the Oblates of Saint Francis de Sales. Founded in 1965, the 550-acre suburban campus is located 50 miles north of Philadelphia and about 90 miles southwest of New York City. A total enrollment of nearly 3,500 includes undergraduate day and evening students, and graduate students. DeSales has approximately…",
    "location": "Center Valley, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T00:58:54",
    "url": "https://www.adzuna.com/details/5136701531?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£67,811"
  },
  {
    "title": "Licensed Clinical Psychologist",
    "company": "Headway",
    "description": "Remote Licensed Clinical Psychologist Wage: Between $89-$174 an hour Are you a Licensed Clinical Psychologist looking to launch a private practice, or grow your existing practice? Headway can help you earn more through insurance Headway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run a flourishing private p…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:32:03",
    "url": "https://www.adzuna.com/land/ad/5136783012?se=vhXog8wV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=FB5D124AD1363F656C8FDAAD84EC3FDCA4793B78",
    "skills": [],
    "salary_range": "£143,074"
  },
  {
    "title": "CDL A Company Driver Local Dry Van $10,000 Sign On Bonus",
    "company": "PAN GLO TRANSPORT LLC",
    "description": "About the Company A Leader in commercial trucking, Pan Glo Transport provides outstanding, safe and professional transportation to our local and regional customers. We Offer:•Great Equipment Uniforms Provided Great pay and Benefits•Family Owned Business About the Job Experienced Fulltime Class A CDL Driver needed in Bethlehem, PA area- Great Pay Home Daily on most trips, few layover trips Compensation: starting at $1,200 a week plus .50 cents a mile $30 a stop and $75 for locals. Qualifications…",
    "location": "Macungie, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T22:58:35",
    "url": "https://www.adzuna.com/details/5138114825?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£62,400 - £104,000"
  },
  {
    "title": "Regional CDL A Driver Home Every Weekend",
    "company": "Fleetmaster Express, Inc",
    "description": "Job Description:  Regional CDL-A Truck Driver Home Every Weekend Join Fleetmaster Express, where your hard work is rewarded with competitive pay, excellent benefits, and consistent home time.​ What We Offer:  Competitive Pay:  Earn an average of $1,500 - $1,800 per week, with pay based on practical miles both loaded and empty. ​  Home Time:  Enjoy being home every weekend, ensuring quality time with your loved ones.  Comprehensive Benefits:  Insurance: Major medical, dental, vision, and life in…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T13:47:31",
    "url": "https://www.adzuna.com/details/5137417575?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "Express"
    ],
    "salary_range": "£52,285"
  },
  {
    "title": "Delivery Driver - No Experience Needed (Macungie)",
    "company": "DoorDash",
    "description": "Why Deliver with DoorDash? DoorDash is the 1 category leader in food delivery, food pickup, and convenience store delivery in the US, trusted by millions of customers every day. As a Dasher, you’ll stay busy with a variety of earnings opportunities and can work when it works for you. Whether you’re looking for a side hustle or a full-time gig, delivering with DoorDash gives you the opportunity to earn extra cash on your terms. - Multiple ways to earn: Whether you’re delivering meals, groceries,…",
    "location": "Macungie, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:56:00",
    "url": "https://www.adzuna.com/land/ad/5137964560?se=vhXog8wV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=FCEBA65ED385C1949331E33FD163E419F066B536",
    "skills": [
      "Go"
    ],
    "salary_range": "£60,952"
  },
  {
    "title": "Semi-Local, Class A Company Driver (W2) Dedicated Routes",
    "company": "ZILKA & CO",
    "description": "About the Company Zilka & Company is a family-owned and operated company. Our family has been in the bakery supply business since 1923. About the Job Hotel provided for overnight stays. We have dedicated customers so we deliver to the same places on a regular schedule. Job Summary Company Driver (W2, Solo) Dry Van Semi local $1,000 - $1,200 total weekly avg. pay 1,250 - 2,000 avg. miles per week Dedicated No Driver Load/Unload Home Time 5 days on, 2 days off Home every weekend Benefits Medical,…",
    "location": "Breinigsville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T00:24:36",
    "url": "https://www.adzuna.com/details/5138196200?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£52,000 - £62,400"
  },
  {
    "title": "LMFT (Virtual)",
    "company": "Headway",
    "description": "Remote Licensed Marriage and Family Therapist (LMFT) Wage: Between $86-$120 an hour Are you a Licensed Marriage and Family Therapist looking to launch a private practice, or grow your existing practice? Headway can help you earn more through insurance Headway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run …",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:32:04",
    "url": "https://www.adzuna.com/land/ad/5136783076?se=vhXog8wV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=69DD0F898CA9520A31E184055AFBC8C7C3BC8A26",
    "skills": [],
    "salary_range": "£102,892"
  },
  {
    "title": "Wheeled Vehicle Mechanic",
    "company": "U.S. Army",
    "description": "No Experience Necessary ABOUT THIS JOB THIS POSITION REQUIRES AN ENLISTMENT IN THE U.S. ARMY OR ARMY RESERVE As a Wheeled Vehicle Mechanic, you'll supervise and perform maintenance, repair, and recovery operations on wheeled vehicles and select armored vehicles that serve the Army in a variety of mission-critical roles. Career opportunities range from heating and cooling mechanics to vehicle mechanics who service aircraft, wheeled and tracked vehicles, heavy equipment and watercraft. Skills you…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:33:38",
    "url": "https://www.adzuna.com/land/ad/5136788758?se=vhXog8wV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=0A36839AA7B843A8DD43049D643D100FDD8B0268",
    "skills": [
      "AI"
    ],
    "salary_range": "£47,864"
  }
]