[
  {
    "title": "Senior Transportation Project Manager-Civil Engineer",
    "company": "Fisher Associates, P.E., L.S., L.A., D.",
    "description": "Full-time Description Remote, however candidate must reside near Allentown, PA Are you ready to drive success? Fisher Associates is on the hunt for a dynamic Senior Transportation Project Manager to help lead our Transportation Group. If you're passionate about business development, adept at managing both technical and administrative projects, and skilled in transportation management, we want you to be on our team. Take charge of our day-to-day operations, logistics, and project management, and…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T03:23:31",
    "url": "https://www.adzuna.com/details/5141866629?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£120,000 - £150,000",
    "match_percentage": null
  },
  {
    "title": "Infrastructure & Capital Projects - Engineering Management Consultant",
    "company": "AH Anderson Consulting, LLC",
    "description": "Job Description Job Description We are: AH Anderson Consulting services are tailored to helping companies become more productive, competitive and sustainable with over 30 years of business operations and consulting experience, in specific industries. AH Anderson Consulting's passion is to help organizations become more productive, efficient and competitive. With more than 30 years of business and consulting experience, we have designed and delivered a wide array of business solutions to improve…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T11:43:13",
    "url": "https://www.adzuna.com/details/5142136533?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£118,627",
    "match_percentage": null
  },
  {
    "title": "Mobile Technician",
    "company": "ABM Industries",
    "description": "The Mobile Technician is responsible for performing a variety of maintenance tasks to ensure that the building, equipment, and systems are properly maintained and operating efficiently. This role includes surveying, troubleshooting, basic repairs, and preventive maintenance on mechanical, electrical, HVAC, plumbing, refrigeration, and other systems within the facility. The Mobile Technician will work closely with account manager and project manager to ensure projects and surveys are completed i…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T21:45:49",
    "url": "https://www.adzuna.com/land/ad/5142792182?se=Yt87EiAY8BGlD81SPiZXLA&utm_medium=api&utm_source=71cf92b8&v=8AAAA2A3944813C2E27870ACDE9EFBA0AA768273",
    "skills": [],
    "salary_range": "£41,335",
    "match_percentage": null
  },
  {
    "title": "Senior Estimator - Pay up to 220K DOE",
    "company": "SST Direct",
    "description": "Seeking a Senior Estimator for a direct hire opportunity with a New York-based civil infrastructure and energy construction company. The position will be based out of the office in Allentown, PA. Pay: $150K-220K based on experience. A Hybrid role can be discussed. Benefits packages include : Medical, prescription drug, dental, vision, Health Savings Account (HSA), short/long term disability and life Insurance We offer a 401k with 5% employer match Potential for annual performance-based raise Pa…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T17:04:12",
    "url": "https://www.adzuna.com/details/5142628526?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£94,051",
    "match_percentage": null
  },
  {
    "title": "Journeyman Carpenter",
    "company": "SERVPRO of Allentown",
    "description": "Job Description Job Description Benefits: 401(k) 401(k) matching Bonus based on performance Company car Dental insurance Free uniforms Health insurance Paid time off Vision insurance Servpro is an industry leader in property damage restoration with over 2,200 locations nationwide. Our local franchises serve Allentown, Lehigh County, Carbon County, and the Poconos. Position Description: Our Reconstruction Department specializes in restoring residential and commercial structures affected by prope…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T02:16:51",
    "url": "https://www.adzuna.com/details/5141829383?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£110,392",
    "match_percentage": null
  },
  {
    "title": "Part time Digital Marketing Specialist",
    "company": "APR Consulting",
    "description": "Part time Digital Marketing Specialist Location: Allentown, Pennsylvania Type: Contract Job 80277 APR Consulting, Inc. has been engaged to identify a Digital Marketing Specialist Location: Allentown, PA 18103 Position: Digital Marketing Specialist Pay Rate: $40/hr Duration: 52 weeks (1 year) Expected Shift: 10am to 2pm, 20 hrs/week JOB SUMMARY Local candidates preferred, hybrid schedule. Ideally, candidates should provide work samples for review and be willing to complete an initial assignment.…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T17:42:24",
    "url": "https://www.adzuna.com/details/5142654056?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£58,989",
    "match_percentage": null
  },
  {
    "title": "Engineering Technician - Dynamic Earth",
    "company": "Dynamic Engineering Consultants, PC",
    "description": "Founded in 2004, Dynamic Engineering Consultants, P.C., and its Family of Companies; Dynamic Earth, Dynamic Survey, and Dynamic Traffic, has emerged as one of the top Land Development Consulting Firms in the nation. Originating in New Jersey, the firm has grown to over 350 employees and 15 offices nationally. Dynamic caters to the demands of various Fortune 500 Companies, as well as an array of independent owners and developers of all sizes. We have built our company to offer a unique consultin…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-12T21:40:00",
    "url": "https://www.adzuna.com/details/5142785128?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£75,798",
    "match_percentage": null
  },
  {
    "title": "Full Stack Java Developer",
    "company": "The Social Station",
    "description": "Job Description Job Description We are a technology startup based in the Lehigh Valley, PA (Allentown area) with an opening for a Full Stack Java Developer. This is a full-time position based out of the Lehigh Valley. At The Social Station we are building the next generation social media marketing platform for agencies and brands. We develop native mobile applications, web-based tools, and backend systems to power our platform. We work with clients across the United States and employ a team of …",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T02:23:59",
    "url": "https://www.adzuna.com/details/5141837430?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "java"
    ],
    "salary_range": "£87,336",
    "match_percentage": null
  },
  {
    "title": "Sr. Staff Engineer - Controls",
    "company": "B. Braun US Device Manufacturing LLC",
    "description": "B. Braun Medical, Inc. Company: B. Braun US Device Manufacturing LLC Job Posting Location: Allentown, Pennsylvania, United States Functional Area: Other Areas Working Model: Onsite Days of Work: Friday, Thursday, Wednesday, Tuesday, Monday Shift: 5X8 Relocation Available: No Requisition ID: 3902 B. Braun Medical Inc., a leader in infusion therapy and pain management, develops, manufactures, and markets innovative medical products and services to the healthcare industry. Other key product areas …",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T11:53:30",
    "url": "https://www.adzuna.com/details/5142143539?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£81,371",
    "match_percentage": null
  },
  {
    "title": "Director of Web Development",
    "company": "TheMasonGroup",
    "description": "Job Description Job Description Director, Web Development Are you ready to break free of the mundane? Seeking a clear path to grow? Seeking a career with purpose that will bring value to the community, people, and organizations? Giving the opportunity to continuously innovate? Where you can be part of a company that knows developing an amazing team makes all the difference, where each day brings a new challenge? Look no further We are searching for a leader for our web development team. The Dir…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-12T02:21:28",
    "url": "https://www.adzuna.com/details/5141835124?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£91,101",
    "match_percentage": null
  },
  {
    "title": "Production Operator",
    "company": "Niagara Bottling",
    "description": "At Niagara, we’re looking for Team Members who want to be part of achieving our mission to provide our customers the highest quality most affordable bottled water. Consider applying here, if you want to: Work in an entrepreneurial and dynamic environment with a chance to make an impact. Develop lasting relationships with great people. Have the opportunity to build a satisfying career. We offer competitive compensation and benefits packages for our Team Members. Production Operator This position…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T04:27:13",
    "url": "https://www.adzuna.com/details/5141910603?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£48,769",
    "match_percentage": null
  },
  {
    "title": "Electrical Engineering Intern",
    "company": "Sumitomo shi Cryogenics Of America Inc",
    "description": "Job Description Job Description Sumitomo (SHI) Cryogenics of America, Inc., a leading worldwide provider of innovative cryogenic and vacuum solutions to the medical, semiconductor, and research industries, is looking for an Engineering Intern to work out of our Allentown, PA headquarters. As an intern, you will gain hands-on experience, learn from resident engineering experts and collaborate with teams focused on the latest cryogenic and vacuum technologies. This is a full-time temporary positi…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T14:29:13",
    "url": "https://www.adzuna.com/details/5142289476?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£35,811",
    "match_percentage": null
  },
  {
    "title": "Marketing Specialist Job at Valley Youth House in Bethlehem",
    "company": "Valley Youth House",
    "description": "Marketing Specialist Location: Bethlehem ($18hr - $24hr) The Organization: Valley Youth House is a nonprofit organization that empowers and strengthens the lives of children, youth, and families through inclusive programming that builds resilience and fosters growth and independence. Valley Youth House works from a Trauma Informed / Healing Centered perspective, incorporating positive youth and human development, and cultural awareness into all aspects of our agency. The agency is committed to …",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-12T16:02:10",
    "url": "https://www.adzuna.com/details/5142552027?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£52,023",
    "match_percentage": null
  }
]