[
  {
    "title": "Remote Sales Jobs: Earn While Working from Home",
    "company": "Winterfell and Company",
    "description": "Exciting Opportunity for Experienced Agents: Join Our Dynamic Team Are you an experienced agent looking for an unparalleled opportunity? Our rapidly growing agency is seeking a few exceptional agents to join our team. Here’s what sets us apart: In-Bound Leads: No cold calls, only in-bound leads. Remote Sales: Enjoy the flexibility of 100% remote sales. Exclusive Products: Access to multiple products with superior pricing. Automated CRM: Clients automatically booked on your calendar via SMS. Hea…",
    "location": "Allentown, Lehigh County",
    "is_remote": true,
    "posted_date": "2025-04-09T17:12:30",
    "url": "https://www.adzuna.com/details/5137777507?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£118,936"
  },
  {
    "title": "Direct Care Worker - Northampton",
    "company": "365 Health Services",
    "description": "365 Health Services is looking to add a new Direct Care Workers to join our Allentown team. The Direct Care Worker will assist residents in their homes with all daily living activities. These activities include everyday living, housekeeping, bathing and dressing, transportation, cooking, shopping, toileting, medication reminders, mobility, and continence care. The ideal person for this position has the experience, compassion, and a solid understanding of all aspects of patient home health care.…",
    "location": "Northampton, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T14:51:45",
    "url": "https://www.adzuna.com/details/5139225522?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£40,070"
  },
  {
    "title": "Direct Support Professional",
    "company": "Help at Home",
    "description": "Help at Home is hiring TODAY in your community and we are offering a $1,000 sign-on bonus to join our team Start your career with the nation’s leading provider of in-home support to seniors and become a hero for someone in your community. Do You: Enjoy working with people and thrive when you have one-on-one interaction with others. Treat people as a unique and special person and not merely as a case, patient, project, or burden. Prefer a variety of tasks in a day. Don't want a desk job. Use pos…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T00:56:13",
    "url": "https://www.adzuna.com/land/ad/5138234309?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=0486BD2D5A643E8042442BE0C80B00B7735B828D",
    "skills": [],
    "salary_range": "£30,647"
  },
  {
    "title": "Licensed Psychiatrist",
    "company": "Headway",
    "description": "Remote Licensed Psychiatrist Wage: Between $157-$238 an hour Are you a licensed Psychiatrist looking to launch a private practice, or grow your existing practice? Headway can help you earn more through insurance Headway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run a flourishing private practice. Mental h…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T09:25:30",
    "url": "https://www.adzuna.com/land/ad/5138715892?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=B4EE991A18A5FBA93D120C87D629ED9BCCEBF2A6",
    "skills": [],
    "salary_range": "£199,437"
  },
  {
    "title": "Registered Nurse (RN) - 3rd Shift - $7,500 HIRING BONUS",
    "company": "Haven Behavioral Healthcare",
    "description": "Full-time RN  3rd Shift: 11p-7:30a (4-8hr shifts/week)  NEW GRADS WELCOME  Comprehensive Benefits Package (Medical, Dental, Vision, 401k w/company match, PTO, shift differentials, and more)  Competitive Pay Rates, Shift Differentials, and $7,500 Hiring Bonus About Haven Behavioral Hospital of Eastern PA Haven Behavioral Hospital of Eastern PA is an 86 bed acute-care Joint Commission Accredited psychiatric hospital that offers care for adults dealing with mental health conditions and co-occurrin…",
    "location": "Klines Corner, Berks County",
    "is_remote": false,
    "posted_date": "2025-04-10T14:19:15",
    "url": "https://www.adzuna.com/land/ad/5139114130?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=8438BFF74D646F3EB464FC039EC0D8090C76572B",
    "skills": [],
    "salary_range": "£72,956"
  },
  {
    "title": "Licensed Mental Health Therapist (Virtual)",
    "company": "Headway",
    "description": "Remote Licensed Mental Health Therapist (LMHT) Wage: Between $86-$120 an hour Are you a Licensed Mental Health Therapist looking to launch a private practice, or grow your existing practice? Headway can help you earn more through insurance Headway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run a flourishin…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T09:25:30",
    "url": "https://www.adzuna.com/land/ad/5138715934?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=76DB060E1B6FF3631EFE6E8825BE79E0AB7B2874",
    "skills": [],
    "salary_range": "£96,190"
  },
  {
    "title": "Companion Aide",
    "company": "Charlie's Angels ",
    "description": "Job Title: Companion Aide Location: [Bethlehem, Pa] Job Type: [Part-Time] Company: [Charleys Angels Healthcare Network] Job Summary: We are seeking a compassionate and dedicated Companion Aide to provide support and companionship to individuals in need of assistance due to age, illness, or disability. The ideal candidate will enhance the quality of life for our clients through social interaction, personal care, and assistance with daily activities. If you have a passion for helping others and a…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T09:28:05",
    "url": "https://www.adzuna.com/details/5137164985?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£31,143"
  },
  {
    "title": "Occupational Therapist",
    "company": "The Weston Group",
    "description": "The Weston Group is dedicated to providing evidence-based, person-centered therapeutic services to residents. We are proud to remain a therapist-owned and operated company that believes in a unique and innovative approach to geriatric care. We are looking for a committed and patient-focused PRN Occupational Therapist to join our rehab team . We're seeking an Occupational Therapist to help develop, recover and maintain the daily living and work skills of people with physical, mental, or developm…",
    "location": "Forks, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T23:19:12",
    "url": "https://www.adzuna.com/details/5138135881?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£104,000 - £114,400"
  },
  {
    "title": "Direct Support Professional BH",
    "company": "RHA Health Services, LLC",
    "description": "We are hiring for: Direct Support Professional BH Type: Regular If you are a positive and personable individual looking for a satisfying and fun opportunity to make a real difference in the lives of people with intellectual, developmental disabilities, and people facing mental health, and substance use challenges, join our team at RHA Health Services The Behavioral Health Direct Support Professional (DSP) plays a vital role in supporting individuals with mental health and/or behavioral health c…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T09:22:30",
    "url": "https://www.adzuna.com/details/5138710229?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£34,546"
  },
  {
    "title": "Warehouse Person (Loader) - Evenings",
    "company": "PepsiCo",
    "description": "PBNA $22.51 / hour CLICK HERE to view our Warehouse Person (Loader) Realistic Job Preview Video This labor-intensive position is responsible for hand building pallets of product for bulk, and route trucks. Each type of loading requires strict attention to order accuracy with respect to loading outgoing trucks and unloading incoming trucks. Works from Electronic order system or order sheets to build loads using a forklift and/or electronic pallet jack. Position is responsible for accuracy in loa…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T09:20:17",
    "url": "https://www.adzuna.com/details/5137157046?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "Go"
    ],
    "salary_range": "£35,911"
  },
  {
    "title": "Automotive Technicians with PA Inspection License",
    "company": "Mavis Tire Supply",
    "description": "Mavis Discount Tire - Automotive Technicians with PA Inspection License Put your career into high gear with Mavis Discount Tire We're looking for full-time Automotive Technicians with PA Inspection license to join Team Mavis at one or our state-of-the-art automotive service, repair and tire sales centers in the Quakertown, PA area. With over 2,000 retail locations, Mavis is one of the largest tire sales and automotive repair chains in the United States. About the Position of Automotive Technici…",
    "location": "Wescosville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T20:53:41",
    "url": "https://www.adzuna.com/details/5138008699?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£60,000 - £85,000"
  },
  {
    "title": "Full-time LPN - 2nd Shift - $3,000 HIRING BONUS",
    "company": "Haven Behavioral Healthcare",
    "description": "Full-time LPN  2nd Shift: 3p-11:30p (4-8hr shifts/week)  NEW GRADS WELCOME  Comprehensive Benefits Package (Medical, Dental, Vision, 401k w/company match, PTO, and more)  Competitive Pay Rates & $3,000 Hiring Bonus About Haven Behavioral Hospital of Eastern PA Haven Behavioral Hospital of Eastern PA is an 86 bed acute-care Joint Commission Accredited psychiatric hospital that offers care for adults dealing with mental health conditions and co-occurring disorders. We are dedicated to partnering …",
    "location": "Klines Corner, Berks County",
    "is_remote": false,
    "posted_date": "2025-04-10T14:10:32",
    "url": "https://www.adzuna.com/land/ad/5139081329?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=22C90E148064A2618CA571CD2493FCACF49A6584",
    "skills": [],
    "salary_range": "£53,537"
  },
  {
    "title": "Certified Surgical Technician",
    "company": "The Center for Specialized Surgery ",
    "description": "No weekends, overnights, holidays, or on call Busy (3) OR & (1) Procedure Room ASC that specializes in ophthalmology, retina, ENT, ortho, pain management, GYN and podiatry for pediatric and adult patients. REQUIREMENTS : A graduate of an accredited Surgical technologist program. Certification and BLS required. Prefer one year of surgical experience in the Operating Room GENERAL SUMMARY OF DUTIES : Surgical Technologists, also called scrubs and surgical or operating room technicians, assist in s…",
    "location": "Butztown, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T01:03:54",
    "url": "https://www.adzuna.com/land/ad/5138247397?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=419A638E9EAED9A9683299BB6B585CF91AB97C64",
    "skills": [
      "AI"
    ],
    "salary_range": "£74,935"
  },
  {
    "title": "LMHC (Remote)",
    "company": "Headway",
    "description": "Remote Licensed Mental Health Counselor (LMHC) Wage: Between $86-$120 an hour Are you a Licensed Mental Health Counselor looking to launch a private practice, or grow your existing practice? Headway can help you earn more through insurance Headway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run a flourishin…",
    "location": "Allentown, Lehigh County",
    "is_remote": true,
    "posted_date": "2025-04-10T07:22:17",
    "url": "https://www.adzuna.com/land/ad/5138594713?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=8AE902ADC047590554ABDD33EE433F37BFE3E18F",
    "skills": [],
    "salary_range": "£86,515"
  },
  {
    "title": "Counter Sales",
    "company": "Johnstone Supply",
    "description": "Johnstone Supply is seeking to hire for our full-time Counter Sales position in our Easton, PA location . Are you an exceptional sales professional who is ready to have your evenings and weekends free ? Would you like to learn more about the HVAC/R trade in a family-focused environment where employees tend to stay a long time? If so, please read on This position earns a competitive wage of $20-$24/hr , as well as a $1,500 signing bonus You would be eligible for generous full-time benefits , inc…",
    "location": "Old Orchard, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T23:19:12",
    "url": "https://www.adzuna.com/details/5138135884?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£41,600 - £49,920"
  },
  {
    "title": "Staff Nurse OR (Part-Time)",
    "company": "The Center for Specialized Surgery ",
    "description": "JOB TITLE: Registered Nurse-OR ESSENTIAL FUNCTIONS: The delivery of patient care through the framework of the nursing process (assessment, diagnosis and patient outcome) in the preoperative, intraoperative and postoperative phase of the surgical patient. EDUCATION/EXPERIENCE: Graduate of an accredited school of nursing Current Registered Nurse License Current American Heart Assn BLS/ACLS/PALS certifications Minimum 1 year experience in the OR. Ability to circulated and scrub is preferred. KNOWL…",
    "location": "Butztown, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T01:03:30",
    "url": "https://www.adzuna.com/land/ad/5138247177?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=208063ADE4DBD92B9F760424E500A2372A45F198",
    "skills": [],
    "salary_range": "£67,812"
  },
  {
    "title": "Travel Radiology Technician - $2,762 per week",
    "company": "LeaderStat",
    "description": "LeaderStat is seeking a travel Radiology Technician for a travel job in Bethlehem, Pennsylvania. Job Description & Requirements Specialty: Radiology Technician Discipline: Allied Health Professional Start Date: 05/19/2025 Duration: 13 weeks 40 hours per week Shift: 8 hours, days Employment Type: Travel Estimated Pay Package : Up to $ 2762.20 per week The above pay package is an estimate, please contact our team to put together your personalized pay package, as a variety of factors can influence…",
    "location": "Butztown, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:44:30",
    "url": "https://www.adzuna.com/land/ad/5136808785?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=1804575F43AAFA5B6E0F7522ACA4DDDE04F10AA8",
    "skills": [],
    "salary_range": "Up to £143,624"
  },
  {
    "title": "Tax Senior",
    "company": "Gpac",
    "description": "Tax Senior Gpac houses a team of professional Recruiters who specialize in the Public Accounting industry The reputable clients we partner with are looking to add dedicated talent to their team Enjoy flexibility, career growth, and other great perks. Apply right away Responsibilities for Tax Senior: Ability to complete individual, trusts, partnerships, and corporate returns Assure compliance with federal, state, and local tax laws and regulations Tax research, tax projections, tax planning Acco…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T22:38:34",
    "url": "https://www.adzuna.com/details/5138094706?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AWS"
    ],
    "salary_range": "£70,000 - £100,000"
  },
  {
    "title": "Travel Physical Therapist - $2,126 per week",
    "company": "Go Healthcare",
    "description": "Go Healthcare is seeking a travel Physical Therapist for a travel job in Easton, Pennsylvania. Job Description & Requirements Specialty: Physical Therapist Discipline: Therapy Duration: 12 weeks 40 hours per week Shift: 8 hours, days Employment Type: Travel Go Healthcare Job ID 918680. Pay package is based on 8 hour shifts and 40 hours per week (subject to confirmation) with tax-free stipend amount to be determined. About Go Healthcare Go Healthcare Staffing focused on providing personalized, h…",
    "location": "Palmer, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:35:56",
    "url": "https://www.adzuna.com/land/ad/5137919985?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=ADD3E0E4F5A00DF9673EB3BEA5F1B3D64E1058B7",
    "skills": [
      "Go"
    ],
    "salary_range": "Up to £110,552"
  },
  {
    "title": "Radiologic Technologist - $2,500 SIGN-ON BONUS",
    "company": "PDI Health",
    "description": "$2,500 SIGN-ON BONUS Various Shifts Open - Immediate Interview Paid training in the field with Lead Tech Radiologic Technologist - Recent Grads encouraged to apply Are you an X-Ray tech tired of your 9-5 job? Do you want independence? Do you wish you had schedule flexibility? Well, you’ve come to the right place, PDI Health - Mobile X-Ray Technology PDI Health is a mobile examination services company providing on-site X-Ray and Ultrasound exams to nursing homes, assisted living facilities, and …",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T05:16:58",
    "url": "https://www.adzuna.com/details/5137003087?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£65,662"
  },
  {
    "title": "Travel CT Technologist - $2,875 per week",
    "company": "White Glove Placement",
    "description": "White Glove Placement is seeking a travel CT Technologist for a travel job in Allentown, Pennsylvania. Job Description & Requirements Specialty: CT Technologist Discipline: Allied Health Professional Duration: 13 weeks 40 hours per week Shift: 12 hours Employment Type: Travel Rewarding Allied health assignment available at this Famous Hospital Join their dynamic Allied Nursing team, and enjoy great hourly rates and benefits. We provide Housing, Insurance, Meal Allowance, and travel reimbursemen…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:12:21",
    "url": "https://www.adzuna.com/land/ad/5136735183?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=52E07F9CE668CC5C6196F1CF95EF3EB8A696AAC9",
    "skills": [
      "AI"
    ],
    "salary_range": "Up to £149,500"
  },
  {
    "title": "LPNP (Virtual)",
    "company": "Headway",
    "description": "Remote Licensed Psychiatric Nurse Practitioner Wage: Between $155-$203 an hour Are you a licensed Psychiatric Nurse looking to launch a private practice, or grow your existing practice? Headway can help you earn more through insurance Headway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run a flourishing pri…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T09:25:30",
    "url": "https://www.adzuna.com/land/ad/5138715871?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=98ADD5ECA097090F5618AA2E7B1DFFB28BA70A7B",
    "skills": [],
    "salary_range": "£103,802"
  },
  {
    "title": "Primary Care Physcian",
    "company": "AMN Healthcare",
    "description": "Job Description & Requirements Primary Care Physcian StartDate: ASAP Available Shifts: M-F Pay Rate: $275000.00 - $275000.00 Hiring Primary Care Physicians for Outpatient Internal Medicine clinics due to growth near Allentown, PA. Opportunity Highlights Prime Location — Enjoy a great location ranked a Best Place to Live and Best Place to Retire (US News) Solid Receive $100,000 in signing and retention bonuses Flexible Work Schedules — Enjoy flexible Monday – Friday work schedules, with some loc…",
    "location": "Wescosville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T05:38:56",
    "url": "https://www.adzuna.com/land/ad/5137010095?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=A618589ADDB586E5C20AF45B1A350C210EB5983D",
    "skills": [
      "AI"
    ],
    "salary_range": "£74,074"
  },
  {
    "title": "Travel Physical Therapist - $1,539 per week",
    "company": "Uniti Med",
    "description": "Uniti Med is seeking a travel Physical Therapist for a travel job in Easton, Pennsylvania. Job Description & Requirements Specialty: Physical Therapist Discipline: Therapy Start Date: 04/14/2025 Duration: 12 weeks Shift: days Employment Type: Travel UnitiMed Job ID 2143966. Posted job title: Therapy Physical Therapist (PT) About Uniti Med Uniti Med meticulously matches your talents to our open needs to ensure the ultimate travel experience. Tell us where you want to go and let our experienced s…",
    "location": "Palmer, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T18:40:57",
    "url": "https://www.adzuna.com/land/ad/5137874316?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=32E71D956FA2F2D1078C101DB1E23E3FFCE984D8",
    "skills": [
      "go"
    ],
    "salary_range": "Up to £80,028"
  },
  {
    "title": "Licensed Clinical Social Worker",
    "company": "Headway",
    "description": "Remote Licensed Clinical Social Worker (LCSW) Wage: Between $86-$120 an hour Are you a Licensed Clinical Social Worker looking to launch a private practice, or grow your existing practice? Headway can help you earn more through insurance Headway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run a flourishing …",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T07:22:17",
    "url": "https://www.adzuna.com/land/ad/5138594703?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=CE0E8D66AC2CF4C30582D1D1AEB8707612F50839",
    "skills": [],
    "salary_range": "£102,072"
  },
  {
    "title": "Licensed Psychiatric Nurse Practitioner (Virtual)",
    "company": "Headway",
    "description": "Remote Licensed Psychiatric Nurse Practitioner Wage: Between $155-$203 an hour Are you a licensed Psychiatric Nurse looking to launch a private practice, or grow your existing practice? Headway can help you earn more through insurance Headway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run a flourishing pri…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T09:25:30",
    "url": "https://www.adzuna.com/land/ad/5138715928?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=67B1172D899ECD298011D641A884228B415BCE2F",
    "skills": [],
    "salary_range": "£148,935"
  },
  {
    "title": "Travel Nurse RN - Hospice - $1,863 to $2,063 per week in Allentown, PA",
    "company": "TravelNurseSource",
    "description": "TravelNurseSource is working with Ventura Medstaff to find a qualified Hospice RN in Allentown, Pennsylvania, 18109 Pay Information $1,863 to $2,063 per week About The Position Are you ready to take your Travel career to the next level? See places you have not seen before? Ventura’s MedStaff tenured Recruiters are here to help you find your ideal contract; with over 50 years of combined experience. Markets have changed, but Ventura MedStaff has maintained a leader in the forefront of Therapy, A…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T02:13:07",
    "url": "https://www.adzuna.com/land/ad/5138379229?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=60960C4A56E31341A00C53826EB97E4BD8EE5A5E",
    "skills": [
      "AI"
    ],
    "salary_range": "£8,252"
  },
  {
    "title": "Licensed Clinical Social Worker (Virtual)",
    "company": "Headway",
    "description": "Remote Licensed Clinical Social Worker (LCSW) Wage: Between $86-$120 an hour Are you a Licensed Clinical Social Worker looking to launch a private practice, or grow your existing practice? Headway can help you earn more through insurance Headway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run a flourishing …",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T07:22:17",
    "url": "https://www.adzuna.com/land/ad/5138594698?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=104A6D5DDFEA4CB4FF7BCED44A19DA550A4326C8",
    "skills": [],
    "salary_range": "£95,858"
  },
  {
    "title": "Primary Care Physician",
    "company": "AMN Healthcare",
    "description": "Job Description & Requirements Primary Care Physician StartDate: ASAP Available Shifts: Monday - Friday 8-5pm Pay Rate: $275000.00 - $300000.00 Allentown, PA is great place to practice and this patient-centric Family Medicine Department values compassion, integrity and collaboration. Opportunity Highlights Prime Location — Enjoy a great location ranked a Best Place to Live and Best Place to Retire (US News) Solid Earning Potential — Experience a role with excellent earning potential, financial …",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T17:14:28",
    "url": "https://www.adzuna.com/land/ad/5139663738?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=A3659EC1525AD64EA4FE90FF02E78E4079A88517",
    "skills": [
      "AI"
    ],
    "salary_range": "£134,504"
  },
  {
    "title": "MILFORD, NJ CDL-A LOCAL DRIVER",
    "company": "System Freight",
    "description": "Pay $88,000 / year Experienced CDL-A drivers needed immediately for local, return home daily positions System Freight, Inc. (SFI) a premier, dedicated contract trucking and logistics company, established in 1975, has immediate, well-paying openings for experienced commercial drivers (CDL-A) in the Milford, NJ-area who are passionate about driving with a forward-thinking company. Benefits include: Local work return home daily. Excellent health, dental and vision plan with top tier benefits . Pai…",
    "location": "Hellertown, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T15:43:29",
    "url": "https://www.adzuna.com/land/ad/5139536616?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=98B661E83A9812C66892DB64A2C4B055DE3CB9F4",
    "skills": [
      "AI"
    ],
    "salary_range": "£67,187"
  },
  {
    "title": "Local Contract Nurse RN - Rehabilitation - $58 per hour",
    "company": "Becker Health/MedHQ",
    "description": "Becker Health/MedHQ is seeking a local contract nurse RN Rehabilitation for a local contract nursing job in Bethlehem, Pennsylvania. Job Description & Requirements Specialty: Rehabilitation Discipline: RN Start Date: 05/18/2025 Duration: 13 weeks 36 hours per week Shift: 12 hours, days Employment Type: Local Contract Rehab Hospital- Pediatric Unit Location: Bethlehem, PA 18017 Description: Rehabilitation Hospital Pediatric Unit is a specialized inpatient pediatric rehabilitation leader with pro…",
    "location": "Butztown, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:44:37",
    "url": "https://www.adzuna.com/land/ad/5136808959?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=34956F0F0088602000C8C3071461F86098FA2FC2",
    "skills": [],
    "salary_range": "Up to £120,640"
  },
  {
    "title": "Safety Investigator, Seasonal",
    "company": "Dorney Park",
    "description": "Overview:$18 / Hour Joining Dorney Park will teach you to be a risk manager in an entertainment environment Inspect and audit safety systems in a 200-acre facility. Conduct incident investigations and provide recommendations. Participate, develop, and improve safety training. Project work to meet your educational institution’s requirements. Some of our amazing perks and benefits: Paid Training FREE Uniforms FREE Admission to Dorney Park and our other properties FREE tickets for friends and fami…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T05:07:23",
    "url": "https://www.adzuna.com/land/ad/5136993291?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=014AE6F34ED9D2B7945C4476BAFD87F7214EC5FD",
    "skills": [
      "AI"
    ],
    "salary_range": "£55,178"
  },
  {
    "title": "Customer Service Representative",
    "company": "Uline, Inc.",
    "description": "Customer Service Representative Pay from $22 to $27 per hour with significant growth and earning potential Pennsylvania Branch 700 Uline Way, Allentown, PA 18106 Morning Call’s Top Large Employer of 2025 Customer Service is the heartbeat of Uline As a Customer Service Representative, you’ll dig into order details to deliver an exceptional experience our customers love. Our company continues to grow, creating new career opportunities and job stability you can count on. Position Responsibilities …",
    "location": "Wescosville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T11:05:32",
    "url": "https://www.adzuna.com/land/ad/5138834357?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=7423D44A4EB8F2A0FBD35DD0B525698E7CDB778B",
    "skills": [
      "AI"
    ],
    "salary_range": "£58,636"
  },
  {
    "title": "Site/Civil Engineer",
    "company": "Remington & Vernick Engineers",
    "description": "Job Description Job Description POSITION SUMMARY: The Engineering Technician – Civil/Site is a position with 0-3 years of experience working under the supervision of a Senior Engineering Technician or Project Manager. This individual will assist with engineering and design during all phases of projects primarily located in and around the Lehigh Valley region of Pennsylvania. This opportunity focuses on Land Development design and permitting, but also exposes the successful candidate to related …",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T02:20:37",
    "url": "https://www.adzuna.com/land/ad/5136853493?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=F27DF70E778A2FB48561B652C679E3719F29AE30",
    "skills": [],
    "salary_range": "£78,959"
  },
  {
    "title": "LMHT (Virtual)",
    "company": "Headway",
    "description": "Remote Licensed Mental Health Therapist (LMHT) Wage: Between $86-$120 an hour Are you a Licensed Mental Health Therapist looking to launch a private practice, or grow your existing practice? Headway can help you earn more through insurance Headway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run a flourishin…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:32:04",
    "url": "https://www.adzuna.com/land/ad/5136783106?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=1F5F397E4BCC58053BBA9C95A9A6D6F36CE851C4",
    "skills": [],
    "salary_range": "£88,238"
  },
  {
    "title": "Customer Service Representative - Bilingual",
    "company": "Uline, Inc.",
    "description": "Customer Service Representative - Bilingual Pay from $23 to $28 per hour with significant growth and earning potential Pennsylvania Branch 700 Uline Way, Allentown, PA 18106 Morning Call’s Top Large Employer of 2025 Customer Service is the heartbeat of Uline As a Bilingual Customer Service Representative, you’ll dig into order details to deliver an exceptional experience our customers love. Our company continues to grow, creating new career opportunities and job stability you can count on. Posi…",
    "location": "Schnecksville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T08:20:01",
    "url": "https://www.adzuna.com/land/ad/5138660932?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=FA3515FF9972877A657C7A14766A988582D90F37",
    "skills": [
      "AI"
    ],
    "salary_range": "£53,130"
  },
  {
    "title": "Travel Physical Therapist - $1,888 per week",
    "company": "Care Team Solutions",
    "description": "Care Team Solutions is seeking a travel Physical Therapist for a travel job in Easton, Pennsylvania. Job Description & Requirements Specialty: Physical Therapist Discipline: Therapy Start Date: 04/14/2025 Duration: 13 weeks 40 hours per week Shift: 8 hours Employment Type: Travel Registered Nurse must have 2 years of recent experience in particular specialty Details: Must Have 2 Years of recent Allied Health experience. Specialty: Allied Health Discipline: Physical Therapist Start Date: 2025-04…",
    "location": "Palmer, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T18:40:53",
    "url": "https://www.adzuna.com/land/ad/5137874224?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=69860D5EDCC88808D20FD2CE5116D8AC5A576AB3",
    "skills": [
      "AI"
    ],
    "salary_range": "Up to £98,176"
  },
  {
    "title": "ULINE- Call Center Representative",
    "company": "Uline, Inc.",
    "description": "Customer Service Representative - Bilingual Pay from $23 to $28 per hour with significant growth and earning potential Pennsylvania Branch 700 Uline Way, Allentown, PA 18106 Morning Call’s Top Large Employer of 2025 Customer Service is the heartbeat of Uline As a Bilingual Customer Service Representative, you’ll dig into order details to deliver an exceptional experience our customers love. Our company continues to grow, creating new career opportunities and job stability you can count on. Posi…",
    "location": "Breinigsville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T14:49:22",
    "url": "https://www.adzuna.com/land/ad/5139223427?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=BA21A563B12A000950F316EE4934BE077346493D",
    "skills": [
      "AI"
    ],
    "salary_range": "£56,634"
  },
  {
    "title": "Licensed Professional Counselor",
    "company": "Headway",
    "description": "Remote Licensed Professional Counselor (LPC) Wage: Between $86-$120 an hour Are you a Licensed Professional Counselor looking to launch a private practice, or grow your existing practice? Headway can help you earn more through insurance Headway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run a flourishing p…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T09:25:30",
    "url": "https://www.adzuna.com/land/ad/5138715944?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=5AE681E6CD6D5D3CEB04CD294285E58FBE330E0B",
    "skills": [],
    "salary_range": "£100,517"
  },
  {
    "title": "Local CDL-A Driver (PM Shift) - 3 yrs EXP Required - Home Daily",
    "company": "System Freight",
    "description": "Pay $88,000 / year Experienced CDL-A drivers needed immediately for local, return home daily positions System Freight, Inc. (SFI) a premier, dedicated contract trucking and logistics company, established in 1975, has immediate, well-paying openings for experienced commercial drivers (CDL-A) in the Milford, NJ-area who are passionate about driving with a forward-thinking company. Benefits include: Local work return home daily. Excellent health, dental and vision plan with top tier benefits . Pai…",
    "location": "Hellertown, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T15:43:46",
    "url": "https://www.adzuna.com/land/ad/5139538689?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=3FCF25BC3022F81168BEDB40D8A270D894EB8D37",
    "skills": [
      "AI"
    ],
    "salary_range": "£71,095"
  },
  {
    "title": "Travel Rad Tech - $2,640 per week in Bethlehem, PA",
    "company": "Trustaff",
    "description": "About this job As a Radiology Tech, you'll complete diagnostic procedures by working directly with the patient to capture images requested by the attending physician. Radiologists/Rad Techs and CT Techs must have expert knowledge of the imaging equipment, its operation, and the imaging processes. Duties & Responsibilities Travelers work for a limited amount of time at a particular location, providing patient care and support before moving on to their next exciting adventure. Travel healthcare p…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T03:07:16",
    "url": "https://www.adzuna.com/land/ad/5138468431?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=9CDEC8EDBB352E3C81D0C6687217C33789E518F1",
    "skills": [],
    "salary_range": "£10,560"
  },
  {
    "title": "Licensed Psychiatric Nurse Practitioner",
    "company": "Headway",
    "description": "Remote Licensed Psychiatric Nurse Practitioner Wage: Between $155-$203 an hour Are you a licensed Psychiatric Nurse looking to launch a private practice, or grow your existing practice? Headway can help you earn more through insurance Headway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run a flourishing pri…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:32:01",
    "url": "https://www.adzuna.com/land/ad/5136782604?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=ED5487BC85E4BF278EB5CFCC55D8C0A82F5E74E4",
    "skills": [],
    "salary_range": "£170,771"
  },
  {
    "title": "Travel Physical Therapist - $1,737 per week",
    "company": "Solomon Page",
    "description": "Solomon Page is seeking a travel Physical Therapist for a travel job in Easton, Pennsylvania. Job Description & Requirements Specialty: Physical Therapist Discipline: Therapy Start Date: 04/14/2025 Duration: 13 weeks 40 hours per week Shift: 8 hours, days Employment Type: Travel Our client is seeking a Physical Therapist to join their growing team. As a Physical Therapist, you will work closely with patients to learn more about their conditions and create a personalized care plan. You will cons…",
    "location": "Palmer, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T22:27:46",
    "url": "https://www.adzuna.com/land/ad/5138081488?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=74AE93FC5A5FF3AA98F128436A8C8DBBBF057317",
    "skills": [],
    "salary_range": "Up to £90,324"
  },
  {
    "title": "Local CDL-A Driver (PM Shift) - 3 yrs EXP Required - Great Benefits",
    "company": "System Freight",
    "description": "Pay $88,000 / year Experienced CDL-A drivers needed immediately for local, return home daily positions System Freight, Inc. (SFI) a premier, dedicated contract trucking and logistics company, established in 1975, has immediate, well-paying openings for experienced commercial drivers (CDL-A) in the Milford, NJ-area who are passionate about driving with a forward-thinking company. Benefits include: Local work return home daily. Excellent health, dental and vision plan with top tier benefits . Pai…",
    "location": "Palmer, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T15:43:06",
    "url": "https://www.adzuna.com/land/ad/5139534769?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=F9C075B0199C9507E19770F8CF6ED18744E912FF",
    "skills": [
      "AI"
    ],
    "salary_range": "£68,988"
  },
  {
    "title": "Gopuff Delivery Driver Gigs",
    "company": "Gopuff",
    "description": "Do more than make ends meet. Deliver with Gopuff and get paid to deliver what your neighbors need from a Gopuff facility near you With one centralized pickup location and smaller delivery zones, Gopuff makes earning effortless. It's simple: deliver from a facility near you straight to the customer You’ll be delivering everyday essentials, from cleaning supplies, home needs and OTC medications to food, drinks and more. Sign up to be a Gopuff Delivery Partner today and experience the easiest way …",
    "location": "Butztown, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T13:41:55",
    "url": "https://www.adzuna.com/land/ad/5139053101?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=4537CB6BC331C25379B6D9A57A2328E74D022441",
    "skills": [
      "AI",
      "Go"
    ],
    "salary_range": "£72,300"
  },
  {
    "title": "Licensed Practical Nurse, LPN",
    "company": "Lehigh Commons",
    "description": "Overview: At Genesis Healthcare, we are dedicated to improving the lives we touch through the delivery of high-quality care and exceptional service. As a leading provider in the long-term care industry, we believe in fostering a collaborative, inclusive and supportive work environment where every team member is valued and empowered to make a difference. Whether you're an experienced professional or just starting your career, we offer opportunities for growth, development, and advancement in a r…",
    "location": "Macungie, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T14:59:27",
    "url": "https://www.adzuna.com/land/ad/5139268831?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=9DA7DC03C9DE75448BCE76BCC592291932E6526C",
    "skills": [],
    "salary_range": "£74,652"
  },
  {
    "title": "Maintenance Technician",
    "company": "Keurig Dr Pepper",
    "description": "Keurig Dr Pepper - JobID: 79742648512 [Field Technician / Maintenance Mechanic] As a Maintenance Technician at Keurig Dr Pepper, you'll: Troubleshoot and repair electrical and mechanical systems on equipment; Perform various equipment preventive maintenance tasks; Thoroughly document maintenance activity; Adequately communicate maintenance issues to appropriate employees; Properly utilize the maintenance inventory system. Hiring Immediately >>",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T02:22:03",
    "url": "https://www.adzuna.com/details/5138410166?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£58,375"
  },
  {
    "title": "Delivery Driver - No Experience Needed (Bowmanstown)",
    "company": "DoorDash",
    "description": "Why Deliver with DoorDash? DoorDash is the 1 category leader in food delivery, food pickup, and convenience store delivery in the US, trusted by millions of customers every day. As a Dasher, you’ll stay busy with a variety of earnings opportunities and can work when it works for you. Whether you’re looking for a side hustle or a full-time gig, delivering with DoorDash gives you the opportunity to earn extra cash on your terms. - Multiple ways to earn: Whether you’re delivering meals, groceries,…",
    "location": "Bowmanstown, Carbon County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:53:47",
    "url": "https://www.adzuna.com/land/ad/5137954402?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=B59AC132213FF884AF190981689530320E1235C7",
    "skills": [
      "Go"
    ],
    "salary_range": "£52,400"
  },
  {
    "title": "Online Survey Taker. Earn up to $25 per survey. - Remote",
    "company": "Three Hyphens",
    "description": "Job description We are urgently looking for people interested in taking online surveys for Fortune 500 brands. If you are a self-starter, looking for flexible hours throughout the week, this may be for you Earn up to $25 per survey. Share your opinion and help influence brand decisions on services and products you use every day. What We Expect - Your honest opinion - Attention to details - Basic computer and internet skills - No experience required To Qualify: - You must be 18 years old - Have …",
    "location": "Allentown, Lehigh County",
    "is_remote": true,
    "posted_date": "2025-04-10T11:04:27",
    "url": "https://www.adzuna.com/land/ad/5138834132?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=1FD2EF4B23077A4E8B26B26A12583F3671D76165",
    "skills": [
      "AI"
    ],
    "salary_range": "£43,195"
  },
  {
    "title": "Become a Gopuff Driver - Sign Up Today",
    "company": "Gopuff",
    "description": "Do more than make ends meet. Deliver with Gopuff and get paid to deliver what your neighbors need from a Gopuff facility near you With one centralized pickup location and smaller delivery zones, Gopuff makes earning effortless. It's simple: deliver from a facility near you straight to the customer You’ll be delivering everyday essentials, from cleaning supplies, home needs and OTC medications to food, drinks and more. Sign up to be a Gopuff Delivery Partner today and experience the easiest way …",
    "location": "Fountain Hill, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T13:41:55",
    "url": "https://www.adzuna.com/land/ad/5139053091?se=KJUjZFMW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=B589E2E7DD653964C3983BF0DF45EA1F4D6096A3",
    "skills": [
      "AI",
      "Go"
    ],
    "salary_range": "£58,008"
  }
]