[
  {
    "title": "Truck Driver - CDL Class A - $15K Retention Bonus - Penske Logistics",
    "company": "Penske",
    "description": "Immediate Opportunities: Full-time Local Class A CDL Truck Drivers - Average $88426 annually - $15,000 Retention Bonus - Home daily - Dedicated route What you will do: - Perform multi-stop deliveries of parts and supplies to automotive dealerships - Unload trailer using manual pallet jacks, hand trucks, and rolling cages - Use scanner to scan products as they are unloaded and delivered - 10 stops per route Schedule: - Tuesday through Saturday with a 3:00 AM start time - Consecutive days off You…",
    "location": "Nazareth, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T11:32:31",
    "url": "https://www.adzuna.com/details/5138858899?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£72,551"
  },
  {
    "title": "Travel CT Technologist - $2,511 per week",
    "company": "Supplemental Health Care",
    "description": "Supplemental Health Care is seeking a travel CT Technologist for a travel job in Allentown, Pennsylvania. Job Description & Requirements Specialty: CT Technologist Discipline: Allied Health Professional Start Date: ASAP Duration: 13 weeks 36 hours per week Shift: 12 hours, days Employment Type: Travel Job Description: Supplemental Health Care is seeking CT Technologists in Allentown, Pennsylvania for a 13-week assignment at a partnering hospital. Whether it’s local assignments close to home or …",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T11:34:10",
    "url": "https://www.adzuna.com/land/ad/5138861567?se=DFHCa1MW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=252A5D132F4BECE29906C0A0A66951FA878F74FD",
    "skills": [],
    "salary_range": "Up to £130,572"
  },
  {
    "title": "CDL A Company Driver Local Dry Van $10,000 Sign On Bonus",
    "company": "PAN GLO TRANSPORT LLC",
    "description": "About the Company A Leader in commercial trucking, Pan Glo Transport provides outstanding, safe and professional transportation to our local and regional customers. We Offer:•Great Equipment Uniforms Provided Great pay and Benefits•Family Owned Business About the Job Experienced Fulltime Class A CDL Driver needed in Bethlehem, PA area- Great Pay Home Daily on most trips, few layover trips Compensation: starting at $1,200 a week plus .50 cents a mile $30 a stop and $75 for locals. Qualifications…",
    "location": "Walnutport, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T22:58:36",
    "url": "https://www.adzuna.com/details/5138114845?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£62,400 - £104,000"
  },
  {
    "title": "Customer Care Representative",
    "company": "TEKsystems",
    "description": "Customer Care Representative Northampton, PA Monday-Friday 8am-5pm Description - The Customer Care Representative provides outstanding service to our customers by responding to a high level of inbound customer calls, inquiries and requests which may require research and investigation to reach resolution. - Actively engages customers to ensure complete understanding of the issues and provide accurate and efficient responses in a prompt, respectful and courteous manner. - Demonstrates highly inte…",
    "location": "Northampton, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T11:39:50",
    "url": "https://www.adzuna.com/details/5138898550?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£45,748"
  },
  {
    "title": "U.S. ARMY MILITARY POLICE",
    "company": "U.S. Army",
    "description": "ABOUT THIS JOB THIS POSITION REQUIRES AN ENLISTMENT IN THE U.S. ARMY OR ARMY RESERVE Like the look of this opportunity Make sure to apply fast, as a high volume of applications is expected Scroll down to read the complete job description. As a Military Police, you'll protect peoples' lives and property on Army installations by enforcing military laws and regulations. You'll also control traffic, prevent crime, and respond to all emergencies. You'll conduct force protection, anti-terrorism, area…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T13:34:34",
    "url": "https://www.adzuna.com/details/5139033740?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AWS"
    ],
    "salary_range": "£50,770"
  },
  {
    "title": "Forklift Operator 1St Shift (Clamp)",
    "company": "Partners Personnel",
    "description": "Partners Personnel - JobID: northampton-forklift-operator-1st-shift-clamp [Warehouse Associate / Forklift Operator] As a Forklift Operator at Partners Personnel, you'll: Operate forklifts to move materials and products efficiently; Load and unload goods from trucks or storage facilities; Inspect machinery to ensure safety and functionality; Maintain accurate inventory records and report discrepancies; Follow safety protocols and company guidelines at all times; Assist in organizing and maintain…",
    "location": "Northampton, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T02:22:15",
    "url": "https://www.adzuna.com/details/5138410696?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI",
      "Go"
    ],
    "salary_range": "£40,034"
  },
  {
    "title": "Dietary Aide",
    "company": "Genesis Healthcare",
    "description": "Overview At Genesis Healthcare, we are dedicated to improving the lives we touch through the delivery of high-quality care and exceptional service. As a leading provider in the long-term care industry, we believe in fostering a collaborative, inclusive and supportive work environment where every team member is valued and empowered to make a difference. Whether you're an experienced professional or just starting your career, we offer opportunities for growth, development, and advancement in a ra…",
    "location": "Palmer, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T11:13:37",
    "url": "https://www.adzuna.com/details/5138839836?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£34,030"
  },
  {
    "title": "Experienced Tactical Security",
    "company": "GardaWorld",
    "description": "GardaWorld Security Services is Now Hiring a Tactical Security Officer PLEASE NOTE: HANDCUFF Certification / PEPPER SPRAY Certification / PREVIOUS MILITARY OR LAW ENFORCEMENT REQUIRED  (OCAT/PATH) Ready to suit up as a Tactical Security Guard in Easton, PA? What matters most in a role like this is your ability to read the environment, anticipate risk, and act accordingly. Tell us about how your keen sense of observation is one of your greatest strengths. As a Security Officer – Tactical, physic…",
    "location": "Old Orchard, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T02:22:01",
    "url": "https://www.adzuna.com/details/5138410063?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£47,368"
  },
  {
    "title": "Class A CDL Truck Driver LEASE PURCHASE - Earn up to $200K yearly",
    "company": "Western Express",
    "description": "HAVE YOUR CDL-A? SPEAK WITH A SEATING SPECIALIST TODAY Have you ever dreamed of owning your truck and being your own boss? Come experience the many reasons why Western Express is the best place to live out those dreams This program was built for you to succeed, become an owner operator, and own your future. Western Express is now offering a wide variety of new and used trucks, so you can find the one that is right to call your own. With no money down, no credit check and no balloon payment , th…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T13:59:00",
    "url": "https://www.adzuna.com/land/ad/5137433577?se=DFHCa1MW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=D7C9AA3DF917DAC0B835277E2EE5C49F3E7ACC95",
    "skills": [
      "Express"
    ],
    "salary_range": "£135,770"
  },
  {
    "title": "Refractory Installer/ Equipment Operator",
    "company": "Insight Global",
    "description": "Job Description Day to Day: Our customer who is a leading provider of refractories and industrial installation services, is seeking a Refractory Installer & Equipment Operator. The Refractory Installers' workday typically includes tear-out and replacement of high-temperature concrete furnace linings in industrial manufacturing facilities. Demolition is completed by state-of-the-art, mechanized tear-out equipment comparable to BROKK or excavators. The refractory skills required include masonry, …",
    "location": "Northampton, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T11:16:22",
    "url": "https://www.adzuna.com/details/5138841929?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£45,096"
  },
  {
    "title": "SIMPLE IRA Specialist (FINRA Licensed required)",
    "company": "ADP",
    "description": "Related Searches: Customer Service, Data Entry, Consulting, Resume, Interview, Job Description, Position, Jobs, Work Unlock Your Career Potential: Customer Service at ADP. It's all about enabling our customers to be more effective employers. Our Customer Service team makes it happen by collaborating with customers and other ADP colleagues to ensure our products and services deliver winning results. Did you know that the vast majority of our customers are not only satisfied, they'd recommend ADP…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T10:51:09",
    "url": "https://www.adzuna.com/details/5138821775?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£60,377"
  },
  {
    "title": "Travel Physical Therapist - $1,903 per week",
    "company": "Skyline Med Staff Allied",
    "description": "Skyline Med Staff Allied is seeking a travel Physical Therapist for a travel job in Easton, Pennsylvania. Job Description & Requirements Specialty: Physical Therapist Discipline: Therapy Start Date: 04/14/2025 Duration: 13 weeks 40 hours per week Shift: 8 hours, days Employment Type: Travel As a traveler with Skyline Med Staff, you'll have a dedicated recruiter supporting you every step of the way and available whenever you need them. We are a Woman Owned Agency providing clinicians with Health…",
    "location": "Palmer, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:07:29",
    "url": "https://www.adzuna.com/land/ad/5136710235?se=DFHCa1MW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=ABF149B8BFFC74481334377AB68A099934D51793",
    "skills": [
      "AI"
    ],
    "salary_range": "Up to £98,956"
  },
  {
    "title": "Behavior Specialist",
    "company": "Lehigh Valley Companion Care Homes",
    "description": "Job Description Job Description · Develop, implement, and monitor Behavior Support Plans (BSPs) for individuals based on person-centered planning and team input. · Conduct Functional Behavioral Assessments (FBAs) to assess behaviors and guide the development of treatment strategies. · Train staff and family members on the implementation of behavior support plans and interventions. · Provide support in various settings, including residential homes, community environments, day programs, and other…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T14:15:36",
    "url": "https://www.adzuna.com/details/5137467204?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£69,523"
  },
  {
    "title": "MyChart Customer Support Analyst",
    "company": "e4health",
    "description": "ABOUT US At e4health, we Empower Better Health . The e4health Team is on a relentless mission to care for those teams who care for others. We bring our passion, ingenuity, and expertise to every engagement. In joining our Team, we want your help to provide our customers with powerful solutions in the pursuit of quality, integrity, clinical and financial value across healthcare. Our People make the difference. Serving more than 400 hospitals and health systems nationwide for nearly two decades, …",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T00:08:42",
    "url": "https://www.adzuna.com/details/5136645480?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£45,585"
  },
  {
    "title": "Gopuff Delivery Driver",
    "company": "Gopuff",
    "description": "Do more than make ends meet. Deliver with Gopuff and get paid to deliver what your neighbors need from a Gopuff facility near you With one centralized pickup location and smaller delivery zones, Gopuff makes earning effortless. It's simple: deliver from a facility near you straight to the customer You’ll be delivering everyday essentials, from cleaning supplies, home needs and OTC medications to food, drinks and more. Sign up to be a Gopuff Delivery Partner today and experience the easiest way …",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T17:14:05",
    "url": "https://www.adzuna.com/land/ad/5139659154?se=DFHCa1MW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=1CB7CA83BB9E72A0721BEC4A5313E98FD19EBC76",
    "skills": [
      "AI",
      "Go"
    ],
    "salary_range": "£65,155"
  },
  {
    "title": "Hiring Now",
    "company": "50018 - Heidelberg Materials US Cement LLC",
    "description": "Line of Business: Cement & White Position title: Mobile Mechanic - 1st Class Job location: Nazareth, PA About Us: Heidelberg Materials is one of the world's largest suppliers of building materials. Heidelberg Materials North America operates over 450 locations across the U.S. and Canada with approximately 9,000 employees. What You'll Be Doing: Perform maintenance and repairs on a variety of mobile equipment. Diagnose mechanical issues and implement effective solutions. Conduct regular inspectio…",
    "location": "Macungie, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T02:00:43",
    "url": "https://www.adzuna.com/details/5138354068?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£75,987"
  },
  {
    "title": "Truck Driver",
    "company": "U.S. Army",
    "description": "No Experience Necessary ABOUT THIS JOB THIS POSITION REQUIRES AN ENLISTMENT IN THE U.S. ARMY OR ARMY RESERVE As a Motor Transport Operator, you'll play an important part of the Army's transportation logistics team. You'll supervise and operate wheeled vehicles over all types of terrain to safely transport cargo, troops, and provide advanced mobility on all missions. You'll manage loading, unloading, and report any vehicle problems or damage. Skills you'll learn align with Vehicle Operations, Lo…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:33:38",
    "url": "https://www.adzuna.com/land/ad/5136788734?se=DFHCa1MW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=8A8477FD64B9620422D62B869657FE6AFC9238F0",
    "skills": [
      "AI",
      "Go"
    ],
    "salary_range": "£57,886"
  },
  {
    "title": "Travel Rad Tech - $2,640 per week in Bethlehem, PA",
    "company": "AlliedTravelCareers",
    "description": "AlliedTravelCareers is working with Trustaff to find a qualified Rad Tech in Bethlehem, Pennsylvania, 18015 Pay Information $2,640 per week About The Position About this job As a Radiology Tech, you'll complete diagnostic procedures by working directly with the patient to capture images requested by the attending physician. Radiologists/Rad Techs and CT Techs must have expert knowledge of the imaging equipment, its operation, and the imaging processes. Duties & Responsibilities Travelers work f…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T03:07:16",
    "url": "https://www.adzuna.com/land/ad/5138468444?se=DFHCa1MW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=807B7E0D83294949460864E153EFD4C431D56C2B",
    "skills": [],
    "salary_range": "£10,560"
  },
  {
    "title": "Mobile Technician",
    "company": "ABM Industries",
    "description": "The Mobile Technician is responsible for performing a variety of maintenance tasks to ensure that the building, equipment, and systems are properly maintained and operating efficiently. This role includes surveying, troubleshooting, basic repairs, and preventive maintenance on mechanical, electrical, HVAC, plumbing, refrigeration, and other systems within the facility. The Mobile Technician will work closely with account manager and project manager to ensure projects and surveys are completed i…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T23:12:43",
    "url": "https://www.adzuna.com/land/ad/5138129935?se=DFHCa1MW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=9A7A677B1AA788F340ABB0FFAFFB7466E013375F",
    "skills": [
      "AI"
    ],
    "salary_range": "£41,055"
  },
  {
    "title": "Dorney Park is hiring: Live Entertainment Audio Technician, Seasonal in Wescosvi",
    "company": "Dorney Park",
    "description": "Overview: Help create this year’s shows, attractions, and events. Do you have previous experience and are looking to continue using your skills in an amusement park setting? Now is your chance to do just that by becoming an AVL techn ician with Dorney Park’s Live Entertainment Department You’ll also Knowledge of ETC ION and/or Digital Sound Boards, QLab , and MAC OS. Capability to read and interpret lighting plots and ques and/or mix live bands. Maintain Entertainment facilities and technical e…",
    "location": "Wescosville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T15:28:07",
    "url": "https://www.adzuna.com/details/5139437757?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI",
      "Git"
    ],
    "salary_range": "£53,855"
  },
  {
    "title": "CDL A Company Driver Local Dry Van $10,000 Sign On Bonus",
    "company": "PAN GLO TRANSPORT LLC",
    "description": "About the Company A Leader in commercial trucking, Pan Glo Transport provides outstanding, safe and professional transportation to our local and regional customers. We Offer:•Great Equipment Uniforms Provided Great pay and Benefits•Family Owned Business About the Job Experienced Fulltime Class A CDL Driver needed in Bethlehem, PA area- Great Pay Home Daily on most trips, few layover trips Compensation: starting at $1,200 a week plus .50 cents a mile $30 a stop and $75 for locals. Qualifications…",
    "location": "Zionsville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T22:58:35",
    "url": "https://www.adzuna.com/details/5138114781?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£62,400 - £104,000"
  },
  {
    "title": "Combat Engineer",
    "company": "U.S. Army",
    "description": "No Experience Necessary ABOUT THIS JOB THIS POSITION REQUIRES AN ENLISTMENT IN THE U.S. ARMY OR ARMY RESERVE As a Combat Engineer, you'll work quickly and skillfully to help Soldiers navigate while on combat missions by constructing bridges, clearing barriers with explosives, and detecting and avoiding mines and other environmental hazards. You'll provide expertise and come up with quick and creative engineering solutions, constructing fighting positions, fixed and floating bridges, and obstacl…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:33:39",
    "url": "https://www.adzuna.com/land/ad/5136788805?se=DFHCa1MW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=83FF319EC93808115A328A318416649CC3402CE1",
    "skills": [],
    "salary_range": "£69,949"
  },
  {
    "title": "Travel Physical Therapist - $1,821 per week",
    "company": "Centra Healthcare Allied",
    "description": "Centra Healthcare Allied is seeking a travel Physical Therapist for a travel job in Easton, Pennsylvania. Job Description & Requirements Specialty: Physical Therapist Discipline: Therapy Start Date: 04/14/2025 Duration: 13 weeks 40 hours per week Shift: 8 hours, days Employment Type: Travel Centra Healthcare Solutions is seeking an experienced Physical Therapist (PT) that is licensed or in the immediate process, and qualifies, of obtaining Physical Therapist (PT) licensure in the state of PA to…",
    "location": "Palmer, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T20:01:56",
    "url": "https://www.adzuna.com/land/ad/5137973813?se=DFHCa1MW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=749E51A7DCD296A707F74D4059E4BAE7A1E282C9",
    "skills": [
      "AI"
    ],
    "salary_range": "Up to £94,692"
  },
  {
    "title": "Military Police",
    "company": "U.S. Army",
    "description": "ABOUT THIS JOB THIS POSITION REQUIRES AN ENLISTMENT IN THE U.S. ARMY OR ARMY RESERVE Like the look of this opportunity Make sure to apply fast, as a high volume of applications is expected Scroll down to read the complete job description. As a Military Police, you'll protect peoples' lives and property on Army installations by enforcing military laws and regulations. You'll also control traffic, prevent crime, and respond to all emergencies. You'll conduct force protection, anti-terrorism, area…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T13:34:33",
    "url": "https://www.adzuna.com/details/5139033575?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AWS"
    ],
    "salary_range": "£47,660"
  },
  {
    "title": "Culinary Specialist",
    "company": "U.S. Army",
    "description": "ABOUT THIS JOB THIS POSITION REQUIRES AN ENLISTMENT IN THE U.S. ARMY OR ARMY RESERVE As a Culinary Specialist, you'll cook meals and work alongside chefs to prepare meals comparable to any major restaurant, so that Soldiers can sit down and enjoy a hot meal in between training or mission deployments. You'll be responsible for preparing and servicing meals both in the field and at home stations, as well as ordering, inspecting food supplies, and keeping the kitchen safe and sanitary. Skills you'…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:33:38",
    "url": "https://www.adzuna.com/land/ad/5136788739?se=DFHCa1MW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=77011B7FB3DE86150374FD7F1534C2DD047D74B7",
    "skills": [
      "AI"
    ],
    "salary_range": "£49,219"
  },
  {
    "title": "Travel Interventional Radiology Technologist - $3,415 per week",
    "company": "ARMStaffing",
    "description": "ARMStaffing is seeking a travel Interventional Radiology Technologist for a travel job in Bethlehem, Pennsylvania. Job Description & Requirements Specialty: Interventional Radiology Technologist Discipline: Allied Health Professional Start Date: 05/05/2025 Duration: 13 weeks 36 hours per week Shift: 12 hours, days Employment Type: Travel Interventional Radiology Technologist - Bethlehem, PA Interventional Radiology Technologist (Level I Trauma) Join a large, reputable health network in Bethlehe…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T14:41:16",
    "url": "https://www.adzuna.com/land/ad/5139208110?se=DFHCa1MW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=09BD97A76CDF8F7F9BDAF75046AC553A1576D530",
    "skills": [],
    "salary_range": "Up to £177,580"
  },
  {
    "title": "Travel Physical Therapist - $1,987 per week",
    "company": "Ardor Health Solutions",
    "description": "Ardor Health Solutions is seeking a travel Physical Therapist for a travel job in Easton, Pennsylvania. Job Description & Requirements Specialty: Physical Therapist Discipline: Therapy Start Date: 04/17/2025 Duration: 13 weeks 40 hours per week Shift: 8 hours, days Employment Type: Travel Location: Easton, PA Setting: SNF UNIT Employment Type: Traveler Ardor Health Solutions is looking for a Physical Therapist to join our travel team in a SNF UNIT setting, in Easton, PA This is a full time trav…",
    "location": "Palmer, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:29:28",
    "url": "https://www.adzuna.com/land/ad/5137917633?se=DFHCa1MW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=8613841F64A7858A67A6DDEC65DF49392FC0BFFA",
    "skills": [],
    "salary_range": "Up to £103,324"
  },
  {
    "title": "Delivery Driver - Earn Extra Cash (Coopersburg) [15h Left]",
    "company": "DoorDash",
    "description": "Why Deliver with DoorDash? DoorDash is the 1 category leader in food delivery, food pickup, and convenience store delivery in the US, trusted by millions of customers every day. As a Dasher, you’ll stay busy with a variety of earnings opportunities and can work when it works for you. Whether you’re looking for a side hustle or a full-time gig, delivering with DoorDash gives you the opportunity to earn extra cash on your terms. - Multiple ways to earn: Whether you’re delivering meals, groceries,…",
    "location": "Coopersburg, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:53:13",
    "url": "https://www.adzuna.com/land/ad/5137951837?se=DFHCa1MW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=8C509474100BF4DB50336D47C7B3D7D3D87ECFF9",
    "skills": [
      "Go"
    ],
    "salary_range": "£51,857"
  },
  {
    "title": "Travel CT Tech - $2,380 to $2,533 per week in Bethlehem, PA",
    "company": "AlliedTravelCareers",
    "description": "AlliedTravelCareers is working with Host Healthcare to find a qualified CT Tech in Bethlehem, Pennsylvania, 18017 Pay Information $2,380 to $2,533 per week About The Position Host Healthcare is an award-winning travel healthcare company with an immediate opening for this CT Technologist position in Bethlehem , PA . Why Choose Host Healthcare? Passionate and transparent team members have made Host Healthcare the agency of choice for new and experienced travelers looking for opportunities far awa…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T15:16:59",
    "url": "https://www.adzuna.com/land/ad/5137533204?se=DFHCa1MW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=3A2F5B96A1DA93D9CE293C5C3C8097FF725D81C3",
    "skills": [],
    "salary_range": "£123,760 - £131,716"
  },
  {
    "title": "Gopuff Delivery Driver",
    "company": "Gopuff",
    "description": "Do more than make ends meet. Deliver with Gopuff and get paid to deliver what your neighbors need from a Gopuff facility near you With one centralized pickup location and smaller delivery zones, Gopuff makes earning effortless. It's simple: deliver from a facility near you straight to the customer You’ll be delivering everyday essentials, from cleaning supplies, home needs and OTC medications to food, drinks and more. Sign up to be a Gopuff Delivery Partner today and experience the easiest way …",
    "location": "Chapmans, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T13:41:55",
    "url": "https://www.adzuna.com/land/ad/5139053105?se=DFHCa1MW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=C62AFEA086F72114E993B393B3A72DA17A949439",
    "skills": [
      "AI",
      "Go"
    ],
    "salary_range": "£64,085"
  },
  {
    "title": "(USA) Operations Manager - Floor",
    "company": "WALMART",
    "description": "Position Summary What you'll do Communicate with or to individuals or groups verbally andor in writing eg customers suppliers associates Drive and implement the business plan for area of responsibility to achieve facility goals eg production quality safety and implement operational improvements Forecast staffing workload and performance results to meet business demands for workload and performance results for area of responsibility Prepare review andor analyze business reports and use informati…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T11:44:37",
    "url": "https://www.adzuna.com/details/5138921895?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "Go"
    ],
    "salary_range": "£81,465"
  },
  {
    "title": "Primary Care - Nurse Practitioner (NP)",
    "company": "AMN Healthcare",
    "description": "Job Description & Requirements Primary Care - Nurse Practitioner (NP) StartDate: ASAP Available Shifts: 8am-5pm Pay Rate: $106200.00 - $141600.00 Do you want to help shape the future of exceptional care? Step into an incredible opportunity at an innovative and nationally acclaimed healthcare powerhouse spanning 95 clinical specialties. One of the nation's most cutting-edge health networks seeks Advanced Practice Providers with primary care experience due to growth and expanding services. A grea…",
    "location": "Wescosville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T13:42:52",
    "url": "https://www.adzuna.com/land/ad/5139053776?se=DFHCa1MW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=1F4D0914EC0DF53559250E31AF7BA32BCD500E60",
    "skills": [
      "AI"
    ],
    "salary_range": "£123,047"
  },
  {
    "title": "Writer/Journalist",
    "company": "The Borgen Project",
    "description": "Are you passionate about making a difference in the world? Look no further The Borgen Project is an international organization that works at the political level to improve living conditions for people impacted by war, famine and poverty. With 20 years of experience in the advocacy space, The Borgen Project has worked to support the passage of numerous bills that have benefitted close to 500 million people in developing countries. Writer/Journalist Internship: The role is focused on content crea…",
    "location": "Bath, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T15:27:52",
    "url": "https://www.adzuna.com/details/5137562722?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£53,486"
  },
  {
    "title": "Sales District Leader",
    "company": "PepsiCo",
    "description": "Overview We are PepsiCo Sales. We are game changers, mountain movers and history makers. We are a diverse group, spread among 200 countries and united by a shared set of values and goals. That's why we Perform with Purpose. Together, we blaze new trails, succeed, celebrate and never settle for second best. At PepsiCo, we're committed to performing well as individuals and in teams, to strengthen the company as a whole. Are you hungry to be a part of the World's largest portfolio of billion dolla…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T09:22:12",
    "url": "https://www.adzuna.com/details/5138709979?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI",
      "Go",
      "Rails"
    ],
    "salary_range": "£100,879"
  },
  {
    "title": "Feeder-Folder",
    "company": "Alsco Inc",
    "description": "Job Description Job Description Classification: Non-Exempt About Us: We are Alsco Uniforms. We’ve been working hard for our customers since 1889 when we invented the uniform and linen rental industry. Alsco Uniforms has grown into a worldwide leader serving over 350,000 customers in 13 countries. It’s our job every day to make every aspect of the customer experience better. Whatever our customers need, Alsco Uniforms finds the answers that work for them. Our employees are the heart and soul of …",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T13:06:59",
    "url": "https://www.adzuna.com/details/5138994922?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£43,105"
  },
  {
    "title": "Civil Engineer 3(Industrial)",
    "company": "CDM Smith",
    "description": "41357BR Requisition ID: 41357BR Business Unit: IND Job Description: Under General supervision, creates basic to moderate complexity engineering designs involving site layout development, site grading and drainage, hydraulics and hydrology calculations, water distribution systems, collection systems, storage tanks and impoundments, foundation designs, stormwater infrastructure and treatment, and occasionally single-story structures. Reviews draft designs for compliance with federal, state and lo…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T11:09:29",
    "url": "https://www.adzuna.com/details/5138836427?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£58,254"
  },
  {
    "title": "Emergency Medicine Physician",
    "company": "AMN Healthcare",
    "description": "Job Description & Requirements Emergency Medicine Physician StartDate: ASAP Available Shifts: 14 nine-hour shifts a month Pay Rate: $330000.00 - $350000.00 Transform lives while advancing your career in Emergency Medicine. One of the largest medical groups in the United States seeks an Emergency Medicine Physician to join a dynamic, growing team. The incoming Emergency Medicine Physician will work at a thriving hospital, tackle diverse cases, and shape the future of patient care. With flexible …",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T17:14:24",
    "url": "https://www.adzuna.com/land/ad/5139663039?se=DFHCa1MW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=F16481B516BA33CD3DE21A9F248BA4A702A93199",
    "skills": [
      "AI"
    ],
    "salary_range": "£120,062"
  },
  {
    "title": "Home Care Aide",
    "company": "Help at Home",
    "description": "Help at Home is hiring TODAY in your community and we are offering a $1,000 sign-on bonus to join our team Start your career with the nation's leading provider of in-home support to seniors and become a hero for someone in your community. Why should you join Help at Home? - Flexible scheduling - Highest wages in the state - typical starting wages around $13 per hour (can vary by location, experience, and/or care plan) - No experience required - Amazing benefits - health care, paid time off, and…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T11:13:47",
    "url": "https://www.adzuna.com/details/5138840064?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£40,192"
  },
  {
    "title": "HOUSEKEEPER (FULL TIME AND PART TIME)",
    "company": "Compass Group, North America",
    "description": "Crothall Healthcare - We are hiring immediately for full time and part time HOUSEKEEPER positions. - Location: Lehigh Valley Health Network - 3780 Hecktown Road, Easton, PA 18045 Note: online applications accepted only. - Schedule: Full time and part time schedules. 3:00 pm - 11:30 pm and 11:00 pm - 7:30, Monday - Friday with rotating weekends. More details upon interview. - Requirement: No experience is necessary. Willing to train - Pay Rate: $16.75 per hour. Make a difference in the lives of …",
    "location": "Palmer, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T11:09:48",
    "url": "https://www.adzuna.com/details/5138836596?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£78,293"
  },
  {
    "title": "Gopuff Delivery Driver Partner - No Riders, No Restaurants",
    "company": "Gopuff",
    "description": "Do more than make ends meet. Deliver with Gopuff and get paid to deliver what your neighbors need from a Gopuff facility near you With one centralized pickup location and smaller delivery zones, Gopuff makes earning effortless. It's simple: deliver from a facility near you straight to the customer You’ll be delivering everyday essentials, from cleaning supplies, home needs and OTC medications to food, drinks and more. Sign up to be a Gopuff Delivery Partner today and experience the easiest way …",
    "location": "Center Valley, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T17:14:04",
    "url": "https://www.adzuna.com/land/ad/5139658983?se=DFHCa1MW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=2AD0E5FE106339F32749F582C967D33792B8944A",
    "skills": [
      "AI",
      "Go"
    ],
    "salary_range": "£57,227"
  },
  {
    "title": "Packaging Technician 2-1st Shift",
    "company": "ThermoFisher Scientific",
    "description": "Work Schedule First Shift (Days) Environmental Conditions Cleanroom: no hair products, jewelry, makeup, nail polish, perfume, exposed piercings, facial hair etc allowed, Cold Room/Freezers -22degreesF/-6degrees C, Some degree of PPE (Personal Protective Equipment) required (safety glasses, gowning, gloves, lab coat, ear plugs etc.) Job Description Packaging Technician 2 As part of the Thermo Fisher Scientific team, you'll discover meaningful work that makes a positive impact on a global scale. …",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T11:39:55",
    "url": "https://www.adzuna.com/details/5138899295?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI",
      "Go"
    ],
    "salary_range": "£53,532"
  },
  {
    "title": "▷ (4/10/2025) Drive with DoorDash (Coopersburg)",
    "company": "DoorDash",
    "description": "Why Deliver with DoorDash? DoorDash is the 1 category leader in food delivery, food pickup, and convenience store delivery in the US, trusted by millions of customers every day. As a Dasher, you’ll stay busy with a variety of earnings opportunities and can work when it works for you. Whether you’re looking for a side hustle or a full-time gig, delivering with DoorDash gives you the opportunity to earn extra cash on your terms. - Multiple ways to earn: Whether you’re delivering meals, groceries,…",
    "location": "Coopersburg, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:53:02",
    "url": "https://www.adzuna.com/land/ad/5137950937?se=DFHCa1MW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=A3E083A55B0D03BA1128D4477F2CF2F98343C0FE",
    "skills": [
      "Go"
    ],
    "salary_range": "£56,996"
  },
  {
    "title": "Hairstylist - Schoenersville",
    "company": "Supercuts Careers",
    "description": "We're so happy you found us We would love for you to join our dynamic family of like-minded, passionate, and talented hairstylists. We are here to provide continual growth and are committed to nurturing your talent and fueling your passion to work behind the chair. We want everyone to have the confidence to shine. We provide ongoing paid training that's the best in the business. Whether just graduating from Beauty School and obtaining your cosmetology license, or looking for a change and more g…",
    "location": "Center Valley, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:27:44",
    "url": "https://www.adzuna.com/land/ad/5137916188?se=DFHCa1MW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=888B49708C916AC0C79138039B4D27552ACDE659",
    "skills": [
      "AI",
      "Go"
    ],
    "salary_range": "£42,649"
  },
  {
    "title": "Consumer Lending Advisor",
    "company": "OneMain Financial",
    "description": "At OneMain, Consumer Loan Sales Specialists empower customers – listening to their needs and providing access to friendly, fast, and affordable financing for life’s expenses. Consumer Loan Sales Specialist will learn the lending and servicing business at OneMain allowing them to grow their career. In the Role Deliver results related to individual and branch sales goals as well as customer expectations Develop new relationships – and maintain existing relationships - working with customers throu…",
    "location": "Whitehall, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T05:09:21",
    "url": "https://www.adzuna.com/details/5136999393?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI",
      "Go"
    ],
    "salary_range": "£42,082"
  },
  {
    "title": "Inventory Coordinator",
    "company": "Ace Hardware Home Services",
    "description": "Compensation Details: Pay Range: $22-25 / hour Job Description: PURPOSE AND SCOPE: The Warehouse Coordinator will be responsible for managing inbound and outbound inventory, and truck inventory. The Warehouse Coordinator will also develop and implement short- and long-term plans in accordance with Ace objectives and strategic plans and is responsible for the warehouse’s success. PRIMARY RESPONSIBILITIES AND ACTIVITIES: Responsible for the overall operation of the inbound and outbound functions …",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T23:41:56",
    "url": "https://www.adzuna.com/details/5138152082?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£45,760 - £52,000"
  },
  {
    "title": "Delivery Driver - Sign Up and Start Earning (Emmaus)",
    "company": "DoorDash",
    "description": "Why Deliver with DoorDash? DoorDash is the 1 category leader in food delivery, food pickup, and convenience store delivery in the US, trusted by millions of customers every day. As a Dasher, you’ll stay busy with a variety of earnings opportunities and can work when it works for you. Whether you’re looking for a side hustle or a full-time gig, delivering with DoorDash gives you the opportunity to earn extra cash on your terms. - Multiple ways to earn: Whether you’re delivering meals, groceries,…",
    "location": "Emmaus, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:55:37",
    "url": "https://www.adzuna.com/land/ad/5137962844?se=DFHCa1MW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=5D4E43B612693D85E8989370BDED3DC97BAC9B2C",
    "skills": [
      "Go"
    ],
    "salary_range": "£70,534"
  },
  {
    "title": "Maintenance Technician (Robotics Maintenance Tech III)",
    "company": "Arvato Bertelsmann",
    "description": "Carbel, part of Arvato, is a full-service 3PL provider serving national and international clients across various industries, with a strong focus on fashion and retail. The Maintenance Robotics Tech III is responsible for performing, independently or with minimal guidance, audits, troubleshooting, repair, and preventive maintenance of automated material handling system components within the Fulfillment Center. The tech represents and follows outlined company guidelines for general work practices…",
    "location": "Palmer, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T10:51:22",
    "url": "https://www.adzuna.com/details/5138822023?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£65,531"
  },
  {
    "title": "LCSW (Virtual)",
    "company": "Headway",
    "description": "Remote Licensed Clinical Social Worker (LCSW) Wage: Between $86-$120 an hour Are you a Licensed Clinical Social Worker looking to launch a private practice, or grow your existing practice? Headway can help you earn more through insurance Headway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run a flourishing …",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T07:22:17",
    "url": "https://www.adzuna.com/land/ad/5138594696?se=DFHCa1MW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=616C061DDE4A55E9B77F7347EAD504A4D41E7C14",
    "skills": [],
    "salary_range": "£86,071"
  },
  {
    "title": "Manager Network & Communications",
    "company": "Lehigh Valley Hospital",
    "description": "Join a team that delivers excellence. Lehigh Valley Health Network (LVHN) is home to nearly 23,000 colleagues who make up our talented, vibrant and diverse workforce. Join our team and experience firsthand what it's like to be part of a health care organization that's nationally recognized, forward thinking and offers plenty of opportunity to do great work. Imagine a career at one of the nation's most advanced health networks. Be part of an exceptional health care experience. Join the inspired,…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T15:35:11",
    "url": "https://www.adzuna.com/details/5139494201?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£86,457"
  },
  {
    "title": "Travel CT Tech - $2,380 to $2,533 per week in Bethlehem, PA",
    "company": "AlliedTravelCareers",
    "description": "AlliedTravelCareers is working with Host Healthcare to find a qualified CT Tech in Bethlehem, Pennsylvania, 18017 Pay Information $2,380 to $2,533 per week About The Position Host Healthcare is an award-winning travel healthcare company with an immediate opening for this CT Technologist position in Bethlehem , PA . Why Choose Host Healthcare? Passionate and transparent team members have made Host Healthcare the agency of choice for new and experienced travelers looking for opportunities far awa…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T02:57:11",
    "url": "https://www.adzuna.com/land/ad/5136903938?se=DFHCa1MW8BG5aZ94MiZXLA&utm_medium=api&utm_source=71cf92b8&v=62E464D9873E8D9223F8123BA81109F6005976E9",
    "skills": [],
    "salary_range": "£10,133"
  }
]