[
  {
    "title": "Licensed Practical Nurse Full Time Days, Evenings Opened",
    "company": "i4 Search Group Healthcare",
    "description": "Job Description Job Description Licensed Practical Nurse (LPN) - POSITION TYPE: Licensed Practical Nurse (LPN) SPECIALTY UNIT: Care Coordinator LOCATION: Bethlehem, PA SHIFT: Full Time 37.5 hours week 7am-3:00pm 3pm-11pm $4.00 Shift Differential and Weekend Bonus Program Benefits for Part Time Offered JOB TYPE: Full-Time Permanent Job Description: We are looking to hire a professional and caring Licensed Practical Nurse/Care Coordinator. You will work closely with interdisciplinary healthcare t…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-12T02:25:45",
    "url": "https://www.adzuna.com/land/ad/5141839258?se=8jCfEyAY8BGUknvr1rWCew&utm_medium=api&utm_source=71cf92b8&v=9D7FCCCA37E4B0F114AFB4A57E232B2E9FE6C254",
    "skills": [],
    "salary_range": "£61,522",
    "match_percentage": null
  },
  {
    "title": "Residential Manager/Group Home Supervisor",
    "company": "East Penn Human Services",
    "description": "Job Description Job Description Job Summary The role of a Residential Manager is to lead and oversee the operation and management of assigned site homes. The Residential Manager supervises direct support staff and directly work with individuals with intellectual disabilities to support them to become independent, empowered, make choices, decisions, and live meaningful dignified life with valued social roles. The Residential Manager is the role-model leader that works closely with the staff and …",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T02:17:57",
    "url": "https://www.adzuna.com/details/5141830827?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£63,635",
    "match_percentage": null
  },
  {
    "title": "Supports Coordinator - Case Manager Social Services - Easton, PA",
    "company": "Care Lync",
    "description": "About Us Care Lync is a Social Services agency focused on providing Support Coordination (Service Coordination/Case Management) services to adults diagnosed with Intellectual, Developmental and Physical Disabilities and Autism Spectrum Disorder throughout Pennsylvania who are enrolled in the Department of Human Services, Medicaid Waiver Program. Our Support Coordinators work with adults to help them to navigate, understand, and secure the services needed in order to live independently in their …",
    "location": "Forks, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-12T21:50:21",
    "url": "https://www.adzuna.com/details/5142811267?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£50,000 - £55,000",
    "match_percentage": null
  },
  {
    "title": "Director of Admissions, Allentown Central Catholic High School",
    "company": "Diocese of Allentown",
    "description": "DIOCESE OF ALLENTOWN Allentown Central Catholic High School, Allentown Position Description Job Title: Director of Admissions FSLA: Exempt Job Status: Full-time Reporting Functions: Reports to the School Principal Job Function: This position has the responsibility for student enrollment and retention, marketing the school to the external community and managing the admission process protocol so as to provide families opportunity to select Allentown Central Catholic High School (ACCHS) as the sch…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T21:50:21",
    "url": "https://www.adzuna.com/details/5142811299?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£95,488",
    "match_percentage": null
  }
]