[
  {
    "title": "Junior Developer",
    "company": "Summit Sky Consulting",
    "description": "Company Overview: At Summit Sky Consulting, we engineer reliable, scalable, and secure software systems for clients across industries. Our remote-first team thrives on technical excellence and collaboration, delivering solutions that stand the test of time. Position Summary: We are hiring an experienced Junior Backend Developer to design and maintain robust backend systems, APIs, and databases. This role is crucial in supporting enterprise-level applications and integrating various services int…",
    "location": "Allentown, Lehigh County",
    "posted_date": "2025-04-17T06:34:38Z",
    "url": "https://www.adzuna.com/details/5149363874?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£68,308 - £68,308",
    "is_remote": false,
    "matched_keywords": [
      "developer"
    ]
  },
  {
    "title": "Software/Firmware Developer- Warehouse Automation",
    "company": "CyberCoders",
    "description": "Software/Firmware Developer- Warehouse Automation Software/Firmware Developer - Warehouse Automation Job Position: Full-Time Software/Firmware Developer - Warehouse Automation Job Overview: Are you an experienced software/firmware developer passionate about creating innovative solutions? We're seeking a driven individual to enhance existing software and develop new applications for supply chain automation clients. Located in the Allentown/Easton, PA area, this role offers the opportunity to mak…",
    "location": "Easton, Northampton County",
    "posted_date": "2025-04-17T01:34:41Z",
    "url": "https://www.adzuna.com/details/5148996282?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£90,000 - £120,000",
    "is_remote": false,
    "matched_keywords": [
      "developer"
    ]
  },
  {
    "title": "Life & Annuity Actuarial Illustrations Project Manager",
    "company": "Guardian Life",
    "description": "Guardian is seeking an Actuarial Illustrations Project Manager to join the Individual Life and Annuity Product Illustrations Team. Working with a team of professionals, you will complete plans to implement new life and annuity products, features, and enhancements in Guardian's innovative, critically important illustration system, the Guardian Proposal System (GPS). You will be responsible for translating life & annuity actuarial product descriptions into detailed and comprehensive illustration …",
    "location": "Bethlehem, Northampton County",
    "posted_date": "2025-04-18T10:54:31Z",
    "url": "https://www.adzuna.com/details/5151717738?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£103,923 - £103,923",
    "is_remote": false,
    "matched_keywords": [
      "project manager"
    ]
  }
]