[
  {
    "title": "Travel X-Ray Tech - $2,008 per week in Bethlehem, PA",
    "company": "CrossMed Healthcare Staffing",
    "description": "Job Details Gross Weekly Pay: $1911.60 - $2008.80 Starts: 2025-04-28 Assignment Length: 13 Weeks Shift: Day shift Hours Per Week: 40 Job Quantity: 1 Type: Travel City: Bethlehem State: PA At CrossMed Healthcare Staffing, we aim to create lasting impressions wherever we go. Embark on your healthcare traveler journey with us and discover the CrossMed advantage. We offer competitive pay packages, comprehensive benefits, an in-house clinical team, and dedicated recruiters committed to your success.…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:32:20",
    "url": "https://www.adzuna.com/land/ad/5136785886?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=38A123A6399C9CF70DA3BDC38D482FBFD8275A1A",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "£96,384"
  },
  {
    "title": "Travel Physical Therapist - $1,714 per week",
    "company": "Planet Healthcare",
    "description": "Planet Healthcare is seeking a travel Physical Therapist for a travel job in Easton, Pennsylvania. Job Description & Requirements Specialty: Physical Therapist Discipline: Therapy Start Date: 04/14/2025 Duration: 12 weeks 35 hours per week Shift: 8 hours, days Employment Type: Travel Planet Healthcare Job ID 68964788. Pay package is based on 8 hour shifts and 35 hours per week (subject to confirmation) with tax-free stipend amount to be determined. About Planet Healthcare Delivering Vital Healt…",
    "location": "Palmer, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T18:40:58",
    "url": "https://www.adzuna.com/land/ad/5137874344?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=561AF9204E175AAD5B5E8DB38ADAA82DC0261DD7",
    "skills": [],
    "salary_range": "Up to £89,128"
  },
  {
    "title": "Warehouse Custodian / Janitor",
    "company": "Uline, Inc.",
    "description": "Warehouse Custodian / Janitor Pay from $21 to $24 per hour per hour with significant growth and earning potential Plus $2 Shift Differential Pennsylvania Branch 700 Uline Way, Allentown, PA 18106 Morning Call’s Top Large Employer of 2025 Care a lot about cleanliness? Obsessed with organization? We are too. Uline’s best-in-class warehouses are bright, spotless and organized - making it the ideal spot for your next Custodian position Hours: Tuesday - Friday, 7 AM to 3:30 PM PLUS Saturday, 8 AM to…",
    "location": "Walnutport, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T17:01:44",
    "url": "https://www.adzuna.com/land/ad/5137762482?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=D3F884A5303A3C21D7F9A4F2A9A83EECD3FC88C8",
    "skills": [],
    "salary_range": "£40,652"
  },
  {
    "title": "Remote Mental Health Therapist",
    "company": "SonderMind",
    "description": "Remote Mental Health Therapist at SonderMind summary: As a Remote Mental Health Therapist at SonderMind, you will provide compassionate therapy to individuals while enjoying the flexibility of setting your own hours. You will have clinical autonomy and access to a supportive community, ensuring high-quality care and the ability to grow your practice. With guaranteed pay and no fees for delivering care, SonderMind empowers therapists to make a meaningful impact in mental health. SonderMind is a …",
    "location": "Chapmans, Northampton County",
    "is_remote": true,
    "posted_date": "2025-04-09T12:53:09",
    "url": "https://www.adzuna.com/land/ad/5137311130?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=E982900922174E2D397062E7AFE1FEEA10E612D3",
    "skills": [],
    "salary_range": "£75,929"
  },
  {
    "title": "Medical Specialist",
    "company": "U.S. Army",
    "description": "ELIGIBLE FOR UP TO A $16K SIGNING BONUS. TALK TO YOUR RECRUITER FOR DETAILS. ABOUT THIS JOB THIS POSITION REQUIRES AN ENLISTMENT IN THE U.S. ARMY OR ARMY RESERVE As a Combat Medic Specialist, you'll administer emergency medical care in the field in both combat and humanitarian situations. Your training will allow you to serve as a first responder and triage illnesses and injuries to save lives, much like a paramedic in the civilian world. You'll also train other Soldiers in lifesaver/first resp…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:33:39",
    "url": "https://www.adzuna.com/land/ad/5136788780?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=FF5C805DD543009A774572F14C33B8558AE192A3",
    "skills": [
      "AI"
    ],
    "salary_range": "£53,727"
  },
  {
    "title": "Laundry Tech, Seasonal",
    "company": "Dorney Park",
    "description": "Overview: Help maintain this year’s shows, attractions, and events. Do you have previous experience laundering and maintaining delicate and ornate fabrics ? Now is your chance to put those skills to use by becoming a Costume Shop Technician with Dorney P ark’s Live Entertainment Department. You’ll also Works with supervisors to maintain quality costumes for assigned shows or events , including maintenance and cleaning of costumes and equipment. Prepares the facility for each day’s activities cl…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T12:42:19",
    "url": "https://www.adzuna.com/land/ad/5137289714?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=0DFE7B371C4F59B9FD36876E5CD5F44814A815C0",
    "skills": [
      "AI"
    ],
    "salary_range": "£39,937"
  },
  {
    "title": "Clinical Dietitian",
    "company": "Sodexo",
    "description": "Clinical Dietitian at Sodexo summary: The Clinical Dietitian at Sodexo works part-time in a Level 1 Trauma center, providing nutritional care for medical and surgical patients. This role includes participation in interdisciplinary meetings, quality improvement projects, and research, while also educating healthcare team members and precepting dietetic interns. Candidates must be Registered Dietitians with strong communication and time management skills, ready to engage in a diverse healthcare e…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T12:56:29",
    "url": "https://www.adzuna.com/land/ad/5137314139?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=B6AA670C4B8D730596888E0A7C33B80B4F865D1D",
    "skills": [],
    "salary_range": "£41,834"
  },
  {
    "title": "Clinical Dietitian",
    "company": "Sodexo",
    "description": "Clinical Dietitian at Sodexo summary: The Clinical Dietitian at Sodexo provides nutritional care and education for both inpatient units and outpatient clients, particularly those in the Executive Health Program. This role emphasizes collaboration with healthcare teams and community outreach while ensuring quality improvement initiatives. Candidates must possess Registered Dietitian credentials and strong communication skills to thrive in this dynamic environment. Role Overview: Join a team of d…",
    "location": "Palmer, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T12:53:11",
    "url": "https://www.adzuna.com/land/ad/5137311362?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=4270165A830F0AB465447E14A536443F3123153F",
    "skills": [],
    "salary_range": "£45,871"
  },
  {
    "title": "Lifeguard, 16",
    "company": "Dorney Park",
    "description": "Overview: $15 / Hour During training, the hourly rate is $14 until successfully passing the lifeguard c ourse . Joining our Dorney Park team means you’ll keep guests safe at our pools in our Wildwater Kingdom Water p ark. You’ll also Ear n a PAID lifeguard license. Monitor and enforce the waterpark rules in our pools, slides, and lazy rivers. Receive continuous in-service training and lifesaving skills. Learn to properly use and store rescue equipment that can utilized in real worl d Respond to…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T12:34:56",
    "url": "https://www.adzuna.com/land/ad/5137279867?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=C8EB4097EB662C868622BCF87206214778256943",
    "skills": [
      "AI"
    ],
    "salary_range": "£37,897"
  },
  {
    "title": "Clinical Medicine Expertise Sought for AI Training",
    "company": "Outlier",
    "description": "Outlier helps the world’s most innovative companies improve their AI models by providing human feedback. Are you an experienced Clinical Medicine Expert who would like to lend your expertise to train AI models?   About the opportunity:   Outlier is looking for talented  Clinical Medicine Experts to help train generative artificial intelligence models  This freelance opportunity is remote and hours are flexible, so you can work whenever is best for you You may contribute your expertise by…  Asse…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T05:52:59",
    "url": "https://www.adzuna.com/land/ad/5137014485?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=11C264E0D6AF59D6BA627D70A3CF34C1A7E6C984",
    "skills": [
      "AI"
    ],
    "salary_range": "£99,463"
  },
  {
    "title": "Travel Rad Tech - $2,369 per week in Bethlehem, PA",
    "company": "Triage Staffing LLC",
    "description": "Travel Radiology: X-Ray Tech Bethlehem Location: Bethlehem Start Date: 5/19/2025 Shift Details: 8H Days (9:30 AM-6:00 PM) 40 hours per week Length: 13 WEEKS 13 weeks Apply for specific facility details.X-Ray Tech",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T02:58:33",
    "url": "https://www.adzuna.com/land/ad/5136904247?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=8405BB6CE2845B6F10CE182DE20909D7D85C86D5",
    "skills": [
      "AI"
    ],
    "salary_range": "£9,476"
  },
  {
    "title": "Local Contract CT Technologist - $70-72 per hour",
    "company": "GHR Healthcare - Allied Health & Therapy",
    "description": "GHR Healthcare - Allied Health & Therapy is seeking a local contract CT Technologist for a local contract job in Allentown, Pennsylvania. Job Description & Requirements Specialty: CT Technologist Discipline: Allied Health Professional Start Date: ASAP Duration: 13 weeks 12 hours per week Shift: 12 hours, days Employment Type: Local Contract Sat/Sun 7a-7p About GHR Healthcare - Allied Health & Therapy For over 30 years, GHR Healthcare has been the bridge between healthcare professionals and the …",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T11:01:24",
    "url": "https://www.adzuna.com/land/ad/5137209285?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=B40FA0944AF5485E1E6CC98A882E82F2D35F2B17",
    "skills": [],
    "salary_range": "£145,600 - £149,760"
  },
  {
    "title": "Travel Physical Therapist - $1,903 per week",
    "company": "Skyline Med Staff Allied",
    "description": "Skyline Med Staff Allied is seeking a travel Physical Therapist for a travel job in Easton, Pennsylvania. Job Description & Requirements Specialty: Physical Therapist Discipline: Therapy Start Date: 04/14/2025 Duration: 13 weeks 40 hours per week Shift: 8 hours, days Employment Type: Travel As a traveler with Skyline Med Staff, you'll have a dedicated recruiter supporting you every step of the way and available whenever you need them. We are a Woman Owned Agency providing clinicians with Health…",
    "location": "Palmer, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:07:29",
    "url": "https://www.adzuna.com/land/ad/5136710235?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=ABF149B8BFFC74481334377AB68A099934D51793",
    "skills": [
      "AI"
    ],
    "salary_range": "Up to £98,956"
  },
  {
    "title": "Remote Mental Health Therapist",
    "company": "SonderMind",
    "description": "Remote Mental Health Therapist at SonderMind summary: As a Remote Mental Health Therapist at SonderMind, you provide compassionate therapy services to individuals seeking support while enjoying flexible working hours and a supportive community. You will have clinical autonomy and access to a platform that streamlines the credentialing process, guaranteeing pay for completed sessions. Join a network of like-minded therapists and contribute to high-quality clinical outcomes through innovative car…",
    "location": "Alburtis, Lehigh County",
    "is_remote": true,
    "posted_date": "2025-04-09T13:26:39",
    "url": "https://www.adzuna.com/land/ad/5137398150?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=C9AA63C383C7E198589968CF18EE0B9F6BEE7093",
    "skills": [],
    "salary_range": "£64,624"
  },
  {
    "title": "Hairstylist - Bethlehem",
    "company": "Supercuts Careers",
    "description": "We're so happy you found us We would love for you to join our dynamic family of like-minded, passionate, and talented hairstylists. We are here to provide continual growth and are committed to nurturing your talent and fueling your passion to work behind the chair. We want everyone to have the confidence to shine. We provide ongoing paid training that's the best in the business. Whether just graduating from Beauty School and obtaining your cosmetology license, or looking for a change and more g…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:27:35",
    "url": "https://www.adzuna.com/land/ad/5137915974?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=FE69F23CCA13AEACE80CA009C967FBA373B2AD47",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "£42,545"
  },
  {
    "title": "OFFICE SUPPORT/Tipstaff",
    "company": "COUNTY OF LEHIGH PENNSYLVANIA",
    "description": "Job Description Job Description Location: Court Administration Wage Type: Hourly Status: Part Time Rate: $17.80 Wage Plus: No Differentials Are Included Description: Assist jury coordinator when jurors report for selection by validating parking, distributing juror buttons and helping reseat jurors to a panel. Escort jurors in an orderly fashion from the jury selection room to the courtroom. Distribute parking validation stickers and communicate with jury coordinator and parking authority when j…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T01:09:15",
    "url": "https://www.adzuna.com/details/5138263890?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£45,912"
  },
  {
    "title": "Per Diem Caregiver",
    "company": "Traveling Nurses, LLC",
    "description": "Job Description Job Description Traveling Nurses LLC is looking for a Caregiver to join our team. The Caregiver is responsible for the physical care and emotional support of our clients who may no longer be able to take care of themselves due to illness, injury, surgery, or disability. The ideal candidate must be able to care for our clients and their property with dignity, patience, compassion, and respect. This person will encourage and remain empathetic to the clients at all times. Responsib…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T01:08:43",
    "url": "https://www.adzuna.com/details/5138261261?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£40,696"
  },
  {
    "title": "Remote Mental Health Therapist",
    "company": "SonderMind",
    "description": "Remote Mental Health Therapist at SonderMind summary: As a Remote Mental Health Therapist at SonderMind, you will provide therapy services to individuals seeking mental health support while enjoying the flexibility of setting your own hours. The position emphasizes clinical autonomy, community support, and professional development, allowing therapists to thrive and make meaningful impacts. With a focus on high-quality care, emotional well-being, and innovative practices, you will be part of a r…",
    "location": "Northampton, Northampton County",
    "is_remote": true,
    "posted_date": "2025-04-09T12:57:18",
    "url": "https://www.adzuna.com/land/ad/5137317440?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=7B5F3F28F232ED3ACDBEEAA0DB0526E59D777EA1",
    "skills": [],
    "salary_range": "£69,304"
  },
  {
    "title": "Caregiver - No Experience Required",
    "company": "Honor",
    "description": "Job Description \\n\\n \\n\\n\\n What is Honor?\\n \\n Honor was created to make life better for our parents, the people who love them, and the caregivers who look after them. Since starting in 2014, we work with more than 50 local agencies and franchises to set high standards of care for older adults across the country.\\n \\n Job Description\\n \\n We call our caregivers Care Professionals (Care Pros) because they are true experts at helping older adults live better lives. They play a key role in our mi…",
    "location": "Coplay, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T08:08:12",
    "url": "https://www.adzuna.com/details/5137097442?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£51,207"
  },
  {
    "title": "In Home Caregiver",
    "company": "Honor",
    "description": "Job Description \\n\\n \\n\\n\\n What is Honor?\\n \\n Honor was created to make life better for our parents, the people who love them, and the caregivers who look after them. Since starting in 2014, we work with more than 50 local agencies and franchises to set high standards of care for older adults across the country.\\n \\n Job Description\\n \\n We call our caregivers Care Professionals (Care Pros) because they are true experts at helping older adults live better lives. They play a key role in our mi…",
    "location": "Stockertown, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T08:09:25",
    "url": "https://www.adzuna.com/details/5137098370?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£49,438"
  },
  {
    "title": "Licensed Psychiatrist (Virtual)",
    "company": "Headway",
    "description": "Remote Licensed Psychiatrist Wage: Between $157-$238 an hour Are you a licensed Psychiatrist looking to launch a private practice, or grow your existing practice? Headway can help you earn more through insurance Headway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run a flourishing private practice. Mental h…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:32:03",
    "url": "https://www.adzuna.com/land/ad/5136783042?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=61CDC33CB92A683B1BCFD17588C2C26B5016108B",
    "skills": [],
    "salary_range": "£174,954"
  },
  {
    "title": "Travel X-Ray Tech in Bethlehem, PA",
    "company": "AlliedTravelCareers",
    "description": "AlliedTravelCareers is working with Advantis Medical Staffing to find a qualified X-Ray Tech in Bethlehem, Pennsylvania, 18015 About The Position Advantis Medical, the 1 rated travel nurse agency, is currently seeking an experienced X-Ray Tech clinician for an exciting new travel job in Bethlehem, PA 18017. This rewarding travel job operates on 5 shifts per week, 8 hours per shift with a contract duration of 13 weeks. With us, you'll enjoy a superior pay and benefits package starting on day 1, …",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T03:04:25",
    "url": "https://www.adzuna.com/land/ad/5136911589?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=818DBC24B95ABCC83CAC46AA80859ADE2F7D3AB2",
    "skills": [],
    "salary_range": "£76,966"
  },
  {
    "title": "Grounds Maintenance Night Shift (12:00am-8:30am), Seasonal",
    "company": "Dorney Park",
    "description": "Overview:$15- $18 / Hour The schedule for this position in the summer is overnight from 12:00am-8:30am. Joining our Dorney Park team means you’ll work to ensure guests can enjoy a clean and well-maintained park. You’ll also Clean the exterior of all park facilities, using sweeping equipment, hoses, and blowers to clean the park grounds Clean and remove debris from parking lots, planters and backstage areas Operate machinery related to maintaining park cleanliness including pressure washers and …",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T05:07:30",
    "url": "https://www.adzuna.com/land/ad/5136993674?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=6E358A9E141FA33F6D3406E9B50D10F709204514",
    "skills": [
      "AI"
    ],
    "salary_range": "£45,656"
  },
  {
    "title": "Staff Nurse OR (Part-Time)",
    "company": "The Center for Specialized Surgery ",
    "description": "JOB TITLE: Registered Nurse-OR ESSENTIAL FUNCTIONS: The delivery of patient care through the framework of the nursing process (assessment, diagnosis and patient outcome) in the preoperative, intraoperative and postoperative phase of the surgical patient. EDUCATION/EXPERIENCE: Graduate of an accredited school of nursing Current Registered Nurse License Current American Heart Assn BLS/ACLS/PALS certifications Minimum 1 year experience in the OR. Ability to circulated and scrub is preferred. KNOWL…",
    "location": "Butztown, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T01:03:30",
    "url": "https://www.adzuna.com/land/ad/5138247177?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=208063ADE4DBD92B9F760424E500A2372A45F198",
    "skills": [],
    "salary_range": "£67,812"
  },
  {
    "title": "Delivery Driver (Coopersburg)",
    "company": "DoorDash",
    "description": "Why Deliver with DoorDash? DoorDash is the 1 category leader in food delivery, food pickup, and convenience store delivery in the US, trusted by millions of customers every day. As a Dasher, you’ll stay busy with a variety of earnings opportunities and can work when it works for you. Whether you’re looking for a side hustle or a full-time gig, delivering with DoorDash gives you the opportunity to earn extra cash on your terms. - Multiple ways to earn: Whether you’re delivering meals, groceries,…",
    "location": "Coopersburg, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:55:58",
    "url": "https://www.adzuna.com/land/ad/5137964439?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=A51F812DD7FB3664CF99C3A5982EB2F53F5F13A4",
    "skills": [
      "Go"
    ],
    "salary_range": "£53,659"
  },
  {
    "title": "Pharmacy Technician (1st or 2nd Shift)",
    "company": "A-Line Staffing Solutions",
    "description": "Job Description Job Description Job Title: Pharmacy Technician Pay: $24.45-25.45 an hr | Bi-weekly Job Type: Onsite in Bethlehem, PA Shift Options: Shift: First Start and End Date: 8am-4:30pm Mon-Friday and every other weekend OR Shift: Second 4pm-12:30am Mon-Fri every other weekend Pharmacy Technician Overview: Triage, interpret and input orders into computerized medication order system while meeting accuracy and productivity standards of the pharmacy. Audits input versus documentation and mak…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T14:17:39",
    "url": "https://www.adzuna.com/details/5137469278?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£42,702"
  },
  {
    "title": "Landscape Associate, Seasonal",
    "company": "Dorney Park",
    "description": "Overview: $15 / Hour Joining our Dorney Park team means you’ll create beautiful environments by providing landscape maintenance to Dorney Park & Wild w ater Kingdom. You’ll also Plant , maintain , and mow grass. Install/remove trees, mulch, foliage plants. Plant and maintain flower beds /hanging baskets , apply water and fertilizer as needed . Work on irrigation utilities and assist in new construction areas. Operate ride-on equipment as well as hand tools. Some of our amazing perks and benefit…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T13:19:07",
    "url": "https://www.adzuna.com/land/ad/5137384565?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=3BF639A62B137ED1E82FF87C86EA12A6094C3DB0",
    "skills": [
      "AI"
    ],
    "salary_range": "£48,289"
  },
  {
    "title": "Salon Hair Stylist (Licensed Hair Stylist)",
    "company": "Hair Cuttery",
    "description": "Salon Hair Stylist (Licensed Hair Stylist) at Hair Cuttery summary: As a licensed Hair Stylist, you will have the opportunity to maximize your earnings while providing excellent hair services in a supportive salon environment. The position offers competitive commission rates, advanced training, and flexible scheduling to help you grow your business and achieve career advancement. Join our salon family to thrive in your styling career and enjoy a range of benefits including paid vacation and com…",
    "location": "Center Valley, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T13:11:24",
    "url": "https://www.adzuna.com/details/5137369401?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£63,071"
  },
  {
    "title": "Pharmacy Technician",
    "company": "A-Line Staffing Solutions",
    "description": "Job Description Job Description A-Line Staffing is seeking a motivated and detail-oriented Pharmacy Technician. This role offers career growth, a supportive work environment, and full-time hours (40 per week). If interested in this Pharmacy Tech position APPLY NOW for IMMEDIATE consideration Brittney Blackman | bblackmanalinestaffing.com | text 5867107970 Pharmacy Technician | Details and Compensation: Location: Bethlehem, PA 18017 – 100% on-site Payrate: $24.45-25.45/hr - based on shift Requir…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T14:16:07",
    "url": "https://www.adzuna.com/details/5137468123?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£53,057"
  },
  {
    "title": "Writer/Journalist",
    "company": "The Borgen Project",
    "description": "Are you passionate about making a difference in the world? Look no further The Borgen Project is an international organization that works at the political level to improve living conditions for people impacted by war, famine and poverty. With 20 years of experience in the advocacy space, The Borgen Project has worked to support the passage of numerous bills that have benefitted close to 500 million people in developing countries. Writer/Journalist Internship: The role is focused on content crea…",
    "location": "Bath, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T15:27:52",
    "url": "https://www.adzuna.com/details/5137562722?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£53,486"
  },
  {
    "title": "Night Shift - CDL A Company Driver Local Dry Van",
    "company": "JOHANNA FOODS INCORPORATED",
    "description": "About the Company Johanna Foods is a state-of-the-art food manufacturer located in Flemington, New Jersey. Privately operated since 1995, Johanna Foods is now one of the country’s largest producers and distributors of fruit juices, drinks and yogurt. Our products include the popular La Yogurt and Sabor Latino yogurt, Tree Ripe juices, Earth Wise juice beverages, Ssips and Sabor Latino drinks and nectars, and Ssips aseptic drink boxes, all using cutting-edge technologies and only the freshest, h…",
    "location": "Schnecksville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T23:06:48",
    "url": "https://www.adzuna.com/details/5138124855?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£52,000 - £104,000"
  },
  {
    "title": "Class A Company Driver, Regional, Dry Van",
    "company": "QUALITY SUPPLIER TRUCKING INC",
    "description": "Job Summary Company Driver (W2, Solo) Dry Van Regional $1,200 - $1,400 total weekly avg. pay $0.54 - $0.60 CPM 2,400 - 2,600 avg. miles per week $1,000 sign on bonus Line Haul No Driver Load/Unload No slip seating Home Time 5 expected days out Get 2 days of home time for every 5 days worked Home every weekend Benefits Medical and 401K with company match Paid holidays Paid vacation Core Responsibilities include, but are not limited to Inspection of vehicle, equipment, and cargo to ensure everyth…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T00:05:56",
    "url": "https://www.adzuna.com/details/5138179333?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "£62,400 - £72,800"
  },
  {
    "title": "Warehouse Custodian / Janitor",
    "company": "Uline, Inc.",
    "description": "Warehouse Custodian / Janitor Pay from $21 to $24 per hour per hour with significant growth and earning potential Plus $2 Shift Differential Pennsylvania Branch 700 Uline Way, Allentown, PA 18106 Morning Call’s Top Large Employer of 2025 Care a lot about cleanliness? Obsessed with organization? We are too. Uline’s best-in-class warehouses are bright, spotless and organized - making it the ideal spot for your next Custodian position Hours: Tuesday - Friday, 7 AM to 3:30 PM PLUS Saturday, 8 AM to…",
    "location": "Breinigsville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T17:01:42",
    "url": "https://www.adzuna.com/land/ad/5137762475?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=5817A03FA7C3D15265039D6BA9D43A3C09BF39DC",
    "skills": [],
    "salary_range": "£39,321"
  },
  {
    "title": "Restaurant Delivery (Bowmanstown) (3 Days Left)",
    "company": "DoorDash",
    "description": "Why Deliver with DoorDash? DoorDash is the 1 category leader in food delivery, food pickup, and convenience store delivery in the US, trusted by millions of customers every day. As a Dasher, you’ll stay busy with a variety of earnings opportunities and can work when it works for you. Whether you’re looking for a side hustle or a full-time gig, delivering with DoorDash gives you the opportunity to earn extra cash on your terms. - Multiple ways to earn: Whether you’re delivering meals, groceries,…",
    "location": "Bowmanstown, Carbon County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:55:11",
    "url": "https://www.adzuna.com/land/ad/5137960829?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=7472AF39D6D337B070796D62C5699937A1C794D1",
    "skills": [
      "Go"
    ],
    "salary_range": "£57,734"
  },
  {
    "title": "Sanitation Worker",
    "company": "FedEx",
    "description": "Pay: $20.00 per hour Shift: Monday Friday, 2:00PM-10:00PM Location: Bethlehem, PA 18015 About FedEx Supply Chain FedEx Supply Chain, a subsidiary of FedEx Corp. (NYSE: FDX), is a leader in the third-party logistics industry offering a diverse service portfolio that enables commerce for businesses. With a proven track record of innovation and operational excellence, FedEx Supply Chain takes a consultative approach to optimize logistics processes, implement innovative technology and drive continu…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:04:57",
    "url": "https://www.adzuna.com/land/ad/5136704091?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=D89E8CDB71E007AF178754F2B7A5E54295091B53",
    "skills": [
      "AI"
    ],
    "salary_range": "£63,959"
  },
  {
    "title": "▷ (Apply Now) Dashers - Sign Up and Start Earning (Zionsville)",
    "company": "DoorDash",
    "description": "Why Deliver with DoorDash? DoorDash is the 1 category leader in food delivery, food pickup, and convenience store delivery in the US, trusted by millions of customers every day. As a Dasher, you’ll stay busy with a variety of earnings opportunities and can work when it works for you. Whether you’re looking for a side hustle or a full-time gig, delivering with DoorDash gives you the opportunity to earn extra cash on your terms. - Multiple ways to earn: Whether you’re delivering meals, groceries,…",
    "location": "Zionsville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:52:39",
    "url": "https://www.adzuna.com/land/ad/5137948786?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=C730ED1999224525E23BC95B36126DCF8D417AB2",
    "skills": [
      "Go"
    ],
    "salary_range": "£76,017"
  },
  {
    "title": "Machine Operator, 2nd Shift",
    "company": "Behr Process",
    "description": "To thrive as a Machine/Filling Operator with Behr, you must be eager to learn. You don’t need any previous experience or knowledge about painting or manufacturing, although it’s a bonus. We’ll teach you everything you need to know, which makes this a perfect starting point to launch your career. You’ll cross-train on multiple lines so you are able to assist with any role on any line that needs help. At the start of each workday, you’ll be assigned to one of the production lines. If working on a…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T01:16:38",
    "url": "https://www.adzuna.com/details/5138286425?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£50,274"
  },
  {
    "title": "Culinary Specialist",
    "company": "U.S. Army",
    "description": "ABOUT THIS JOB THIS POSITION REQUIRES AN ENLISTMENT IN THE U.S. ARMY OR ARMY RESERVE As a Culinary Specialist, you'll cook meals and work alongside chefs to prepare meals comparable to any major restaurant, so that Soldiers can sit down and enjoy a hot meal in between training or mission deployments. You'll be responsible for preparing and servicing meals both in the field and at home stations, as well as ordering, inspecting food supplies, and keeping the kitchen safe and sanitary. Skills you'…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:33:38",
    "url": "https://www.adzuna.com/land/ad/5136788739?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=77011B7FB3DE86150374FD7F1534C2DD047D74B7",
    "skills": [
      "AI"
    ],
    "salary_range": "£49,219"
  },
  {
    "title": "Forklift Operator - Overnights",
    "company": "Uline",
    "description": "Forklift Operator - Overnights Pay from $27 to $34 per hour with significant growth and earning potential Includes $2 Shift Differential Pennsylvania Distribution Center 8449 Congdon Hill Drive, Alburtis, PA 18011 Go-getters wanted Looking to join a top-tier team? Join Uline as an Overnight Forklift Operator for job stability, training and the opportunity to build a long-term career with a growing company. Don’t wait, apply now Full-Time, Night Shift Hours: Sunday - Thursday, 8:30 PM to 5 AM. W…",
    "location": "Alburtis, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T13:15:55",
    "url": "https://www.adzuna.com/land/ad/5137378552?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=58772B8D789C91DB5273B403A05B34514BF7584E",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "£65,095"
  },
  {
    "title": "Behavior Specialist",
    "company": "Lehigh Valley Companion Care Homes",
    "description": "Job Description Job Description · Develop, implement, and monitor Behavior Support Plans (BSPs) for individuals based on person-centered planning and team input. · Conduct Functional Behavioral Assessments (FBAs) to assess behaviors and guide the development of treatment strategies. · Train staff and family members on the implementation of behavior support plans and interventions. · Provide support in various settings, including residential homes, community environments, day programs, and other…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T14:15:36",
    "url": "https://www.adzuna.com/details/5137467204?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£69,523"
  },
  {
    "title": "Retail Sales Associate",
    "company": "Best Buy",
    "description": "As a Retail Sales Associate, you'll be the face of Best Buy for everyone who visits our stores. We'll train you with the skills and knowledge you need to confidently recommend the right tech products and solutions for each customer. By creating a great shopping experience and inspiring people with what's possible, you'll help us enrich lives through technology. What you'll do Welcome and engage with customers in a warm, friendly manner Serve as a brand ambassador by bringing together your passi…",
    "location": "Whitehall, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T09:21:38",
    "url": "https://www.adzuna.com/details/5137159404?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£34,676"
  },
  {
    "title": "Local CDL Class A Driver",
    "company": "United Scrap Metal",
    "description": " Apply below or call 855-978-2565 today  Job Description: We Are Hiring Local CDL Class A Drivers Philadelphia, PA Established in 1978, United Scrap Metal has grown from $200 and a rental truck to one of the largest full-service recyclers in the country. United Scrap Metal offers recycling solutions guided by decades of experience and a firm commitment to doing the right thing. We are passionate about making a positive difference for our customers, consumers, and communities. Overview: The Driv…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T13:47:26",
    "url": "https://www.adzuna.com/details/5137417085?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£51,680"
  },
  {
    "title": "Bookeeper",
    "company": "Cross Key Management",
    "description": "Job Description Job Description Position Overview: We are looking for an experienced Bookkeeper who will be responsible for managing the financial records and transactions of our property management operations. The ideal candidate will have a strong background in accounting, a high level of attention to detail, and the ability to maintain accurate financial records. Key Responsibilities: Maintain accurate and up-to-date financial records for the company's properties. Manage accounts payable and…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T01:07:46",
    "url": "https://www.adzuna.com/details/5138258358?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£46,461"
  },
  {
    "title": "Class A Company Driver, Local, Dry Van",
    "company": "HCSC",
    "description": "Job Summary Company Driver (W2, Solo) Dry Van Local $700 - $900 total weekly avg. pay 300 - 700 avg. miles per week Dedicated Day shift 100% Driver Load/Unload Home Time 5 days on, 2 days off Home at least 3 weekends per month Benefits Medical, Dental, Vision, Life and 401K Paid holidays Paid vacation Core Responsibilities include, but are not limited to Maintaining a clean, sanitary, and safe work area. Inspection of vehicle, equipment, and cargo to ensure everything is safe, legal, and secure…",
    "location": "Bath, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T00:05:13",
    "url": "https://www.adzuna.com/details/5138177469?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "£36,400 - £46,800"
  },
  {
    "title": "Warehouse Custodian / Janitor",
    "company": "Uline, Inc.",
    "description": "Warehouse Custodian / Janitor Pay from $21 to $24 per hour per hour with significant growth and earning potential Plus $2 Shift Differential Pennsylvania Branch 700 Uline Way, Allentown, PA 18106 Morning Call’s Top Large Employer of 2025 Care a lot about cleanliness? Obsessed with organization? We are too. Uline’s best-in-class warehouses are bright, spotless and organized - making it the ideal spot for your next Custodian position Hours: Tuesday - Friday, 7 AM to 3:30 PM PLUS Saturday, 8 AM to…",
    "location": "Schnecksville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T11:14:24",
    "url": "https://www.adzuna.com/land/ad/5137222210?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=661AADD9714A12B10A896052C363680AE17ED8A8",
    "skills": [],
    "salary_range": "£40,253"
  },
  {
    "title": "Remote Mental Health Therapist",
    "company": "SonderMind",
    "description": "Remote Mental Health Therapist at SonderMind summary: SonderMind is seeking skilled licensed mental health therapists to join their innovative platform, which emphasizes flexibility, clinical autonomy, and best-in-class care for individuals seeking therapy. Therapists will benefit from a supportive community, guaranteed bi-weekly pay, and streamlined credentialing with major insurers. This role provides the opportunity to make a meaningful impact on clients' lives while enjoying professional de…",
    "location": "Weissport, Carbon County",
    "is_remote": true,
    "posted_date": "2025-04-09T12:42:32",
    "url": "https://www.adzuna.com/land/ad/5137291382?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=C325113BE39C07E0B36CD8914A7ABF1D973F06E1",
    "skills": [],
    "salary_range": "£65,759"
  },
  {
    "title": "Remote Mental Health Therapist",
    "company": "SonderMind",
    "description": "Remote Mental Health Therapist at SonderMind summary: As a Remote Mental Health Therapist at SonderMind, you'll provide compassionate therapy services to individuals seeking mental health support while enjoying flexibility in your schedule. The role empowers you to use your clinical expertise with autonomy while ensuring guaranteed pay and access to a supportive community of therapists. You'll enhance your professional development through ongoing training and resources aimed at improving clinic…",
    "location": "Hellertown, Northampton County",
    "is_remote": true,
    "posted_date": "2025-04-09T13:19:24",
    "url": "https://www.adzuna.com/land/ad/5137385289?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=EBFBB5F32A058936FB4342915467A68711D0E078",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "£59,299"
  },
  {
    "title": "Travel CT Technologist",
    "company": "PRN Healthcare",
    "description": "Job Description PRN Healthcare is seeking a travel CT Technologist for a travel job in Allentown, Pennsylvania. Job Description & Requirements - Specialty: CT Technologist - Discipline: Allied Health Professional - Start Date: 05/05/2025 - Duration: 13 weeks - 36 hours per week - Shift: 12 hours, days - Employment Type: Travel PRN Healthcare Job ID 1378440. Pay package is based on 12 hour shifts and 36 hours per week (subject to confirmation) with tax-free stipend amount to be determined. Poste…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T04:45:18",
    "url": "https://www.adzuna.com/land/ad/5136979894?se=ll0seswV8BGuhVj9SHcHCQ&utm_medium=api&utm_source=71cf92b8&v=554A8626EE35F646B7E7793A9CF3FFCA1EA9AE4A",
    "skills": [],
    "salary_range": "£89,474"
  },
  {
    "title": "Travel Nurse RN - Med Surg / Telemetry - Paying up to $3,226/week",
    "company": "Vivian Health",
    "description": "Vivian is looking for Travel Med Surg / Telemetry RNs in Allentown, Pennsylvania paying up to $3,226/week At Vivian, we ensure your next step is a step forward. That's why we built a jobs marketplace that serves healthcare professionals first. It's easy to get started: Create a profile - Build your reputation with a universal profile that works across hundreds of different healthcare employers. Explore your options - Select your preferences (shift details, salary, location, etc.) and discover j…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T13:31:18",
    "url": "https://www.adzuna.com/details/5137404217?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "Up to £167,752"
  },
  {
    "title": "Lifeguard- Urgently Hiring",
    "company": "Dorney Park",
    "description": "Overview: $15 / Hour During training, hourly rate is $14 until completion of lifeguard certification. Joining our Dorney Park team means you’ll keep guests safe at our pools in our Wildwater Kingdom Waterpark. You’ll also Earn a PAID lifeguard license. Monitor and enforce the waterpark rules in our pools, slides, and lazy rivers. Receive continuous in-service training and lifesaving skills. Learn to properly use and store rescue equipment that can be utilized in real world Respond to medical an…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T05:07:55",
    "url": "https://www.adzuna.com/details/5136995097?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£48,623"
  }
]