[
  {
    "title": "Unqualified Flexible Nursery Practitioner",
    "company": "Partou",
    "description": "Come and join Partou for the next step in your nursery career We are looking for fantastic individuals to join us as a nursery practitioners on a Flexible working basis We are committed to your growth and career progression. What We're Looking For: Experience of working in a team, and working with children; with a passion to work in the industry Some of the benefits of working as part of the Partou Family: Genuine opportunities for career progression Access to professional training Pension sche…",
    "location": "Idle, Bradford",
    "is_remote": false,
    "posted_date": "2025-04-09T14:32:56",
    "url": "https://www.adzuna.co.uk/jobs/details/5137167646?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£25,500"
  },
  {
    "title": "Early Years Assistant (UQ)",
    "company": "Partou",
    "description": "Unqualified Nursery Assistant at Partou Bluebells Day Nursery & Pre-school; a fantastic opportunity, 20 hours per week (All Year Round) and a competitive salary of up to £12.26 per hour. We're on the hunt for a dynamic Nursery Assistant. You'll play a key role in supporting our nursery team, this position is perfect for someone who enjoys the bustling energy of a nursery setting and thrives in a supportive role. We're looking for someone who: Has a genuine passion for working with children. Has…",
    "location": "Preston, Lancashire",
    "is_remote": false,
    "posted_date": "2025-04-09T14:32:56",
    "url": "https://www.adzuna.co.uk/jobs/details/5137167656?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£20,153"
  },
  {
    "title": "Telesales Executive",
    "company": "DPD Group UK",
    "description": "Job Description Our Telesales Manager is currently recruiting for a first class to join their highly experienced Telesales team based at our Head Office in Smethwick. As a Telesales Executive your primary accountability will be to maximise sales opportunities by generating high quality prospect appointments for our Field Sales Executives (FSE’s) Key responsibilities of this role will include: Generate appointments for the FSE’s by: Identifying new business opportunities Gathering comprehensive …",
    "location": "Smethwick, West Midlands",
    "is_remote": false,
    "posted_date": "2025-04-09T01:55:15",
    "url": "https://www.adzuna.co.uk/jobs/details/5136377840?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£31,409"
  },
  {
    "title": "Payroll Administrator",
    "company": "Aqumen Business Solutions",
    "description": "VACANCY: PAYROLL ADMINISTRATOR LOCATION: MIRFIELD HOURS: MONDAY - THURSDAY 08:00 - 16:30, FRIDAY 08:00 - 15:15 SALARY: UP TO £26000 (PRO RATA) Temporary Cover Position Are you an experienced Payroll Administrator or an Administrator with Finance experience, immediately available and looking for a new challenge? Our client, based in West Yorkshire, is seeking a confident individual to join their small, friendly team on a short term basis to cover a staff absence Why This Role Stands Out: Collabo…",
    "location": "Colnebridge, Huddersfield",
    "is_remote": false,
    "posted_date": "2025-04-09T12:49:07",
    "url": "https://www.adzuna.co.uk/jobs/details/5137087261?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£26,000"
  },
  {
    "title": "Compex Electrician",
    "company": "EC&I Partners Limited",
    "description": "Compex Electrician Location: Staffordshire based workshop and client sites across the UK. Salary: starting from £43,680 - £45,760  15% site uplift  overtime Hours: Monday to Friday, 8:00am to 4:30pm (40 hours per week with potential to work up to 50 hours per week with overtime) Permanent Start Date: ASAP Job Overview: Join our clients as a Compex Electrician to assist with building electrical skids and kiosks. You will support with a variety of electrical tasks including project installation w…",
    "location": "Cold Meece, Stone",
    "is_remote": false,
    "posted_date": "2025-04-09T12:49:17",
    "url": "https://www.adzuna.co.uk/jobs/details/5137087366?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£43,680 - £45,760"
  },
  {
    "title": "Flexible Qualified Early Years Practioner",
    "company": "Partou",
    "description": "Come and join Partou for the next step in your nursery career We are looking for fantastic qualified level 2 and level 3 nursery practitioners to join our family on a flexible working basis Joining our team at Partou is more than just a job. You become an integral part of a family that deeply cares, not only about the little ones in our care but also about every member of our team. We are committed to your growth and career progression, offering unwavering support and opportunities. If you're a…",
    "location": "Harrogate, North Yorkshire",
    "is_remote": false,
    "posted_date": "2025-04-09T14:32:56",
    "url": "https://www.adzuna.co.uk/jobs/details/5137167651?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£26,998"
  },
  {
    "title": "Toolmaker",
    "company": "CV Technical Ltd",
    "description": "Toolmaker Sheffield Days We are looking for a motivated Toolmaker to join a market leading manufacturer. Reporting directly to the Tooling Supervisor you will be a key member in ensuring the production facility is kept running. You will be involved in all aspects of planned and reactive maintenance within their operation. With progressive training and development this company is always looking to enhance its employees and their skill sets, whilst additionally being supported by a welcoming team…",
    "location": "UK",
    "is_remote": false,
    "posted_date": "2025-04-10T00:51:47",
    "url": "https://www.adzuna.co.uk/jobs/details/5137947668?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI",
      "React"
    ],
    "salary_range": "£32,000 - £40,000"
  },
  {
    "title": "Analyst, Finance & Risk",
    "company": "Crone Corkill",
    "description": "Finance & Risk Analyst Is this the role for you? If you are a Part-Qualified Accountant (ACA/ACCA/CIMA or equivalent) looking for a new challenge, then this could be a great opportunity for you. We are looking for somebody who is keen to progress within a highly-regarded investment bank who value their people and pride themselves on low staff turnover in the finance team. The offices are based in the heart of the City close to Moorgate station in a highly attractive, modern working environment.…",
    "location": "London, UK",
    "is_remote": false,
    "posted_date": "2025-04-09T18:59:37",
    "url": "https://www.adzuna.co.uk/jobs/details/5137434862?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£40,000 - £45,000"
  },
  {
    "title": "Catering Manager",
    "company": "BaxterStorey UK",
    "description": "Job Description Overseeing operations, supervising staff, ensuring excellent customer service and being a brand ambassador for the department. To manage all aspects of running the retail areas including barista bars, restaurant and market. Set and monitor standards ensuring all KPIs are met and constantly strive to exceed them. Motivate and inspire the team to reach their full potential acting as role model. Take responsibility for the smooth and efficient running of their department, by managi…",
    "location": "London, UK",
    "is_remote": false,
    "posted_date": "2025-04-09T01:55:11",
    "url": "https://www.adzuna.co.uk/jobs/details/5136377566?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£36,516"
  },
  {
    "title": "Class 1 Driver",
    "company": "Deluxe Recruitment",
    "description": "Deluxe Recruitment are actively recruiting for Class 2 drivers throughout the Northwest to work on behalf of various clients doing multi drop work. R ate of pay - £14.50ph - £21.00ph. Various start times and shift patterns available. Days, & Trampers required. Requirements: Maximum of 6 points on license (No DR, DD, IN, or TT offences) Minimum of 12 months of Class 2 driving experience required 90 days worth of driving within the last 1 year Knowledge of driver compliance Reliability & professi…",
    "location": "Farington, Leyland",
    "is_remote": false,
    "posted_date": "2025-04-10T00:51:48",
    "url": "https://www.adzuna.co.uk/jobs/details/5137947677?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£30,160 - £43,680"
  },
  {
    "title": "SEND TA",
    "company": "Tradewind Recruitment",
    "description": "SEND Teaching Assistant - Secondary School - Tameside Start Date: 22nd April 2025 Location: Tameside, Greater Manchester Salary: £85 - £95 per day (dependent on experience and qualifications) Contract Type: Full-time, long-term role Agency: Tradewind Recruitment Tradewind Recruitment is delighted to be working with a welcoming and inclusive secondary school in Tameside , who are seeking a dedicated and experienced SEND Teaching Assistant to join their support team from Tuesday 22nd April 2025 .…",
    "location": "UK",
    "is_remote": false,
    "posted_date": "2025-04-09T00:41:56",
    "url": "https://www.adzuna.co.uk/jobs/details/5136247945?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£26,000 - £28,600"
  },
  {
    "title": "Business Development Manager",
    "company": "Rise Technical Recruitment",
    "description": "Business Development Manager Competitive Salary  Commission  Training  Company Car  Office Based  International Travel  Early Friday Finish Office based, commutable from Bodmin, Liskeard, St Austell, Saltash, Callington, Launceston and surrounding areas. Are you a Business Development Manager from an Engineering / Industrial background, looking to join a pioneering blue-chip manufacturer that will offer further technical training, the opportunity to travel internationally to customer sites and …",
    "location": "UK",
    "is_remote": false,
    "posted_date": "2025-04-09T20:10:46",
    "url": "https://www.adzuna.co.uk/jobs/details/5137524544?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£45,562"
  },
  {
    "title": "Senior Security Engineer, Detection & Response - (Remote - UK)",
    "company": "Jobgether",
    "description": "About Jobgether Jobgether is a Talent Matching Platform that partners with companies worldwide to efficiently connect top talent with the right opportunities through AI-driven job matching. One of our companies is currently looking for a Senior Security Engineer, Detection & Response in the UK . As a Senior Detection & Response Security Engineer, you will be responsible for enhancing security operations by designing and implementing advanced detection strategies, automating response workflows, …",
    "location": "UK",
    "is_remote": true,
    "posted_date": "2025-04-09T12:43:50",
    "url": "https://www.adzuna.co.uk/jobs/details/5137084905?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£88,000 - £110,000"
  },
  {
    "title": "Special Needs Teacher",
    "company": "Protocol Education",
    "description": "Job Description: We are seeking a passionate and dedicated Special Needs Teacher to join our team. As a Special Needs Teacher, you will play a pivotal role in providing tailored and inclusive education to students with special educational needs, ensuring they receive the support and guidance they need to reach their full potential. Key Responsibilities: Plan and deliver differentiated and engaging lessons that meet the individual learning needs and abilities of students with special educational…",
    "location": "Wandsworth, South West London",
    "is_remote": false,
    "posted_date": "2025-04-09T12:48:41",
    "url": "https://www.adzuna.co.uk/jobs/details/5137086876?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£39,000 - £57,200"
  },
  {
    "title": "Senior Residential Support Worker - Children's Home",
    "company": "Leader Recruitment Group",
    "description": "Job Title : Senior Support Worker - Children's Residential Home Job Type : Full-Time, 39 hours per week, plus sleep ins Salary : £31,200 - £32,400 plus sleep in allowance Location : Sudbury Job Description : Leader Recruitment Group are seeking a dedicated and experienced Senior Support Worker to join our client's committed team. This role involves leading by example in promoting the wellbeing, development, and safety of children in a residential setting. Key Responsibilities : Oversee the dail…",
    "location": "Sudbury, Suffolk",
    "is_remote": false,
    "posted_date": "2025-04-09T00:40:26",
    "url": "https://www.adzuna.co.uk/jobs/details/5136240411?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£31,200 - £32,400"
  },
  {
    "title": "Corporate Partner",
    "company": "Sacco Mann",
    "description": "International, award-winning law firm are looking to recruit a new Corporate Partner into their impressive Manchester offices. A rare and exciting opportunity has arisen for an ambitious Corporate Partner to join the growing team in their Manchester based office within a Legal 500 ranked law firm. The Corporate teams' skill set extends across various different aspects of corporate and finance law which may include: Capital Dealings Market Listings Mergers and Acquisitions Disposals and restruct…",
    "location": "Hulme, Manchester",
    "is_remote": false,
    "posted_date": "2025-04-09T20:51:22",
    "url": "https://www.adzuna.co.uk/jobs/details/5137614217?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£75,000 - £120,000"
  },
  {
    "title": "Directorate Support Officer",
    "company": "Borough of Lewisham",
    "description": "Description Discover yourself in Lewisham where what you do makes a difference to our vibrant and culturally diverse communities We have a rich history of welcoming people from all over the world and are proud to be recognised as the UK’s first Borough of Sanctuary, for our work in championing the rights of refugees and migrants. Are you looking for an exciting opportunity to provide modern, customer-focused, efficient, and effective administrative support to a range of services? Join our dynam…",
    "location": "UK",
    "is_remote": false,
    "posted_date": "2025-04-09T18:13:16",
    "url": "https://www.adzuna.co.uk/jobs/details/5137373550?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£36,345 - £37,437"
  },
  {
    "title": "Assistant Outlet Manager",
    "company": "FAIRMONT",
    "description": "Job Description An exciting opportunity to join our Restaurant Management team has arisen at Fairmont St. Andrews As the Assistant Outlet Manager you will support the Outlet Manager to ensure the venue is both a preferred dining destination and workplace. What you will be doing: To take sole responsibility for the Outlet during the shift, allocating team members their duties and monitoring the smooth running of the outlet To have additional responsibilities within the venue outside of the shift…",
    "location": "St. Andrews, Fife",
    "is_remote": false,
    "posted_date": "2025-04-09T01:55:15",
    "url": "https://www.adzuna.co.uk/jobs/details/5136377790?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£27,366"
  },
  {
    "title": "Senior Care Assistant - Care Home - Bank",
    "company": "Barchester Healthcare",
    "description": "ABOUT THE ROLE As a Bank Senior Care Assistant at a Barchester care home, you'll look after the different needs of our residents to enable us to deliver quality, person-centred care and support. Your role will involve supervising and inspiring a team of dedicated Care Assistants alongside the Deputy General Manager. You can also expect to support the clinical team in a specific area, such as medication, assessments, care plans or care reviews. Like everyone here, as a Senior Care Assistant, you…",
    "location": "Blackpool Airport, Blackpool",
    "is_remote": false,
    "posted_date": "2025-04-09T13:23:35",
    "url": "https://www.adzuna.co.uk/jobs/details/5137110626?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£26,811"
  },
  {
    "title": "Operations Manager",
    "company": "Rullion",
    "description": "Job title: Operations Manager Job Type: Permanent Start date: ASAP Salary Range: Depending on Experience Benefits Package: 25 Days Holiday  Bonus Location: Workington, Cumbria Full Site Based/Hybrid/Remote Working: Full site based Hours of work: Up to 40 Hours per week Qualifications/Experience Required: - Minimum HNC in construction, engineering or applied science - Experience of delivering successful projects within the nuclear sector - Knowledge & experience of working on Civil projects - De…",
    "location": "Workington, Cumbria",
    "is_remote": false,
    "posted_date": "2025-04-09T00:41:20",
    "url": "https://www.adzuna.co.uk/jobs/details/5136244369?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£57,369"
  },
  {
    "title": "Evenings and Weekends with a Purpose – Local Work in Exeter",
    "company": "Home Instead",
    "description": "Job Description Looking for extra income during evenings or weekends? Whether you’ve got another job, family commitments, or just want part-time hours, this role could be the perfect fit. At Home Instead, we offer meaningful work that fits around your life. We’re a local, family-run company supporting older adults in West Exeter to remain independent at home – and we’re looking for reliable people who want to make a difference during those quieter hours of the day. What You’ll Be Doing: Support…",
    "location": "Exeter, Devon",
    "is_remote": false,
    "posted_date": "2025-04-09T01:55:16",
    "url": "https://www.adzuna.co.uk/jobs/details/5136377866?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "£29,931"
  },
  {
    "title": "Agricultural Litigation Solicitor",
    "company": "Sacco Mann",
    "description": "Sacco Mann are recruiting for a Agricultural Litigation Solicitor to join a national and Top 150 law firm at their offices based in Alconbury. This role will suit an experienced Solicitor or Chartered Legal Executive with long term Agricultural Litigation experience who can run their own caseload from start to finish with minimal supervision. The Role You will be joining one of the top agricultural law practices in the country who have a fantastic reputation. Your caseload will consist of farm …",
    "location": "Wennington, Huntingdon",
    "is_remote": false,
    "posted_date": "2025-04-09T20:51:17",
    "url": "https://www.adzuna.co.uk/jobs/details/5137614168?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£50,000 - £70,000"
  },
  {
    "title": "Yr5 Teacher Needed ASAP START",
    "company": "Protocol Education",
    "description": "Are you looking to work as a Teacher in schools around the Harrow area?Do you want a flexible work schedule? ASAP START If so, we are looking for a creative, inspirational, and dedicated Teacher who is passionate about the teaching, learning and pastoral care of a class group and the delivery of the school's curriculum. Primary Teacher Description: Primary School Teacher Daily Supply Or Long Term Work. Full academic year, term time only £140-£234 per day ASAP START Based in Harrow About the Pri…",
    "location": "Harrow, London",
    "is_remote": false,
    "posted_date": "2025-04-09T12:48:58",
    "url": "https://www.adzuna.co.uk/jobs/details/5137087149?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£39,780 - £60,840"
  },
  {
    "title": "Care Assistant",
    "company": "Jupiter Recruitment",
    "description": "A new job opportunity has become available for a dedicated Support Worker to work in an exceptional care home based in the Walton-on-Thames, Surrey area. You will be working for one of UK's leading healthcare providers A boutique luxury home is a purpose-built, modern facility offering residential and nursing care. Also features a therapy and exercise room and a stunning, octagonal glass public cafe To be considered for this position you must hold an NVQ Level 2 in Health & Social Care or equiv…",
    "location": "Walton-On-Thames, Surrey",
    "is_remote": false,
    "posted_date": "2025-04-10T00:52:29",
    "url": "https://www.adzuna.co.uk/jobs/details/5137948478?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "Up to £23,587"
  },
  {
    "title": "Conveyancer",
    "company": "G2 Legal Limited",
    "description": "An exciting vacancy has arisen for a residential property Conveyancer to join the central Leeds office of one of Yorkshire's leading law firms. This role involves managing a busy caseload of sale and purchase matters from file opening to completion. You will have extensive experience of freehold and leasehold transactions and be able to work with minimum supervision. Alongside a competitive salary and a generous and guaranteed annual bonus, the firm also has a fantastic benefits package: Profit…",
    "location": "Holbeck, Leeds",
    "is_remote": false,
    "posted_date": "2025-04-09T12:49:26",
    "url": "https://www.adzuna.co.uk/jobs/details/5137087451?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£40,000 - £55,000"
  },
  {
    "title": "Mobile Grounds Operative",
    "company": "Nexgen Group",
    "description": "We are seeking a Mobile Grounds Maintenance Operative, to work across a portfolio of client sites in Bedford, and surrounding areas. This is a full-time, permanent position, Monday to Friday. The hourly rate is £12.21 A full UK Driving Licence is required, but Company Vehicle is provided. Main Responsibilities - Groundsman / Gardener: Lawn Cutting Landscape Gardening / Landscaping Greenkeeping / Greenkeeper tasks Hedge Pruning Pesticide Spraying What are we looking for? Prior experience in Grou…",
    "location": "Bedford, Bedfordshire",
    "is_remote": false,
    "posted_date": "2025-04-09T13:17:37",
    "url": "https://www.adzuna.co.uk/jobs/details/5137105714?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£26,992"
  },
  {
    "title": "Firewall specialist",
    "company": "83zero Limited",
    "description": "Job Title: Cisco Firewall Specialist (SC Cleared) Location: London (Hybrid - 1-2 days per week onsite) Contract: 6 months Rate: £550 - £600 per day (Inside IR35) About the Role: 83zero is excited to be partnered with a leading financial institution, looking for a Cisco Firewall Specialist to strengthen their security operations during a major upgrade phase. This role will focus on the design, deployment, and support of Cisco security technologies-especially within Cisco ACI and Cisco ASA enviro…",
    "location": "London, UK",
    "is_remote": false,
    "posted_date": "2025-04-10T00:51:21",
    "url": "https://www.adzuna.co.uk/jobs/details/5137947211?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£143,000 - £156,000"
  },
  {
    "title": "Enterprise Account Executive (Corporate)",
    "company": "Practi",
    "description": "Welcome to a great opportunity within the Practi team As an Enterprise Account Executive , you’ll be key in driving revenue growth by identifying, engaging, and closing enterprise-level opportunities. You’ll work directly with C-suite stakeholders at some of the most influential groups in the dental industry, leveraging your expertise to deliver value-driven solutions. You’ll be the first hire in our enterprise team, giving you a unique opportunity to shape the role as you grow into it. This ro…",
    "location": "London, UK",
    "is_remote": false,
    "posted_date": "2025-04-09T20:14:16",
    "url": "https://www.adzuna.co.uk/jobs/details/5137529330?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£75,000 - £90,000"
  },
  {
    "title": "Support Assistant for Visually Impaired Student",
    "company": "Protocol Education",
    "description": "Support Assistant for Visually Impaired Student Ealing Responsibilities: Assist a visually impaired student throughout the school day, including in classrooms, breakfast club, break times, lunch times, study club, and after-school activities. Encourage the student's resilience and independence in learning and social interactions with peers and staff. Work closely with the student's family to address concerns and support the child's overall development. Student Progress and Behaviour Support tea…",
    "location": "Hounslow, London",
    "is_remote": false,
    "posted_date": "2025-04-09T12:48:41",
    "url": "https://www.adzuna.co.uk/jobs/details/5137086894?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£24,960 - £30,160"
  },
  {
    "title": "Design Engineer",
    "company": "Premier Group",
    "description": "ROLE- Design Engineer TERM- Permanent LOCATION - Kidderminster SALARY- £30,000 - £40,000 (Dependant on experience) My client is a specialist manufacturer of bespoke machinery. They are looking for a Senior Mechanical Design Engineer to join their team near Kidderminster on a permanent basis. The Mechanical Design Engineer will ideally have the following attributes: HNC / HND / BTEC / NVQ / Degree qualified in Mechanical Engineering or similar At least 5 years’ experience in a similar Design Eng…",
    "location": "Kidderminster, Worcestershire",
    "is_remote": false,
    "posted_date": "2025-04-09T13:29:23",
    "url": "https://www.adzuna.co.uk/jobs/details/5137120279?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£30,000 - £40,000"
  },
  {
    "title": "Locum Echocardiographer - Private Service - East London - %ufffd34-40 per hour",
    "company": "Hunter AHP Resourcing Ltd",
    "description": "Hunter Gatherer AHP are recruiting for an experienced Echocardiographer to join on a locum basis; the post holder is expected to have a high level of experience and history with the private and NHS units. The post holder will help conduct comprehensive ultrasound examinations and provide accurate reports on this to the Lead Cardiac Sonographer. You will be scanning patients for echocardiograms. To be successful in this role, you will need BSE accreditation as well as the ability to work indepen…",
    "location": "London, UK",
    "is_remote": false,
    "posted_date": "2025-04-09T11:49:44",
    "url": "https://www.adzuna.co.uk/jobs/details/5137037455?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£70,720 - £83,200"
  },
  {
    "title": "Retail Stock Replenishment Assistant - BARNSLEY",
    "company": "C2 Recruitment Ltd",
    "description": "Retail Stock Replenishment Assistant Access to wages from 3 daysImmediate StartHoliday Pay £13.73 per hour inclusive of holiday pay £12.25 per hour  £1.48 £13.Retail Stock Replenishment Assistant Access to wages from 3 daysImmediate StartHoliday Pay £13.73 per hour inclusive of holiday pay £12.25 per hour  £1.48 £13.73 p/h holiday pay Location: BARNSLEY Do you have an interest in Retail Are you looking for a role where you will be involved in high profile projects for some of the UK&x2019;s lea…",
    "location": "UK",
    "is_remote": false,
    "posted_date": "2025-04-10T00:44:45",
    "url": "https://www.adzuna.co.uk/jobs/details/5137931042?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "Up to £28,558"
  },
  {
    "title": "Teaching Assistant",
    "company": "Supply Hive",
    "description": "A warm and welcoming primary school in High Wycombe is looking for a dedicated and enthusiastic Teaching Assistant to join their supportive team. The school prides itself on creating an inclusive and nurturing environment where every child is encouraged to thrive and engage in their learning. In this role, you'll work alongside teachers to provide tailored support for students, both 1:1 and in small groups. This is a fantastic opportunity for someone passionate about education and eager to cont…",
    "location": "High Wycombe, Buckinghamshire",
    "is_remote": false,
    "posted_date": "2025-04-09T13:30:06",
    "url": "https://www.adzuna.co.uk/jobs/details/5137121833?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£23,400"
  },
  {
    "title": "Assistant Store Manager",
    "company": "Sports Direct",
    "description": "Job Description At Sports Direct we need our leaders to live and breathe our company values, Think without limits - Think fast, fearlessly, and take the team with you. Own it and back yourself - Own the basics, own your role, and own the results. Be relevant - Relevant to our people, our partners, and the planet. We want you to bring your skill and passion for retail to constantly evolve how we deliver for our customer; you’ll do this by making a positive impact in the following areas: Team Lea…",
    "location": "Chingford, East London",
    "is_remote": false,
    "posted_date": "2025-04-09T01:55:14",
    "url": "https://www.adzuna.co.uk/jobs/details/5136377751?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£31,608"
  },
  {
    "title": "Subject Leader PSHE",
    "company": "Teaching Personnel Ltd",
    "description": "Subject Leader – PSHE Location: Brooklands, Milton Keynes Contract Type: Full-Time, Permanent Start Date: September 2025 Salary: MPS/UPS  TLR (dependent on experience) Please note: our client does not offer sponsorship. Are you a passionate PSHE educator with a vision for impactful, values-driven learning? We are working in partnership with our client, a successful and high-achieving academy school based in Brooklands, Milton Keynes, to appoint an inspiring and dedicated Subject Leader – PSHE f…",
    "location": "Walton Hall, Milton Keynes",
    "is_remote": false,
    "posted_date": "2025-04-09T12:51:30",
    "url": "https://www.adzuna.co.uk/jobs/details/5137088423?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£35,728"
  },
  {
    "title": "Head Coach",
    "company": "Everlast Gyms",
    "description": "Job Description Responsibility Represent Everlast Gyms as an ambassador for fitness Demonstrate our elevated ways of working always Lead national focuses & incentives like WorkoutWednesday & in-gym challenges / events Advocate for our member on-boarding program, MOVE . Deliver and lead by example in this area. Supporting and training the wider team to improve confidence and delivery Own the REDEFINE product, driving cohort sales and high levels of engagement throughout the programme Recruit, tr…",
    "location": "Gateshead, Tyne & Wear",
    "is_remote": false,
    "posted_date": "2025-04-10T02:02:14",
    "url": "https://www.adzuna.co.uk/jobs/details/5138012318?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£27,942"
  },
  {
    "title": "Residential Conveyancing Assistant",
    "company": "Sacco Mann",
    "description": "Full service, regional law firm looking to recruit an experienced Residential Conveyancing Assistant in their Chester office. Sacco Mann has been instructed on a Residential Conveyancing Assistant role to support Fee Earners on a full spectrum of Residential Property matters. This law firm works hard to ensure their employees are comfortable in their supportive office environment and offer excellent benefits such as private medical insurance as well as a competitive salary for the area. Within …",
    "location": "Handbridge, Chester",
    "is_remote": false,
    "posted_date": "2025-04-09T20:51:22",
    "url": "https://www.adzuna.co.uk/jobs/details/5137614229?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£22,500 - £24,000"
  },
  {
    "title": "Client Service Consultant",
    "company": "FE fundinfo",
    "description": "Join Our Team as a Service Consultant at FE fundinfo in Woking or London Are you ready to make a significant impact in the investment management technology and data industry? This is your chance to be part of a dynamic team that is shaping the future of asset management. At FE fundinfo, you will have the opportunity to work on exciting projects that drive innovation and growth. You will be part of a collaborative environment where your contributions are valued, and you can advance your career t…",
    "location": "Woking, Surrey",
    "is_remote": false,
    "posted_date": "2025-04-09T15:31:42",
    "url": "https://www.adzuna.co.uk/jobs/details/5137192513?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£38,843"
  },
  {
    "title": "Executive Assistant",
    "company": "Historic England",
    "description": "Job Description Summary We are the public body that looks after England’s historic environment. We champion historic places, helping people understand, value and care for them. Historic England has a fantastic opportunity for you to join us as an Executive Assistant to our IMT Director. The preferred location for this role is Swindon but we are open to candidates working in one of our National offices - Newcastle, York, Manchester, Birmingham, Swindon, Bristol, Portsmouth and Cambridge. This is…",
    "location": "Stanley, Chippenham",
    "is_remote": false,
    "posted_date": "2025-04-09T15:53:08",
    "url": "https://www.adzuna.co.uk/jobs/details/5137203163?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "Up to £5"
  },
  {
    "title": "Senior Purchasing Manager - Indirect",
    "company": "Blakeney Point Search & Selection",
    "description": "This is a Global food manufacturing business, who are going through significant investment and growth. We are looking for an experienced Procurement Professional who has experience of purchasing Indirect- PPE, Laundry, Consumables across multi sites PURPOSE OF ROLE You will be tasked to deliver the most optimum solution for the business in terms of cost, risk, sustainability, legislation and innovation KEY ACCOUNTABILITIES Develop and implement category strategies Ownership of sourcing process …",
    "location": "Grimsby, North East Lincolnshire",
    "is_remote": false,
    "posted_date": "2025-04-09T18:58:51",
    "url": "https://www.adzuna.co.uk/jobs/details/5137432930?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "£60,000 - £70,000"
  },
  {
    "title": "Principal Mechanical Engineer",
    "company": "Alexander Associates Limited",
    "description": "Are you a seasoned Mechanical Design Engineer with a passion for the water sector? We are looking for aPrincipal Design Engineer (Mechanical)to join a growing team, taking the lead on key water projects forAMP8. This is a remote role with occasional travel required a few days each month. Responsibilities: Lead and develop a multi-location team of junior engineers Drive the mechanical design of wastewater, clean water, and biosolids treatment projects Oversee design and project management from c…",
    "location": "Birmingham, West Midlands",
    "is_remote": false,
    "posted_date": "2025-04-09T12:49:03",
    "url": "https://www.adzuna.co.uk/jobs/details/5137087240?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£60,000 - £70,000"
  },
  {
    "title": "Veterinary Surgeon - Lancashire",
    "company": "GLG Vets",
    "description": "Job Overview Experience the charm of Norwich while taking on a pivotal leadership role. This fantastic Senior Veterinary Surgeon position is ideal for those looking to progress in a well-equipped and forward-thinking practice in a beautiful historic city. Location Lancashire Working Hours The role is full time; working 40 hours a week over 4 days offering progression alongside a work/life balance. The weekends roster is 1:3 Saturdays or 1:6 Saturday and Sundays. Salary Up to £65,000 per year. B…",
    "location": "Bamber Bridge, Preston",
    "is_remote": false,
    "posted_date": "2025-04-09T13:17:36",
    "url": "https://www.adzuna.co.uk/jobs/details/5137105680?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£44,199"
  },
  {
    "title": "Deputy Home Manager - Children's Residential",
    "company": "Leader Recruitment Group",
    "description": "Job Title : Deputy Manager - Children's Residential Home Job Type : Full-Time, 39 hours per week, plus sleep ins Salary : £32,000 - £34,200 plus sleep in allowance Location : St Albans Job Description : Our client seeks an experienced and visionary Deputy Manager to assist in the running of their children's residential home. This pivotal role involves supporting the Home Manager in all aspects of management, ensuring the highest standards of care, and fostering a nurturing environment for child…",
    "location": "St. Albans, Hertfordshire",
    "is_remote": false,
    "posted_date": "2025-04-09T00:40:26",
    "url": "https://www.adzuna.co.uk/jobs/details/5136240359?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£32,000 - £34,200"
  },
  {
    "title": "Drivers Mates / Porters Required in Bristol - £31,200 per annum",
    "company": "Blue Arrow",
    "description": "Blue Arrow Bristol are recruiting Drivers Mates / Porters to work for one of the UK's market leading retailers to work from their depot in Avonmouth in Bristol. The roles are temp to perm - after 12 weeks you will be offered a permanent contract directly with the client. There will be plenty of career progression opportunities for candidates who might be looking to become HGV drivers or work in the transport office later in the future. Please note that all staff will have to pass a drug and alc…",
    "location": "Bristol, South West England",
    "is_remote": false,
    "posted_date": "2025-04-09T18:57:11",
    "url": "https://www.adzuna.co.uk/jobs/details/5137429563?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "Up to £26,000"
  },
  {
    "title": "Ecological Clerk of Works",
    "company": "Wardell Armstrong",
    "description": "Ecologist (ECoW focused) Greater Manchester Following its recent acquisition by SLR, Wardell Armstrong forms part of a leading global environmental and sustainability consultancy working on projects across the world from over 100 offices. Starting as a UK business in 1994, SLR now operates as a global company with more than 3,500 people, delivering client-focused solutions across Europe, North America, Pacific Asia and Africa. Throughout this time SLR has strived to grow both organically and th…",
    "location": "Bolton, Greater Manchester",
    "is_remote": false,
    "posted_date": "2025-04-09T20:14:14",
    "url": "https://www.adzuna.co.uk/jobs/details/5137529300?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£37,702"
  },
  {
    "title": "Teaching Assistant",
    "company": "GSL Education",
    "description": "Make a Difference as a Teaching Assistant in Andover Job Title: Teaching Assistant (TA) Location: Andover Hourly Rate: £13.68 to £14.88 per hour (Depending on recent experience) Start Date: Immediate Contract Type: Day-to-day/Long-term, Part-time/Full-time GSL Education are excited to offer a fantastic opportunity for a passionate and supportive Teaching Assistant to join a welcoming school in Andover . If you have a genuine desire to work with young children and contribute to their learning an…",
    "location": "Andover, Hampshire",
    "is_remote": false,
    "posted_date": "2025-04-09T12:49:58",
    "url": "https://www.adzuna.co.uk/jobs/details/5137087609?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£28,454 - £30,950"
  },
  {
    "title": "Higher Level Teaching Assistant",
    "company": "Vision for Education Ltd",
    "description": "Higher Level Teaching Assistant - HLTA Sheffield: Full Time £18,525 - £23,400 Per Annum (Salary is depending on experience and/or qualifications) Contract Dates: ASAP (Flexible) The Role and School The role of HLTA (Higher level teaching assistant) would see the successful candidate leading small groups of children between the ages of 3 to 16 years old. The role of a Higher-Level Teaching Assistant is to complement the work of teachers by taking responsibility for the organisation and support o…",
    "location": "Walkley, Sheffield",
    "is_remote": false,
    "posted_date": "2025-04-09T12:51:57",
    "url": "https://www.adzuna.co.uk/jobs/details/5137088895?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£18,525 - £23,400"
  },
  {
    "title": "Accounts Payable Clerk",
    "company": "Rentokil Initial Group",
    "description": "Rentokil Initial Accounts Payable Clerk Join Our Team and Make a Difference We are currently seeking an Accounts Payable Clerk to join our dedicated team at the Dudley office. If you have experience working in an accounts payable environment and enjoy providing excellent customer service this could be the perfect opportunity for you Why Join Rentokil Initial? Competitive Salary Package: Start with a basic salary of £23,992 per annum Benefits: Discount scheme, bonus and career opportunities Work…",
    "location": "Dudley, West Midlands",
    "is_remote": false,
    "posted_date": "2025-04-09T15:31:42",
    "url": "https://www.adzuna.co.uk/jobs/details/5137192501?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£23,992"
  },
  {
    "title": "SEN Graduate Learning Support Assistant",
    "company": "Protocol Education",
    "description": "SEN Graduate Learning Support Assistant Full Time The school : We provide a nurturing and stimulating learning environment where every student can thrive. Located in the vibrant community of Fulham, London, our academy values academic excellence, personal growth, and inclusivity. As a Graduate Learning Assistant, you'll play a pivotal role in supporting students across a range of subjects, including English, Mathematics, Science, and more. Working closely with our experienced teaching staff, yo…",
    "location": "Ealing, West London",
    "is_remote": false,
    "posted_date": "2025-04-09T12:48:44",
    "url": "https://www.adzuna.co.uk/jobs/details/5137086927?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£26,000 - £30,160"
  },
  {
    "title": "Mixing Section Operative / Counterbalance Driver",
    "company": "The Thrive Groupo",
    "description": "We are recruiting a Mixing Section Operative/ Counterbalance Driver for an Immediate start. Location: Swindon Contract Type: Temporary-permanent Pay Rates: £12.21 per hour Hours/Days of work: 08:00-17:00 (Monday-Thurs ) Fri half day Responsibilities: Make sure the machine to be used is clean and ready for use. Follow production planning board for required daily work throughout the day. Weigh/dry powders - follow weekly rota. Correctly weigh out raw materials for formulations. Transport to mixin…",
    "location": "Swindon, Wiltshire",
    "is_remote": false,
    "posted_date": "2025-04-09T19:00:15",
    "url": "https://www.adzuna.co.uk/jobs/details/5137437193?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "Up to £25,396"
  }
]