[
  {
    "title": "Outpatient Licensed Therapist / Mental Health Professional",
    "company": "RHA Health Services, LLC",
    "description": "We are hiring for: Outpatient Licensed Therapist / Mental Health Professional Type: Regular If you are a positive and personable individual looking for a satisfying and fun opportunity to make a real difference in the lives of people with intellectual, developmental disabilities, and people facing mental health, and substance use challenges, join our team at RHA Health Services Salisbury Behavioral Health is seeking a Fee for Service Mental Health Professional Licensed Clinical Therapist, for o…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T09:20:22",
    "url": "https://www.adzuna.com/details/5137157114?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£58,677"
  },
  {
    "title": "Occupational Therapist",
    "company": "The Weston Group",
    "description": "The Weston Group is dedicated to providing evidence-based, person-centered therapeutic services to residents. We are proud to remain a therapist-owned and operated company that believes in a unique and innovative approach to geriatric care. We are looking for a committed and patient-focused PRN Occupational Therapist to join our rehab team . We're seeking an Occupational Therapist to help develop, recover and maintain the daily living and work skills of people with physical, mental, or developm…",
    "location": "Forks, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T23:19:12",
    "url": "https://www.adzuna.com/details/5138135881?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£104,000 - £114,400"
  },
  {
    "title": "Certified Surgical Technician",
    "company": "The Center for Specialized Surgery ",
    "description": "No weekends, overnights, holidays, or on call Busy (3) OR & (1) Procedure Room ASC that specializes in ophthalmology, retina, ENT, ortho, pain management, GYN and podiatry for pediatric and adult patients. REQUIREMENTS : A graduate of an accredited Surgical technologist program. Certification and BLS required. Prefer one year of surgical experience in the Operating Room GENERAL SUMMARY OF DUTIES : Surgical Technologists, also called scrubs and surgical or operating room technicians, assist in s…",
    "location": "Butztown, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T01:03:54",
    "url": "https://www.adzuna.com/land/ad/5138247397?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=419A638E9EAED9A9683299BB6B585CF91AB97C64",
    "skills": [
      "AI"
    ],
    "salary_range": "£74,935"
  },
  {
    "title": "CT 3x12 nights",
    "company": "Windsor Healthcare",
    "description": "Local Rate Differential Shift: Sat/Sun 7p-7a Certifications required: ARRT (CT) and BLS Years of experience required: 1 RTO Required upon submission 13 weeks No on-call Scrub color: Any Stroke Certified Hospital and Level 1 Trauma facility Must be able to work independently when needed First time travelers accepted with 1 yr of experience Special Equiptment used: GE 64 VCT/Lightspeed, GE 128 Revolution, Med Rad Injector and ulrich motion injector",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T07:46:37",
    "url": "https://www.adzuna.com/details/5137086137?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£41,600"
  },
  {
    "title": "Summer Internships",
    "company": "The CKHobbie Group",
    "description": "Are you currently pursuing an Associate’s or Bachelor’s degree and looking to gain real-world experience this summer ? The CK Hobbie Group is offering paid internships across a variety of industries to help you build your skills and launch your career. Internship Opportunities Available In: Advanced Manufacturing Machine Operation Electrical/Electronics Assembly Automation Supply Chain Logistics Warehouse & Storage Procurement Corporate Roles Accounting & Finance Human Resources",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T03:28:46",
    "url": "https://www.adzuna.com/details/5136922248?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£48,676"
  },
  {
    "title": "Counter Sales",
    "company": "Johnstone Supply",
    "description": "Johnstone Supply is seeking to hire for our full-time Counter Sales position in our Easton, PA location . Are you an exceptional sales professional who is ready to have your evenings and weekends free ? Would you like to learn more about the HVAC/R trade in a family-focused environment where employees tend to stay a long time? If so, please read on This position earns a competitive wage of $20-$24/hr , as well as a $1,500 signing bonus You would be eligible for generous full-time benefits , inc…",
    "location": "Old Orchard, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T23:19:12",
    "url": "https://www.adzuna.com/details/5138135884?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£41,600 - £49,920"
  },
  {
    "title": "Remote Mental Health Therapist",
    "company": "SonderMind",
    "description": "Remote Mental Health Therapist at SonderMind summary: SonderMind is seeking licensed mental health therapists to join their innovative platform, providing flexible work schedules and a supportive community. Therapists will have the opportunity to impact clients' lives while maintaining clinical autonomy and receiving guaranteed pay. With a focus on professional development and streamlined credentialing, SonderMind enables therapists to thrive in their practice. SonderMind is a leading mental he…",
    "location": "Kunkletown, Monroe County",
    "is_remote": true,
    "posted_date": "2025-04-09T13:22:47",
    "url": "https://www.adzuna.com/land/ad/5137389460?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=67099B07B504CA75C283D8B6D16BFD935992631A",
    "skills": [
      "AI"
    ],
    "salary_range": "£61,000"
  },
  {
    "title": "Line Cook, 18",
    "company": "Dorney Park",
    "description": "Overview: $16 / Hour Joi ning our Dorney Park team means yo u’ll prepare, portion, and cook food items to quality specifications . You’ll also Cooks, cools, and prepares food items in accordance to Serv Safe specifications Ensure you are prom o t i n g o u r s a f e t y c u l t u r e , t o i n c l u d e u s e a n d maintenance o f P P E Follow correct prepping procedures and utilize prep charts . Earn a PAID food handler certificate. Keeps work area clean, sanitary, and orderly P roperly store …",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T13:26:17",
    "url": "https://www.adzuna.com/land/ad/5137395795?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=74ED2614CA107F75B12D85B67914A2215CEB8733",
    "skills": [
      "AI"
    ],
    "salary_range": "£43,906"
  },
  {
    "title": "Remote Mental Health Therapist",
    "company": "SonderMind",
    "description": "Remote Mental Health Therapist at SonderMind summary: SonderMind is seeking licensed mental health therapists to join its innovative platform, offering flexibility and support in delivering high-quality therapy services. Therapists have the opportunity to impact lives while enjoying autonomy, guaranteed pay, and a network of resources for professional growth. With streamlined credentialing and client matching, SonderMind empowers therapists to thrive in their practice. SonderMind is a leading m…",
    "location": "Slatington, Lehigh County",
    "is_remote": true,
    "posted_date": "2025-04-09T12:42:24",
    "url": "https://www.adzuna.com/land/ad/5137290334?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=49A8A29B65C1B34E6460451C1693918BB909AE76",
    "skills": [],
    "salary_range": "£75,721"
  },
  {
    "title": "Travel Physical Therapist - $1,874 per week",
    "company": "AHS Staffing",
    "description": "AHS Staffing is seeking a travel Physical Therapist for a travel job in Easton, Pennsylvania. Job Description & Requirements Specialty: Physical Therapist Discipline: Therapy Start Date: 04/14/2025 Duration: 12 weeks 40 hours per week Shift: 8 hours, days Employment Type: Travel AHS Job ID 2143971. Posted job title: Physical Therapist SNF About AHS Staffing At AHS Staffing, we are committed to providing a personalized, transparent, and rewarding experience. We go beyond the transactional nature…",
    "location": "Palmer, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T16:05:31",
    "url": "https://www.adzuna.com/land/ad/5137667883?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=DE780E93E9A091E44410F7D05B47D77EA53F2663",
    "skills": [
      "Go"
    ],
    "salary_range": "Up to £97,448"
  },
  {
    "title": "Mental Health Professional / Therapist",
    "company": "RHA Health Services, LLC",
    "description": "We are hiring for: Mental Health Professional / Therapist Type: Regular If you are a positive and personable individual looking for a satisfying and fun opportunity to make a real difference in the lives of people with intellectual, developmental disabilities, and people facing mental health, and substance use challenges, join our team at RHA Health Services The Mental Health Professional (family based) is the lead member of a multidisciplinary team and is responsible for treatment plan develop…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T09:20:24",
    "url": "https://www.adzuna.com/details/5137157146?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£45,017"
  },
  {
    "title": "Remote Mental Health Therapist",
    "company": "SonderMind",
    "description": "Remote Mental Health Therapist at SonderMind summary: SonderMind is a leading mental health care platform that seeks licensed mental health therapists to deliver high-quality clinical care with flexibility and autonomy. The role involves meaningful patient interactions while providing support through an innovative platform that streamlines processes such as credentialing and billing. Join a community of therapists dedicated to professional growth and client well-being in a supportive environmen…",
    "location": "New Tripoli, Lehigh County",
    "is_remote": true,
    "posted_date": "2025-04-09T13:00:28",
    "url": "https://www.adzuna.com/land/ad/5137324266?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=329D16C8EAAF291E3F52EBA41889D842EAD0479F",
    "skills": [],
    "salary_range": "£75,335"
  },
  {
    "title": "Travel Radiologic Technologist",
    "company": "Fusion Medical Staffing",
    "description": "Interested in making a positive impact? You’ve come to the right place. At Fusion Medical Staffing, our goal is to improve the lives of everyone we touch, and we’re always looking for people like you to join our mission. And making a difference isn’t the only perk of traveling with us. Start your medical travel career with Fusion Medical Staffing and gain access to competitive pay packages, comprehensive benefits, corporate discounts and perks, a clinical team to support you along your journey,…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T14:05:47",
    "url": "https://www.adzuna.com/land/ad/5137444481?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=C55FE8FE9BF6A6FF9DB9C0CD2E2196B138EA5174",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "£98,899"
  },
  {
    "title": "Local Contract Nurse RN - Rehabilitation - $58 per hour",
    "company": "Becker Health/MedHQ",
    "description": "Becker Health/MedHQ is seeking a local contract nurse RN Rehabilitation for a local contract nursing job in Bethlehem, Pennsylvania. Job Description & Requirements Specialty: Rehabilitation Discipline: RN Start Date: 05/18/2025 Duration: 13 weeks 36 hours per week Shift: 12 hours, days Employment Type: Local Contract Rehab Hospital- Pediatric Unit Location: Bethlehem, PA 18017 Description: Rehabilitation Hospital Pediatric Unit is a specialized inpatient pediatric rehabilitation leader with pro…",
    "location": "Butztown, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:44:37",
    "url": "https://www.adzuna.com/land/ad/5136808959?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=34956F0F0088602000C8C3071461F86098FA2FC2",
    "skills": [],
    "salary_range": "Up to £120,640"
  },
  {
    "title": "Remote Mental Health Therapist",
    "company": "SonderMind",
    "description": "Remote Mental Health Therapist at SonderMind summary: As a Remote Mental Health Therapist at SonderMind, you will deliver high-quality therapy services to individuals while enjoying the flexibility of setting your own schedule. This role emphasizes clinical autonomy, professional development, and a supportive community, allowing therapists to thrive in their practice. With guaranteed pay, streamlined credentialing, and thoughtful client matching, you will have the resources needed to make a mea…",
    "location": "Northampton, Northampton County",
    "is_remote": true,
    "posted_date": "2025-04-09T12:34:52",
    "url": "https://www.adzuna.com/land/ad/5137279541?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=73B526C8F5ED8B751ACA58C99E5CDADD0D85BF78",
    "skills": [],
    "salary_range": "£76,549"
  },
  {
    "title": "Direct Support Professional",
    "company": "Help at Home",
    "description": "Help at Home is hiring TODAY in your community and we are offering a $1,000 sign-on bonus to join our team Start your career with the nation’s leading provider of in-home support to seniors and become a hero for someone in your community. Do You: Enjoy working with people and thrive when you have one-on-one interaction with others. Treat people as a unique and special person and not merely as a case, patient, project, or burden. Prefer a variety of tasks in a day. Don't want a desk job. Use pos…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T00:56:13",
    "url": "https://www.adzuna.com/land/ad/5138234309?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=0486BD2D5A643E8042442BE0C80B00B7735B828D",
    "skills": [],
    "salary_range": "£30,647"
  },
  {
    "title": "Travel Physical Therapist - $1,821 per week",
    "company": "Centra Healthcare Allied",
    "description": "Centra Healthcare Allied is seeking a travel Physical Therapist for a travel job in Easton, Pennsylvania. Job Description & Requirements Specialty: Physical Therapist Discipline: Therapy Start Date: 04/14/2025 Duration: 13 weeks 40 hours per week Shift: 8 hours, days Employment Type: Travel Centra Healthcare Solutions is seeking an experienced Physical Therapist (PT) that is licensed or in the immediate process, and qualifies, of obtaining Physical Therapist (PT) licensure in the state of PA to…",
    "location": "Palmer, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T20:01:56",
    "url": "https://www.adzuna.com/land/ad/5137973813?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=749E51A7DCD296A707F74D4059E4BAE7A1E282C9",
    "skills": [
      "AI"
    ],
    "salary_range": "Up to £94,692"
  },
  {
    "title": "Travel Nurse RN - Pediatrics - $2,221 to $2,421 per week in Bethlehem, PA",
    "company": "TravelNurseSource",
    "description": "TravelNurseSource is working with ARMStaffing to find a qualified Pediatrics RN in Bethlehem, Pennsylvania, 18017 Pay Information $2,221 to $2,421 per week About The Position Job Description Summary: Pediatric Rehabilitation RN (7A-7P) We are seeking a dedicated and compassionate Registered Nurse (RN) to join our Pediatric Rehabilitation team for the 7pm-7am shift. The ideal candidate will have at least 1-2 years of experience in pediatric nursing, with a preference for those who have experienc…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T02:07:31",
    "url": "https://www.adzuna.com/land/ad/5136837669?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=89187B79B80A388A4CE2E5E807725B7446A2B741",
    "skills": [],
    "salary_range": "£9,684"
  },
  {
    "title": "Travel Physical Therapist - $1,775 per week",
    "company": "Cross Country Allied",
    "description": "Cross Country Allied is seeking a travel Physical Therapist for a travel job in Easton, Pennsylvania. Job Description & Requirements Specialty: Physical Therapist Discipline: Therapy Start Date: 04/14/2025 Duration: 13 weeks 40 hours per week Shift: 8 hours, days Employment Type: Travel Job Description As a skilled nursing facility physical therapist, you'll provide PT services to help patients regain their health and mobility. Working at a skilled nursing facility, you'll assess patients' mobi…",
    "location": "Palmer, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:03:32",
    "url": "https://www.adzuna.com/land/ad/5137894542?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=E3B5FADD22A4F585635B3E2DE39AD9267552FE58",
    "skills": [
      "AI"
    ],
    "salary_range": "Up to £92,300"
  },
  {
    "title": "Companion Aide",
    "company": "Charlie's Angels ",
    "description": "Job Title: Companion Aide Location: [Bethlehem, Pa] Job Type: [Part-Time] Company: [Charleys Angels Healthcare Network] Job Summary: We are seeking a compassionate and dedicated Companion Aide to provide support and companionship to individuals in need of assistance due to age, illness, or disability. The ideal candidate will enhance the quality of life for our clients through social interaction, personal care, and assistance with daily activities. If you have a passion for helping others and a…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T09:28:05",
    "url": "https://www.adzuna.com/details/5137164985?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£31,143"
  },
  {
    "title": "Travel Nurse RN - ED - Emergency Department - $2,403 per week",
    "company": "GHR Healthcare - Travel Division",
    "description": "GHR Healthcare - Travel Division is seeking a travel nurse RN ED - Emergency Department for a travel nursing job in Allentown, Pennsylvania. Job Description & Requirements Specialty: ED - Emergency Department Discipline: RN Start Date: 05/12/2025 Duration: 13 weeks 36 hours per week Shift: 12 hours, nights Employment Type: Travel Requirements: PA or compact license; 2 years ER RN experience; BLS; ACLS; every other weekend / Contact 716-391-0336 to apply About GHR Healthcare - Travel Division Fo…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T00:43:08",
    "url": "https://www.adzuna.com/land/ad/5136688512?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=919AA3BC30B34150C6963E15C15DD5DA5055B008",
    "skills": [],
    "salary_range": "Up to £124,956"
  },
  {
    "title": "Licensed Mental Health Therapist",
    "company": "Headway",
    "description": "Remote Licensed Mental Health Therapist (LMHT) Wage: Between $86-$120 an hour Are you a Licensed Mental Health Therapist looking to launch a private practice, or grow your existing practice? Headway can help you earn more through insurance Headway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run a flourishin…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:32:04",
    "url": "https://www.adzuna.com/land/ad/5136783101?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=74959E0E39D4E7C819623CD3E6D2A728CDD97708",
    "skills": [],
    "salary_range": "£106,210"
  },
  {
    "title": "Travel PCU Stepdown RN",
    "company": "Fusion Medical Staffing",
    "description": "Travel PCU Stepdown RN at Fusion Medical Staffing summary: The Travel PCU Stepdown RN is responsible for providing high-quality care to patients in a Progressive Care Unit. This role involves collaborating with healthcare professionals, administering medications, and monitoring patients' conditions during a 13-week travel assignment. Nurses in this position also benefit from competitive pay, comprehensive healthcare packages, and ongoing support from the clinical team and recruiters at Fusion M…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T12:42:27",
    "url": "https://www.adzuna.com/land/ad/5137290780?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=E47D67CF0E1C1997CAFF3A8E855F732296BD4822",
    "skills": [
      "Go"
    ],
    "salary_range": "£123,249"
  },
  {
    "title": "Travel Physical Therapist (PT)",
    "company": "Fusion Medical Staffing",
    "description": "Travel Physical Therapist (PT) at Fusion Medical Staffing summary: The Travel Physical Therapist (PT) role at Fusion Medical Staffing involves providing patient care, coordinating with healthcare teams, and monitoring patients' responses to treatment. This position requires strong interpersonal skills and offers competitive pay, comprehensive benefits, and ongoing support from a dedicated recruiter. Physical Therapists must possess the ability to work effectively under pressure while maintainin…",
    "location": "Palmer, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T12:34:50",
    "url": "https://www.adzuna.com/land/ad/5137279486?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=0518E4FC252657DA0D39142EDAA30A65F4D9D73A",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "£96,348"
  },
  {
    "title": "Occupational Therapist",
    "company": "The Weston Group",
    "description": "The Weston Group is dedicated to providing evidence-based, person-centered therapeutic services to residents. We are proud to remain a therapist-owned and operated company that believes in a unique and innovative approach to geriatric care. We are looking for a committed and patient-focused PRN Occupational Therapist to join our rehab team . We're seeking an Occupational Therapist to help develop, recover and maintain the daily living and work skills of people with physical, mental, or developm…",
    "location": "Northampton, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T23:19:12",
    "url": "https://www.adzuna.com/details/5138135893?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£104,000 - £114,400"
  },
  {
    "title": "Travel Physical Therapist - $2,045 per week",
    "company": "Healthcare Support",
    "description": "Healthcare Support is seeking a travel Physical Therapist for a travel job in Easton, Pennsylvania. Job Description & Requirements Specialty: Physical Therapist Discipline: Therapy Start Date: 04/14/2025 Duration: 13 weeks 40 hours per week Shift: 8 hours Employment Type: Travel Healthcare Support Job ID 436124. Pay package is based on 8 hour shifts and 40 hours per week (subject to confirmation) with tax-free stipend amount to be determined. Posted job title: physical therapist (pt) About Heal…",
    "location": "Palmer, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:26:55",
    "url": "https://www.adzuna.com/land/ad/5137913864?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=5521CC7C54F6660504EA3F583F4822D767E5C0AC",
    "skills": [],
    "salary_range": "Up to £106,340"
  },
  {
    "title": "Travel Physical Therapist - $1,693 per week",
    "company": "Nationwide Therapy Group",
    "description": "Nationwide Therapy Group is seeking a travel Physical Therapist for a travel job in Easton, Pennsylvania. Job Description & Requirements Specialty: Physical Therapist Discipline: Therapy Start Date: 04/14/2025 Duration: 13 weeks 40 hours per week Shift: 8 hours, days Employment Type: Travel NTG is committed to matching you to the right position and we pride ourselves on our commitment to our travelers. This includes offering exceptional pay packages along with these great benefits: Medical, den…",
    "location": "Palmer, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T18:41:09",
    "url": "https://www.adzuna.com/land/ad/5137874542?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=DF787F345DFC3FD6FB488B4ED796FF3B750A8E75",
    "skills": [],
    "salary_range": "Up to £88,036"
  },
  {
    "title": "Remote Mental Health Therapist",
    "company": "SonderMind",
    "description": "Remote Mental Health Therapist at SonderMind summary: SonderMind is a leading mental health care platform that seeks compassionate, licensed therapists to provide therapy while benefiting from flexible hours and a supportive community. As a therapist at SonderMind, you will have the autonomy to make clinical decisions and will receive guaranteed pay for your sessions. This role offers the opportunity to impact individuals' lives positively while enjoying professional development resources and s…",
    "location": "Palmer, Northampton County",
    "is_remote": true,
    "posted_date": "2025-04-09T13:11:40",
    "url": "https://www.adzuna.com/land/ad/5137371015?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=064F8AF49280E8440B540AE6F9C7E4F61F907E16",
    "skills": [],
    "salary_range": "£70,707"
  },
  {
    "title": "Culinary Supervisor, Seasonal",
    "company": "Dorney Park",
    "description": "Overview: $17.50 / Hour Joining our Dorney Park team means you’ll work with our cu linary team to provide a positive dining experience to our guests while maint aining safe and sanitary food practices. You’ll also Lead by Example Ensure you are promoting our safety culture, to include use and maintenance of PPE levels Following safety guidelines when it comes to using and cleaning equipment Ensure food handling compliance when it comes to: food temperature logs, opening/ closing checklists, lin…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T13:00:25",
    "url": "https://www.adzuna.com/land/ad/5137324008?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=CD28BAA2FED9EAFF613DE26A8FF5E0DAE7BB3FC9",
    "skills": [
      "AI"
    ],
    "salary_range": "£51,664"
  },
  {
    "title": "Travel CT Tech - $3,087 per week in Allentown, PA",
    "company": "Windsor Healthcare Recruitment Group, Inc.",
    "description": "Local Rate Differential Shift: Sat/Sun 7p-7a Certifications required: ARRT (CT) and BLS Years of experience required: 1 RTO Required upon submission 13 weeks No on-call Scrub color: Any Stroke Certified Hospital and Level 1 Trauma facility Must be able to work independently when needed First time travelers accepted with 1 yr of experience Special Equiptment used: GE 64 VCT/Lightspeed, GE 128 Revolution, Med Rad Injector and ulrich motion injector",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T00:41:05",
    "url": "https://www.adzuna.com/land/ad/5136687425?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=22E5759B9D6CBC4CCFB512A1949FEB51226E9349",
    "skills": [],
    "salary_range": "£148,176"
  },
  {
    "title": "LP (Virtual)",
    "company": "Headway",
    "description": "Remote Licensed Psychiatrist Wage: Between $157-$238 an hour Are you a licensed Psychiatrist looking to launch a private practice, or grow your existing practice? Headway can help you earn more through insurance Headway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run a flourishing private practice. Mental h…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:32:03",
    "url": "https://www.adzuna.com/land/ad/5136783044?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=B7A29D47ECE709F778DF836E4A033458E534EA5C",
    "skills": [],
    "salary_range": "£91,804"
  },
  {
    "title": "Travel Nurse RN - ED - Emergency Department - $2,295 per week",
    "company": "ARMStaffing",
    "description": "ARMStaffing is seeking a travel nurse RN ED - Emergency Department for a travel nursing job in Allentown, Pennsylvania. Job Description & Requirements Specialty: ED - Emergency Department Discipline: RN Start Date: 05/12/2025 Duration: 13 weeks 36 hours per week Shift: 12 hours, nights Employment Type: Travel ARMStaffing Job ID 31572549. Pay package is based on 12 hour shifts and 36.0 hours per week (subject to confirmation) with tax-free stipend amount to be determined. Posted job title: RN:ER…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T22:23:26",
    "url": "https://www.adzuna.com/land/ad/5138076436?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=A1799C909ECFC623F3B0899B0E170BDC4E47A605",
    "skills": [],
    "salary_range": "Up to £119,340"
  },
  {
    "title": "LCSW (Remote)",
    "company": "Headway",
    "description": "Remote Licensed Clinical Social Worker (LCSW) Wage: Between $86-$120 an hour Are you a Licensed Clinical Social Worker looking to launch a private practice, or grow your existing practice? Headway can help you earn more through insurance Headway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run a flourishing …",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": true,
    "posted_date": "2025-04-09T01:32:01",
    "url": "https://www.adzuna.com/land/ad/5136782654?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=0A1249207FD917859FEA160EEA1405BB574F428C",
    "skills": [],
    "salary_range": "£92,240"
  },
  {
    "title": "▷ 3 Days Left Travel Radiology Technician",
    "company": "Uniti Med",
    "description": "Job Description Uniti Med is seeking a travel Radiology Technician for a travel job in Bethlehem, Pennsylvania. Job Description & Requirements - Specialty: Radiology Technician - Discipline: Allied Health Professional - Start Date: 05/19/2025 - Duration: 13 weeks - Shift: days - Employment Type: Travel Uniti Med is looking for a Travel X-Ray Tech (ARRT, R) in Bethlehem, PA. This assignment lasts 13 weeks and is scheduled to start on 2025-05-19T00:00:00.0000000. Need help finding housing? Check …",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T00:52:50",
    "url": "https://www.adzuna.com/land/ad/5138227529?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=8E470F42EFAC073307F5FAF149045333C63EA9BC",
    "skills": [],
    "salary_range": "£117,084"
  },
  {
    "title": "LMHT (Virtual)",
    "company": "Headway",
    "description": "Remote Licensed Mental Health Therapist (LMHT) Wage: Between $86-$120 an hour Are you a Licensed Mental Health Therapist looking to launch a private practice, or grow your existing practice? Headway can help you earn more through insurance Headway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run a flourishin…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:32:04",
    "url": "https://www.adzuna.com/land/ad/5136783106?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=1F5F397E4BCC58053BBA9C95A9A6D6F36CE851C4",
    "skills": [],
    "salary_range": "£88,238"
  },
  {
    "title": "Remote Mental Health Therapist",
    "company": "SonderMind",
    "description": "Remote Mental Health Therapist at SonderMind summary: As a Remote Mental Health Therapist at SonderMind, you will provide compassionate and clinical care to individuals seeking therapy through a leading mental health care platform. You will enjoy flexibility in your working hours, guaranteed pay, and support from a network of like-minded therapists. The role requires a Master's degree in a related field and full licensure to practice independently. SonderMind is a leading mental health care pla…",
    "location": "Emmaus, Lehigh County",
    "is_remote": true,
    "posted_date": "2025-04-09T13:00:20",
    "url": "https://www.adzuna.com/land/ad/5137323483?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=3245BB75ED51A2EB3600322B97CC589B1A24E734",
    "skills": [],
    "salary_range": "£72,216"
  },
  {
    "title": "Physical Therapist",
    "company": "Pioneer Healthcare Services",
    "description": "If you're interested in making a significant impact as a Physical Therapist (PT) in Skilled Nursing Facility - SNF setting this Easton, PA position might be what you are looking for Responsibilities: Assess patients' physical abilities and develop personalized treatment plans Provide therapy to improve mobility, strength, and functional independence Collaborate with healthcare teams to ensure comprehensive patient care Educate patients and families on exercise programs and injury prevention Mon…",
    "location": "Old Orchard, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T04:22:58",
    "url": "https://www.adzuna.com/details/5136959360?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£74,238"
  },
  {
    "title": "Travel Nurse RN - Pediatrics - $2,221 to $2,421 per week in Bethlehem, PA",
    "company": "ARMStaffing",
    "description": "Job Description Summary: Pediatric Rehabilitation RN (7A-7P) We are seeking a dedicated and compassionate Registered Nurse (RN) to join our Pediatric Rehabilitation team for the 7pm-7am shift. The ideal candidate will have at least 1-2 years of experience in pediatric nursing, with a preference for those who have experience in tracheostomy and ventilator care. PALS certification is preferred. This role will involve providing care to children with complex medical and congenital conditions in bot…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T02:07:31",
    "url": "https://www.adzuna.com/land/ad/5136837663?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=7713CA8B3A89A9732CD90ED02DAD4F298FCCB646",
    "skills": [],
    "salary_range": "£9,684"
  },
  {
    "title": "Remote Mental Health Therapist",
    "company": "SonderMind",
    "description": "Remote Mental Health Therapist at SonderMind summary: As a Remote Mental Health Therapist at SonderMind, you will deliver high-quality therapy services, focusing on clinical outcomes while enjoying flexible working hours. You will be part of a supportive community that empowers you with clinical autonomy, professional development opportunities, and guarantees pay for completed sessions. Join an innovative platform that streamlines credentialing and enhances your practice by matching you with th…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": true,
    "posted_date": "2025-04-09T13:00:39",
    "url": "https://www.adzuna.com/land/ad/5137325407?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=A8F316CF90AA466F9BE7FF630122CA9D9980091D",
    "skills": [],
    "salary_range": "£77,752"
  },
  {
    "title": "3 Days Left Restaurant Delivery - Sign Up and Start Earning (Parryville)",
    "company": "DoorDash",
    "description": "Why Deliver with DoorDash? DoorDash is the 1 category leader in food delivery, food pickup, and convenience store delivery in the US, trusted by millions of customers every day. As a Dasher, you’ll stay busy with a variety of earnings opportunities and can work when it works for you. Whether you’re looking for a side hustle or a full-time gig, delivering with DoorDash gives you the opportunity to earn extra cash on your terms. - Multiple ways to earn: Whether you’re delivering meals, groceries,…",
    "location": "Parryville, Carbon County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:52:58",
    "url": "https://www.adzuna.com/land/ad/5137950517?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=1D05F377C5812336A44F0E9983F39A8171D49E69",
    "skills": [
      "Go"
    ],
    "salary_range": "£81,645"
  },
  {
    "title": "Warehouse Custodian / Janitor",
    "company": "Uline, Inc.",
    "description": "Warehouse Custodian / Janitor Pay from $21 to $24 per hour per hour with significant growth and earning potential Plus $2 Shift Differential Pennsylvania Branch 700 Uline Way, Allentown, PA 18106 Morning Call’s Top Large Employer of 2025 Care a lot about cleanliness? Obsessed with organization? We are too. Uline’s best-in-class warehouses are bright, spotless and organized - making it the ideal spot for your next Custodian position Hours: Tuesday - Friday, 7 AM to 3:30 PM PLUS Saturday, 8 AM to…",
    "location": "Wescosville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T17:01:42",
    "url": "https://www.adzuna.com/land/ad/5137762477?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=8D62BF8C26FDD902B85CCC0AD28930EF71A9DF96",
    "skills": [],
    "salary_range": "£40,326"
  },
  {
    "title": "Hairstylist - Cosmetologist",
    "company": "Supercuts Careers",
    "description": "We're so happy you found us We would love for you to join our dynamic family of like-minded, passionate, and talented hairstylists. We are here to provide continual growth and are committed to nurturing your talent and fueling your passion to work behind the chair. We want everyone to have the confidence to shine. We provide ongoing paid training that's the best in the business. Whether just graduating from Beauty School and obtaining your cosmetology license, or looking for a change and more g…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:27:37",
    "url": "https://www.adzuna.com/land/ad/5137915995?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=9D0D40372BDD82CE431658F4E6AF7B180B05D974",
    "skills": [
      "Go",
      "AI"
    ],
    "salary_range": "£43,245"
  },
  {
    "title": "LPC (Virtual)",
    "company": "Headway",
    "description": "Remote Licensed Professional Counselor (LPC) Wage: Between $86-$120 an hour Are you a Licensed Professional Counselor looking to launch a private practice, or grow your existing practice? Headway can help you earn more through insurance Headway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run a flourishing p…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:32:03",
    "url": "https://www.adzuna.com/land/ad/5136782994?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=4286B561AB4CD9969AC4480FCCB8668D5D6F518F",
    "skills": [],
    "salary_range": "£89,700"
  },
  {
    "title": "Delivery Driver (Parryville)",
    "company": "DoorDash",
    "description": "Why Deliver with DoorDash? DoorDash is the 1 category leader in food delivery, food pickup, and convenience store delivery in the US, trusted by millions of customers every day. As a Dasher, you’ll stay busy with a variety of earnings opportunities and can work when it works for you. Whether you’re looking for a side hustle or a full-time gig, delivering with DoorDash gives you the opportunity to earn extra cash on your terms. - Multiple ways to earn: Whether you’re delivering meals, groceries,…",
    "location": "Parryville, Carbon County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:53:00",
    "url": "https://www.adzuna.com/land/ad/5137950732?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=127FE8C68A597D8110402D75269E9244D8E09C65",
    "skills": [
      "Go"
    ],
    "salary_range": "£58,422"
  },
  {
    "title": "Travel Physical Therapist - $1,539 per week",
    "company": "Uniti Med",
    "description": "Uniti Med is seeking a travel Physical Therapist for a travel job in Easton, Pennsylvania. Job Description & Requirements Specialty: Physical Therapist Discipline: Therapy Start Date: 04/14/2025 Duration: 12 weeks Shift: days Employment Type: Travel UnitiMed Job ID 2143966. Posted job title: Therapy Physical Therapist (PT) About Uniti Med Uniti Med meticulously matches your talents to our open needs to ensure the ultimate travel experience. Tell us where you want to go and let our experienced s…",
    "location": "Palmer, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T18:40:57",
    "url": "https://www.adzuna.com/land/ad/5137874316?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=32E71D956FA2F2D1078C101DB1E23E3FFCE984D8",
    "skills": [
      "go"
    ],
    "salary_range": "Up to £80,028"
  },
  {
    "title": "▷ [15h Left] Delivery Driver (Macungie)",
    "company": "DoorDash",
    "description": "Why Deliver with DoorDash? DoorDash is the 1 category leader in food delivery, food pickup, and convenience store delivery in the US, trusted by millions of customers every day. As a Dasher, you’ll stay busy with a variety of earnings opportunities and can work when it works for you. Whether you’re looking for a side hustle or a full-time gig, delivering with DoorDash gives you the opportunity to earn extra cash on your terms. - Multiple ways to earn: Whether you’re delivering meals, groceries,…",
    "location": "Macungie, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:55:07",
    "url": "https://www.adzuna.com/land/ad/5137960599?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=BE8604A6B83CA12B66E6B1660EE8864A13B5B631",
    "skills": [
      "Go"
    ],
    "salary_range": "£63,919"
  },
  {
    "title": "Combat Engineer",
    "company": "U.S. Army",
    "description": "No Experience Necessary ABOUT THIS JOB THIS POSITION REQUIRES AN ENLISTMENT IN THE U.S. ARMY OR ARMY RESERVE As a Combat Engineer, you'll work quickly and skillfully to help Soldiers navigate while on combat missions by constructing bridges, clearing barriers with explosives, and detecting and avoiding mines and other environmental hazards. You'll provide expertise and come up with quick and creative engineering solutions, constructing fighting positions, fixed and floating bridges, and obstacl…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:33:39",
    "url": "https://www.adzuna.com/land/ad/5136788805?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=83FF319EC93808115A328A318416649CC3402CE1",
    "skills": [],
    "salary_range": "£69,949"
  },
  {
    "title": "▷ [15h Left] Drive with DoorDash (Emmaus)",
    "company": "DoorDash",
    "description": "Why Deliver with DoorDash? DoorDash is the 1 category leader in food delivery, food pickup, and convenience store delivery in the US, trusted by millions of customers every day. As a Dasher, you’ll stay busy with a variety of earnings opportunities and can work when it works for you. Whether you’re looking for a side hustle or a full-time gig, delivering with DoorDash gives you the opportunity to earn extra cash on your terms. - Multiple ways to earn: Whether you’re delivering meals, groceries,…",
    "location": "Emmaus, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:55:03",
    "url": "https://www.adzuna.com/land/ad/5137960328?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=80901E8860FCB82E0D5CBD5DF3F8A3A08E675FA9",
    "skills": [
      "Go"
    ],
    "salary_range": "£56,604"
  },
  {
    "title": "Physical Therapist, Home Health $20,000 Bonus",
    "company": "AccentCare, Inc.",
    "description": "Overview: Find Your Passion and Purpose as a Home Health Physical Therapist Bonus: $20,000 Coverage area: Northampton/Monroe Counties, PA and surrounding areas Shift: FT Salary Range: $96,000 - $110,000 New Grads: Yes This position is paid on a per-visit basis. The compensation reflected on this posting, is an estimate of salary compensation for full time status. Reimagine Your Career in Home Health As a medical professional, you know that what you do impacts you as much as your patients and th…",
    "location": "Center Valley, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T00:36:15",
    "url": "https://www.adzuna.com/land/ad/5138208058?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=CA5725F3FAC7EE1ED6326E6F6BD754A09ADF7F01",
    "skills": [
      "AI"
    ],
    "salary_range": "£63,624"
  },
  {
    "title": "Delivery Driver - Earn Extra Cash (Bowmanstown) [High Salary]",
    "company": "DoorDash",
    "description": "Why Deliver with DoorDash? DoorDash is the 1 category leader in food delivery, food pickup, and convenience store delivery in the US, trusted by millions of customers every day. As a Dasher, you’ll stay busy with a variety of earnings opportunities and can work when it works for you. Whether you’re looking for a side hustle or a full-time gig, delivering with DoorDash gives you the opportunity to earn extra cash on your terms. - Multiple ways to earn: Whether you’re delivering meals, groceries,…",
    "location": "Bowmanstown, Carbon County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:53:06",
    "url": "https://www.adzuna.com/land/ad/5137951271?se=-Ku6d8wV8BGw49kPaCZXLA&utm_medium=api&utm_source=71cf92b8&v=65ABB48C07526F5459C7898C52529394BB963425",
    "skills": [
      "Go"
    ],
    "salary_range": "£52,344"
  }
]