[
  {
    "title": "ULINE- Call Center Representative",
    "company": "Uline, Inc.",
    "description": "Customer Service Representative - Bilingual Pay from $23 to $28 per hour with significant growth and earning potential Pennsylvania Branch 700 Uline Way, Allentown, PA 18106 Morning Call’s Top Large Employer of 2025 Customer Service is the heartbeat of Uline As a Bilingual Customer Service Representative, you’ll dig into order details to deliver an exceptional experience our customers love. Our company continues to grow, creating new career opportunities and job stability you can count on. Posi…",
    "location": "Schnecksville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T08:20:01",
    "url": "https://www.adzuna.com/land/ad/5138660941?se=DPU-aVMW8BGkSYinE3cHCQ&utm_medium=api&utm_source=71cf92b8&v=A6605EDDA79F28B9453620FD18CAFE5D17FFF303",
    "skills": [
      "AI"
    ],
    "salary_range": "£57,976"
  },
  {
    "title": "Lifeguard- Hiring for Summer",
    "company": "Dorney Park",
    "description": "Overview: $15 / Hour During training, the hourly rate is $14 until successfully passing the lifeguard course. Joining our Dorney Park team means you’ll keep guests safe at our pools in our Wildwater Kingdom Waterpark. You’ll also Earn a PAID lifeguard license. Monitor and enforce the waterpark rules in our pools, slides, and lazy rivers. Receive continuous in-service training and lifesaving skills. Learn to properly use and store rescue equipment that can utilized in real world Respond to medic…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T05:08:03",
    "url": "https://www.adzuna.com/details/5136995534?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£50,898"
  },
  {
    "title": "Nursing Assistant - New Sign-on Bonus / Increased Rates",
    "company": "Unknown Company",
    "description": "At Good Shepherd’s LTACH unit you will be rewarded with low patient to nurse ratios giving you an opportunity to provide a high level of specialized care to our patients while at the same time gain an opportunity to bond with the patients you serve. If this sounds desirable to you, we want to speak to you Our LTACH nursing is a specialty that exists to care for patients who are experiencing life-threatening health crises within a patient / family centered model of care. The Good Shepherd Specia…",
    "location": "Fountain Hill, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T14:14:36",
    "url": "https://www.adzuna.com/details/5137463578?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI",
      "Go"
    ],
    "salary_range": "£39,420"
  },
  {
    "title": "Public Relations/Marketing Internship",
    "company": "The Borgen Project",
    "description": "Are you passionate about making a difference in the world? Look no further The Borgen Project is an international organization that works at the political level to improve living conditions for people impacted by war, famine and poverty. With 20 years of experience in the advocacy space, The Borgen Project has worked to support the passage of numerous bills that have benefitted close to 500 million people in developing countries. PR/Marketing Internship: This is a part-time 12-hours per week, 1…",
    "location": "Bath, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T15:27:53",
    "url": "https://www.adzuna.com/details/5137562796?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£51,957"
  },
  {
    "title": "Truck Driver - Local Class A - Penske Logistics",
    "company": "Penske Logistics",
    "description": "Job Description: Truck Driver - Local Class A - Penske Logistics Center Valley, PA, United States Job Description Immediate Opportunities: Full-time Local Class A CDL Truck Drivers  Average $93000 annually  $3000 annual safety bonus  Driver referral bonus program up to $5000 per referral  Local, Home Daily You will drive:  Late model, Penske Truck Leasing trucks  Best-in-class specs designed for comfort What you will do:  Make dock-to-dock deliveries of palletized grocery products  All local de…",
    "location": "Center Valley, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T13:47:34",
    "url": "https://www.adzuna.com/details/5137417993?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£69,783"
  },
  {
    "title": "Class A Company Driver, Local, Dry Van",
    "company": "HCSC",
    "description": "Job Summary Company Driver (W2, Solo) Dry Van Local $700 - $900 total weekly avg. pay 300 - 700 avg. miles per week Dedicated Day shift 100% Driver Load/Unload Home Time 5 days on, 2 days off Home at least 3 weekends per month Benefits Medical, Dental, Vision, Life and 401K Paid holidays Paid vacation Core Responsibilities include, but are not limited to Maintaining a clean, sanitary, and safe work area. Inspection of vehicle, equipment, and cargo to ensure everything is safe, legal, and secure…",
    "location": "Whitehall, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T00:05:13",
    "url": "https://www.adzuna.com/details/5138177496?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI",
      "Go"
    ],
    "salary_range": "£36,400 - £46,800"
  },
  {
    "title": "Asst Store Mgr - Operation",
    "company": "Williams-Sonoma",
    "description": "Description We hope you're interested in building a home with us. Even if you don't feel that you meet every requirement listed in this job description, we still encourage you to apply. About the Team Our mission is to enhance the quality of our customers’ lives at home. We put the customer at the center of everything we do, every day. Our corporate values that guide our actions and decisions are our People First culture, customers, quality, shareholders, integrity, and corporate responsibility…",
    "location": "Whitehall, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T16:14:48",
    "url": "https://www.adzuna.com/details/5139628016?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£36,702"
  },
  {
    "title": "Area Manager II - Breinigsville,PA",
    "company": "Amazon",
    "description": "Description Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager. In this role, you will lead a team of hourly workforce and will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. You will also play a key role in maintaining our customer expectations to ensure c…",
    "location": "Breinigsville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T10:51:15",
    "url": "https://www.adzuna.com/details/5138821921?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£72,791"
  },
  {
    "title": "Housing Specialist, Full-time",
    "company": "U.S. Army",
    "description": "ELIGIBLE FOR UP TO A $20K SIGNING BONUS. TALK TO YOUR RECRUITER FOR DETAILS Learn more about the general tasks related to this opportunity below, as well as required skills. ABOUT THIS JOB THIS POSITION REQUIRES AN ENLISTMENT IN THE U.S. ARMY OR ARMY RESERVE As the Unit Supply Specialist, you'll be responsible for supervising and maintaining all Army supplies and equipment. You'll receive, inspect, inventory, load and unload, store, issue, and deliver all supplies and equipment. You'll also saf…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T13:54:03",
    "url": "https://www.adzuna.com/details/5139063521?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£43,600"
  },
  {
    "title": "Server (PT/FT)",
    "company": "Unknown Company",
    "description": "Server We are hiring outgoing, upbeat servers who can connect with our guests; meeting and even anticipating their needs to provide a one of a kind dining experience that keeps them coming back Great communication skills are a must, as is the capability to work as part of a dynamic team. Are you someone who has tons of energy, great attention to detail, and an awesome personality? Servers must be able to lift 15-30lbs, have the ability to handle cash transactions, stand for the length of the sh…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T13:35:53",
    "url": "https://www.adzuna.com/details/5139040173?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "go"
    ],
    "salary_range": "£44,525"
  },
  {
    "title": "LTC Finance Supervisor",
    "company": "Unknown Company",
    "description": "JOB SUMMARY The LTC Finance Supervisor oversees the business office related staff, coordinates and assures that all required resident information is obtained in order to expedite reimbursement for charges and expenses. Work is performed in accordance with Federal, state and local standards, guidelines and regulations that govern long-term care facilities, and under the supervision of the Dir Rev & Rev Analysis. ESSENTIAL FUNCTIONS Supervises the work of subordinate staff, through assignment of …",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T13:35:50",
    "url": "https://www.adzuna.com/details/5139039707?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI",
      "Go"
    ],
    "salary_range": "£73,420"
  },
  {
    "title": "Class A Company Driver, OTR, Refrigerated",
    "company": "TEAM BIONDI LLC",
    "description": "About the Company Team Biondi, LLC is a family-owned and operated motor carrier company headquartered in Lake Ariel, Pennsylvania and has been in operation since 2001. We take fleet maintenance and safety very seriously, and our new facility boasts a state of the art shop with two in-house mechanics. Our company drivers are among the best paid in the industry, which also increases driver satisfaction and retention. Our drivers are part of our family, and they treat our customers’ freight like t…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T23:29:52",
    "url": "https://www.adzuna.com/details/5138143933?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£52,000 - £78,000"
  },
  {
    "title": "Maintenance Supervisor",
    "company": "50018 - Heidelberg Materials US Cement LLC",
    "description": "Line of Business: Cement & White About Us Heidelberg Materials is one of the world's largest suppliers of building materials. Heidelberg Materials North America operates over 450 locations across the U.S. and Canada with approximately 9,000 employees. What You'll Be Doing Overseeing and coordinating maintenance activities to ensure equipment reliability and efficiency. Leading and mentoring a team of maintenance technicians. Implementing preventive maintenance programs and schedules. Ensuring c…",
    "location": "Emmaus, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T02:00:42",
    "url": "https://www.adzuna.com/details/5138354030?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£72,577"
  },
  {
    "title": "Maintenance Technician III",
    "company": "FedEx",
    "description": "MINIMUM EDUCATION High School Diploma or GED required Certificates in Industrial Maintenance/Mechatronics, electrical or mechanical trade or related area and an associate degree in a related area preferred. MINIMUM EXPERIENCE Four (4) years experience in Industrial Maintenance with proficiency in knowledge and demonstrated skills in mechanical power transmission, electrical and working knowledge of PLC/Controls and welding/fabrication skills through job experience, related military experience a…",
    "location": "Breinigsville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T01:49:44",
    "url": "https://www.adzuna.com/details/5138328909?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£75,344"
  },
  {
    "title": "Delivery Driver - Sign Up and Start Earning (Coopersburg) (Apply in 3 Minutes)",
    "company": "DoorDash",
    "description": "Why Deliver with DoorDash? DoorDash is the 1 category leader in food delivery, food pickup, and convenience store delivery in the US, trusted by millions of customers every day. As a Dasher, you’ll stay busy with a variety of earnings opportunities and can work when it works for you. Whether you’re looking for a side hustle or a full-time gig, delivering with DoorDash gives you the opportunity to earn extra cash on your terms. - Multiple ways to earn: Whether you’re delivering meals, groceries,…",
    "location": "Coopersburg, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T19:52:53",
    "url": "https://www.adzuna.com/land/ad/5137950200?se=DPU-aVMW8BGkSYinE3cHCQ&utm_medium=api&utm_source=71cf92b8&v=B80A54B50D9C6896234267727F36B3C8B4FB5B0F",
    "skills": [
      "Go"
    ],
    "salary_range": "£82,692"
  },
  {
    "title": "CDL A Company Driver, Local, Tanker trailer",
    "company": "OLD GLORY EXPRESS INC",
    "description": "Job Summary Company Driver (W2, Solo) Tanker trailer Local $700 - $3,000 total weekly avg. pay 1,000 - 2,500 avg. miles per week Dedicated Day shift 100% Driver Load/Unload Home Time 6 days on, 1 day off Home at least one weekend per month Benefits Medical, Dental, Vision, Life and Disability Paid holidays Paid vacation Core Responsibilities include, but are not limited to Inspection of vehicle, equipment, and cargo to ensure everything is safe, legal, and secure. Maintaining a driver's log in …",
    "location": "Emmaus, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T22:39:31",
    "url": "https://www.adzuna.com/details/5138097197?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI",
      "Go"
    ],
    "salary_range": "£36,400 - £156,000"
  },
  {
    "title": "PCA",
    "company": "Country Meadows of Northampton Assoc",
    "description": "Job Description Job Description Pay starts at $16/hr. with the opportunity to earn more based on experience It’s a wonderful thing to feel at home while you are at work. To consider your co-workers your friends. To feel respected and encouraged to be your best. We know that when you feel great at work, you’ll make our residents feel great too. As key members of our direct-care team, Personal Care Assistants provide one-on-one support to our residents in their daily routines, socialization and o…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T13:12:47",
    "url": "https://www.adzuna.com/details/5139015369?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£34,963"
  },
  {
    "title": "Field Roof Inspector (Allentown, PA)",
    "company": "Hancock Claims Consultants",
    "description": "Job Description Job Description Hancock Claims Consultants specialize in Ladder Assist and Property Inspection Services, collaborating directly with numerous insurance agencies for efficient claims management. At Hancock, we are at the forefront of claims resolution services, offering nationwide coverage, swift and comprehensive claims inspections, and unparalleled quality and precision. Our established process ensures top-tier claims support, ranging from rapid catastrophe response to direct i…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T11:55:28",
    "url": "https://www.adzuna.com/details/5138929479?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI",
      "Swift"
    ],
    "salary_range": "£58,799"
  },
  {
    "title": "Travel CT Tech - $2,380 to $2,533 per week in Bethlehem, PA",
    "company": "Host Healthcare",
    "description": "Host Healthcare is an award-winning travel healthcare company with an immediate opening for this CT Technologist position in Bethlehem , PA . Why Choose Host Healthcare? Passionate and transparent team members have made Host Healthcare the agency of choice for new and experienced travelers looking for opportunities far away and close to home. Starting the day you apply, we’ll help you navigate each step of the process. Our recruiters act not only as your dedicated travel career mentor but also …",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T02:57:11",
    "url": "https://www.adzuna.com/land/ad/5136903940?se=DPU-aVMW8BGkSYinE3cHCQ&utm_medium=api&utm_source=71cf92b8&v=FAB56F78CE262735B199D82161115C39A22244F9",
    "skills": [],
    "salary_range": "£10,133"
  },
  {
    "title": "LMHT (Virtual)",
    "company": "Headway",
    "description": "Remote Licensed Mental Health Therapist (LMHT) Wage: Between $86-$120 an hour Are you a Licensed Mental Health Therapist looking to launch a private practice, or grow your existing practice? Headway can help you earn more through insurance Headway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run a flourishin…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T09:25:31",
    "url": "https://www.adzuna.com/land/ad/5138715985?se=DPU-aVMW8BGkSYinE3cHCQ&utm_medium=api&utm_source=71cf92b8&v=1683BDEA29C6C9438321F894BB143984733D9486",
    "skills": [],
    "salary_range": "£85,484"
  },
  {
    "title": "Case Manager",
    "company": "Holcomb Behavioral Health System",
    "description": "Our vast array of services - educational, employment, vocational, residential, habilitative, and behavioral health - are delivered through a network of national and international affiliates. This allows us to take a comprehensive, holistic approach to improving the lives of every person we serve - those who receive and those who reap the benefits of our innovative, responsive solutions. Job Description: The case manager will provide community-based services to individuals identified as eligible…",
    "location": "Forks, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T08:45:19",
    "url": "https://www.adzuna.com/details/5137130897?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£34,424"
  },
  {
    "title": "▷ Only 24h Left Travel CT Tech - Radiology / Cardiology",
    "company": "Planet Healthcare",
    "description": "Job Description Planet Healthcare is seeking a travel CT Technologist for a travel job in Allentown, Pennsylvania. Job Description & Requirements - Specialty: CT Technologist - Discipline: Allied Health Professional - Start Date: 05/12/2025 - Duration: 13 weeks - 36 hours per week - Shift: 12 hours, nights - Employment Type: Travel Planet Healthcare Job ID 68721712. Pay package is based on 12 hour shifts and 36 hours per week (subject to confirmation) with tax-free stipend amount to be determin…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T09:42:28",
    "url": "https://www.adzuna.com/land/ad/5137172112?se=DPU-aVMW8BGkSYinE3cHCQ&utm_medium=api&utm_source=71cf92b8&v=052564C02A1774A1109BA92CD2F740C7A244ED0F",
    "skills": [],
    "salary_range": "£81,385"
  },
  {
    "title": "Commercial Flooring Careers",
    "company": "CentiMark Corporation",
    "description": "QuestMark Flooring - Allentown, PA - Full Time Salaried and hourly positions available - SIGNING BONUS QuestMark is looking for local experienced employees Join our fast-growing service division:  FOREMEN  ESTIMATORS SUPERINTENDENT  SALES REPRESENTATIVES  - Bring your crew QuestMark, a division of CentiMark Corporation, the nation’s largest commercial and industrial flooring contractor, has seen tremendous growth in our flooring division which includes but is not limited to concrete floor maint…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T01:18:59",
    "url": "https://www.adzuna.com/details/5138290455?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£81,260"
  },
  {
    "title": "Gopuff Delivery Driver Partner",
    "company": "Gopuff",
    "description": "Do more than make ends meet. Deliver with Gopuff and get paid to deliver what your neighbors need from a Gopuff facility near you With one centralized pickup location and smaller delivery zones, Gopuff makes earning effortless. It's simple: deliver from a facility near you straight to the customer You’ll be delivering everyday essentials, from cleaning supplies, home needs and OTC medications to food, drinks and more. Sign up to be a Gopuff Delivery Partner today and experience the easiest way …",
    "location": "Fountain Hill, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T13:41:56",
    "url": "https://www.adzuna.com/land/ad/5139053109?se=DPU-aVMW8BGkSYinE3cHCQ&utm_medium=api&utm_source=71cf92b8&v=E7B5FD8FF7074700EE295EEBBCA2793CE3EABDEA",
    "skills": [
      "AI",
      "Go"
    ],
    "salary_range": "£70,945"
  },
  {
    "title": "Culinary Specialist",
    "company": "U.S. Army",
    "description": "ABOUT THIS JOB THIS POSITION REQUIRES AN ENLISTMENT IN THE U.S. ARMY OR ARMY RESERVE Make sure to read the full description below, and please apply immediately if you are confident you meet all the requirements. As a Culinary Specialist, you'll cook meals and work alongside chefs to prepare meals comparable to any major restaurant, so that Soldiers can sit down and enjoy a hot meal in between training or mission deployments. You'll be responsible for preparing and servicing meals both in the fi…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T13:34:35",
    "url": "https://www.adzuna.com/details/5139033771?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£47,664"
  },
  {
    "title": "Licensed Marriage and Family Therapist (Virtual)",
    "company": "Headway",
    "description": "Remote Licensed Marriage and Family Therapist (LMFT) Wage: Between $86-$120 an hour Are you a Licensed Marriage and Family Therapist looking to launch a private practice, or grow your existing practice? Headway can help you earn more through insurance Headway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run …",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:32:01",
    "url": "https://www.adzuna.com/land/ad/5136782670?se=DPU-aVMW8BGkSYinE3cHCQ&utm_medium=api&utm_source=71cf92b8&v=F697AA37B6F60E20D7C9EE268BAC376EB8E73362",
    "skills": [],
    "salary_range": "£100,891"
  },
  {
    "title": "Intern Job Details | Cintas",
    "company": "Cintas",
    "description": "Job Description Cintas is seeking an Intern to participate in a program designed to provide comprehensive knowledge across all areas of our business, as well as the professional services industry. The goal is to expose the Intern to our different departments. The Intern experience combines hands-on training with the opportunity to interact with multiple departments in order to develop stronger leadership, organization, communication and time management skills. Skills/Qualifications Required Hig…",
    "location": "Emmaus, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T12:34:13",
    "url": "https://www.adzuna.com/details/5138965141?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI",
      "Go"
    ],
    "salary_range": "£35,291"
  },
  {
    "title": "Field Service Representative - Medical Equipment",
    "company": "ABB",
    "description": "Field Service Technician At ABB, we are dedicated to addressing global challenges. Our core values: care, courage, curiosity, and collaboration - combined with a focus on diversity, inclusion, and equal opportunities - are key drivers in our aim to empower everyone to create sustainable solutions. In this role, you will have the opportunity to execute service work as per work instructions and in accordance with ABB quality and safety guidelines. Each day, you will deliver quality customer servi…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T05:59:30",
    "url": "https://www.adzuna.com/land/ad/5138546474?se=DPU-aVMW8BGkSYinE3cHCQ&utm_medium=api&utm_source=71cf92b8&v=4F3AD8D23D31C075BE69C20DB37AC68A4CEA2D7F",
    "skills": [
      "AI"
    ],
    "salary_range": "£72,318"
  },
  {
    "title": "ULINE- Call Center Representative",
    "company": "Uline, Inc.",
    "description": "Customer Service Representative Pay from $22 to $27 per hour with significant growth and earning potential Pennsylvania Branch 700 Uline Way, Allentown, PA 18106 Morning Call’s Top Large Employer of 2025 Customer Service is the heartbeat of Uline As a Customer Service Representative, you’ll dig into order details to deliver an exceptional experience our customers love. Our company continues to grow, creating new career opportunities and job stability you can count on. Position Responsibilities …",
    "location": "Breinigsville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T08:20:02",
    "url": "https://www.adzuna.com/land/ad/5138660950?se=DPU-aVMW8BGkSYinE3cHCQ&utm_medium=api&utm_source=71cf92b8&v=F7113B34D00698F5DA22FE4FB70D47DE9C750EB1",
    "skills": [
      "AI"
    ],
    "salary_range": "£62,467"
  },
  {
    "title": "Licensed Clinical Psychologist",
    "company": "Headway",
    "description": "Remote Licensed Clinical Psychologist Wage: Between $89-$174 an hour Are you a Licensed Clinical Psychologist looking to launch a private practice, or grow your existing practice? Headway can help you earn more through insurance Headway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run a flourishing private p…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T09:25:30",
    "url": "https://www.adzuna.com/land/ad/5138715955?se=DPU-aVMW8BGkSYinE3cHCQ&utm_medium=api&utm_source=71cf92b8&v=FFA3BA408BDA304644B6D870A00396198213BA71",
    "skills": [],
    "salary_range": "£138,608"
  },
  {
    "title": "In Home Caregiver",
    "company": "Honor",
    "description": "Job Description \\n\\n \\n\\n\\n What is Honor?\\n \\n Honor was created to make life better for our parents, the people who love them, and the caregivers who look after them. Since starting in 2014, we work with more than 50 local agencies and franchises to set high standards of care for older adults across the country.\\n \\n Job Description\\n \\n We call our caregivers Care Professionals (Care Pros) because they are true experts at helping older adults live better lives. They play a key role in our mi…",
    "location": "Schnecksville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T08:08:10",
    "url": "https://www.adzuna.com/details/5137097409?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£54,046"
  },
  {
    "title": "CDL B Team Company Driver, Local, Dry Van",
    "company": "O'BRIENS MOVING AND STORAGE",
    "description": "About the Company O’Brien’s Moving & Storage is committed to providing the highest level of service. We selectively employ only those individuals who will be able to live up to the standards of excellence that have become an integral part of our company culture. Every potential candidate is subject to a detailed interview process that includes background checks and drug testing. That is why we only use our own professionally trained crew members on our moves, resulting in better service to our …",
    "location": "Coopersburg, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T23:06:48",
    "url": "https://www.adzuna.com/details/5138124848?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£52,000 - £67,600"
  },
  {
    "title": "CDL A Company Driver Local Dry Van $10,000 Sign On Bonus",
    "company": "PAN GLO TRANSPORT LLC",
    "description": "About the Company A Leader in commercial trucking, Pan Glo Transport provides outstanding, safe and professional transportation to our local and regional customers. We Offer:•Great Equipment Uniforms Provided Great pay and Benefits•Family Owned Business About the Job Experienced Fulltime Class A CDL Driver needed in Bethlehem, PA area- Great Pay Home Daily on most trips, few layover trips Compensation: starting at $1,200 a week plus .50 cents a mile $30 a stop and $75 for locals. Qualifications…",
    "location": "Neffs, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T22:58:35",
    "url": "https://www.adzuna.com/details/5138114796?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£62,400 - £104,000"
  },
  {
    "title": "Manager, Channel Management",
    "company": "ThermoFisher Scientific",
    "description": "Work Schedule Standard (Mon-Fri) Environmental Conditions Office Job Description About Us: Here at Thermo Fisher Scientific, our industry-leading scale means unparalleled commercial reach, unique customer access and a global footprint. Our broad customer base, from research, clinical to commercial production means you can have a broad and significant impact. All while working in an environment where you will be supported, valued and rewarded for your performance. Join our Sales & Marketing team…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T11:39:53",
    "url": "https://www.adzuna.com/details/5138899034?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£119,797"
  },
  {
    "title": "LMFT (Virtual)",
    "company": "Headway",
    "description": "Remote Licensed Marriage and Family Therapist (LMFT) Wage: Between $86-$120 an hour Are you a Licensed Marriage and Family Therapist looking to launch a private practice, or grow your existing practice? Headway can help you earn more through insurance Headway supports thousands of mental health clinicians across the United States in our mission to rewire the mental healthcare system for access and affordability. We equip mental health practitioners with the tools and resources they need to run …",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-09T01:32:04",
    "url": "https://www.adzuna.com/land/ad/5136783076?se=DPU-aVMW8BGkSYinE3cHCQ&utm_medium=api&utm_source=71cf92b8&v=69DD0F898CA9520A31E184055AFBC8C7C3BC8A26",
    "skills": [],
    "salary_range": "£102,892"
  },
  {
    "title": "Field Service Engineer - Allentown, PA",
    "company": "SMA America",
    "description": "At SMA America, we believe in Energy that Changes. Since 1981, SMA has been developing innovative solar technology with a purpose  making the installation, operation, and maintenance of photovoltaic power plants simpler, more reliable, safer and more cost effective. In the meantime, we’ve also been collecting awards as a great place to work, providing growth opportunities to our employees, and challenging conventional thought. The Field Service Engineer is responsible for performing warranty re…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T20:14:36",
    "url": "https://www.adzuna.com/details/5137987743?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£52,000 - £63,502"
  },
  {
    "title": "Live Entertainment Audio Technician, Seasonal",
    "company": "Dorney Park",
    "description": "Overview: Help create this year’s shows, attractions, and events. Do you have previous experience and are looking to continue using your skills in an amusement park setting? Now is your chance to do just that by becoming an AVL techn ician with Dorney Park’s Live Entertainment Department  You’ll also Knowledge of ETC ION and/or Digital Sound Boards, QLab , and MAC OS. Capability to read and interpret lighting plots and ques and/or mix live bands. Maintain Entertainment facilities and technical …",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T15:28:10",
    "url": "https://www.adzuna.com/details/5139438508?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI",
      "Git"
    ],
    "salary_range": "£51,199"
  },
  {
    "title": "Class A Company Driver, Local, Tanker trailer",
    "company": "Pitt Ohio",
    "description": "About the Job Starting Mileage Rate $0.5908 cpm. Must have at least two years of CDL A experience OR one year of experience with diploma from a driving school Must obtain a Haz-Mat and Tanker endorsement within 90 days of employment Job Summary Company Driver (W2, Solo) Dry Van and Tanker trailer Local $1,100 - $1,500 total weekly avg. pay 1,000 - 1,500 avg. miles per week LTL Day shift 100% Driver Load/Unload Home Time 5 days on, 2 days off Home every weekend Benefits Medical, Dental, Vision a…",
    "location": "Coopersburg, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T22:50:19",
    "url": "https://www.adzuna.com/details/5138105742?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£57,200 - £78,000"
  },
  {
    "title": "Machine Operator, 2nd Shift",
    "company": "Behr Process",
    "description": "To thrive as a Machine/Filling Operator with Behr, you must be eager to learn. You don’t need any previous experience or knowledge about painting or manufacturing, although it’s a bonus. We’ll teach you everything you need to know, which makes this a perfect starting point to launch your career. You’ll cross-train on multiple lines so you are able to assist with any role on any line that needs help. At the start of each workday, you’ll be assigned to one of the production lines. If working on a…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T01:16:38",
    "url": "https://www.adzuna.com/details/5138286425?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£50,274"
  },
  {
    "title": "Assistant Manager - Service Experience - Hamilton Crossing Rack",
    "company": "Nordstrom",
    "description": "Job Description The ideal Assistant Service Experience Manager candidate is goal-oriented, enthusiastic about the business of fashion and has demonstrated skills in the areas of influencing, collaborating and is committed to driving results and providing an exceptional customer experience. A day in the life… Demonstrate ownership of disciplines and process adoption with technology and innovation that enhance the customers experience Assist the Service Experience Manager in coaching an interacti…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T03:02:58",
    "url": "https://www.adzuna.com/details/5138465993?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "Go"
    ],
    "salary_range": "£47,102"
  },
  {
    "title": "OES Packaging Associate",
    "company": "Continental",
    "description": "Continental Automotive is one of the largest automotive manufacturers in the world and a leader in automated driving. Through our pioneering technologies and services, we're changing the future of mobility to make it more safe, smart, and sustainable. Our Allentown, PA location is seeking a highly self-motivated and team-oriented Value Added Services (VAS) Associate Level II to join our Logistics team at our Snowdrift Road location. The ideal candidate has quality driven skills, is dependable a…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T11:09:51",
    "url": "https://www.adzuna.com/details/5138836657?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£41,369"
  },
  {
    "title": "Loan Acquisition Specialist",
    "company": "OneMain Financial",
    "description": "At OneMain, Loan Sales Specialists empower customers by listening to their needs and providing access to friendly, fast, and affordable financing for life’s expenses. In this role, our team members thrive in a competitive atmosphere where hard work and dedication directly influence success. This role provides rewarding professional development and advancement opportunities in a dynamic and supportive environment. Loan Sales Specialists enjoy competitive compensation that recognizes both individ…",
    "location": "Whitehall, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-09T05:07:52",
    "url": "https://www.adzuna.com/details/5136994915?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI"
    ],
    "salary_range": "£41,591"
  },
  {
    "title": "Propane Service Tech",
    "company": "LPGasJobs",
    "description": "Job Description Job Description Service Tech - Milford, NJ / Allentown PA Salary: $80,000.00 - $100,000.00 Enjoy work life in a family-oriented atmosphere and environment Stem Brothers, Inc. is a family owned full service petroleum marketing and HVAC business serving Hunterdon, Warren, (NJ) and Bucks County (PA) since 1946. We are searching for a goal-oriented individual who is looking for a career in our growing service division who possesses knowledge and experience with servicing and/or inst…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T14:38:33",
    "url": "https://www.adzuna.com/details/5139201021?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "Go"
    ],
    "salary_range": "£40,481"
  },
  {
    "title": "Caregiver - $1,000 New Hire Bonus",
    "company": "Honor",
    "description": "Job Description \\n\\n \\n\\n\\n What is Honor?\\n \\n Honor was created to make life better for our parents, the people who love them, and the caregivers who look after them. Since starting in 2014, we work with more than 50 local agencies and franchises to set high standards of care for older adults across the country.\\n \\n Job Description\\n \\n We call our caregivers Care Professionals (Care Pros) because they are true experts at helping older adults live better lives. They play a key role in our mi…",
    "location": "Bowmanstown, Carbon County",
    "is_remote": false,
    "posted_date": "2025-04-09T08:10:04",
    "url": "https://www.adzuna.com/details/5137098888?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£45,150"
  },
  {
    "title": "ULINE- Call Center Representative",
    "company": "Uline, Inc.",
    "description": "Customer Service Representative - Bilingual Pay from $23 to $28 per hour with significant growth and earning potential Pennsylvania Branch 700 Uline Way, Allentown, PA 18106 Morning Call’s Top Large Employer of 2025 Customer Service is the heartbeat of Uline As a Bilingual Customer Service Representative, you’ll dig into order details to deliver an exceptional experience our customers love. Our company continues to grow, creating new career opportunities and job stability you can count on. Posi…",
    "location": "Slatington, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T08:20:02",
    "url": "https://www.adzuna.com/land/ad/5138660960?se=DPU-aVMW8BGkSYinE3cHCQ&utm_medium=api&utm_source=71cf92b8&v=A5E3F979AFEE6287A79248A45BD2DF8DAFBF5AB8",
    "skills": [
      "AI"
    ],
    "salary_range": "£61,114"
  },
  {
    "title": "Customer Service Representative - Bilingual",
    "company": "Uline, Inc.",
    "description": "Customer Service Representative - Bilingual Pay from $23 to $28 per hour with significant growth and earning potential Pennsylvania Branch 700 Uline Way, Allentown, PA 18106 Morning Call’s Top Large Employer of 2025 Customer Service is the heartbeat of Uline As a Bilingual Customer Service Representative, you’ll dig into order details to deliver an exceptional experience our customers love. Our company continues to grow, creating new career opportunities and job stability you can count on. Posi…",
    "location": "Slatington, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T11:05:30",
    "url": "https://www.adzuna.com/land/ad/5138834348?se=DPU-aVMW8BGkSYinE3cHCQ&utm_medium=api&utm_source=71cf92b8&v=0CB8DF5BD8B403EAC691F33C027CE132106F5971",
    "skills": [
      "AI"
    ],
    "salary_range": "£56,005"
  },
  {
    "title": "Interim Team Lead (FF Assoc Team Lead - Interim)",
    "company": "Arvato Bertelsmann",
    "description": "Carbel, part of Arvato, is a full-service 3PL provider serving national and international clients across various industries, with a strong focus on fashion and retail. The Fulfillment Team Lead carries out supervisory responsibilities in accordance with the organization's policies and applicable laws. Leads assist the Supervisor in attaining overall department goals. They lead by example and assist the Supervisor and department by effectively planning and organizing workflow, promoting teamwork…",
    "location": "Palmer, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T10:51:22",
    "url": "https://www.adzuna.com/details/5138822008?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "AI",
      "Go",
      "AWS"
    ],
    "salary_range": "£69,484"
  },
  {
    "title": "Inpatient Child & Adolescent Psychiatrist",
    "company": "AMN Healthcare",
    "description": "Job Description & Requirements Inpatient Child & Adolescent Psychiatrist StartDate: ASAP Available Shifts: Mon-Fri, call shared with 1 other C/A Psych & Fellows Pay Rate: $293000.00 - $357000.00 Embark on a transformative career in child and adolescent psychiatry, where you'll find pioneering behavioral health services and unparalleled professional growth. One of the Largest Medical Groups in the US seeks an Inpatient Child and Adolescent Psychiatrist. The incoming psychiatrist will receive a c…",
    "location": "Wescosville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-10T07:42:17",
    "url": "https://www.adzuna.com/land/ad/5138626649?se=DPU-aVMW8BGkSYinE3cHCQ&utm_medium=api&utm_source=71cf92b8&v=83EBBB9A6921106F71A1E73A2C28CA789D1D069E",
    "skills": [
      "AI"
    ],
    "salary_range": "£125,765"
  },
  {
    "title": "Travel LPN / LVN - Long Term Care - $1,237 per week - Urgently Hiring",
    "company": "GrapeTree Medical Staffing LTC",
    "description": "GrapeTree Medical Staffing LTC is seeking a LPN / LVN Long Term Care for a travel job in Bethlehem, Pennsylvania. Job Description & Requirements Specialty: Long Term Care Discipline: LPN / LVN Start Date: ASAP Duration: 13 weeks 40 hours per week Shift: 8 hours, days Employment Type: Travel Grape Tree LTC Job ID 70538. Pay package is based on 8 hour shifts and 40 hours per week (subject to confirmation) with tax-free stipend amount to be determined. Posted job title: LPN - LTC About GrapeTree M…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T15:47:16",
    "url": "https://www.adzuna.com/land/ad/5139554335?se=DPU-aVMW8BGkSYinE3cHCQ&utm_medium=api&utm_source=71cf92b8&v=F6C1532A76E91707C941224A65A52CB8AB02F512",
    "skills": [],
    "salary_range": "Up to £64,324"
  },
  {
    "title": "Community Mortgage Bank Sales Consultant",
    "company": "Wells Fargo",
    "description": "About this role: Wells Fargo is seeking a Mortgage Bank Sales Consultant (SAFE) in Consumer Lending as part of Home Lending. For additional information on this line of business, refer to the external Careers Site at www.wellsfargojobs.com . In this role you will: - Sit within assigned bank branches and originate mortgage loans; collaborate with branch leadership, participate in branch huddles, mentor and coach employees to increase knowledge of mortgage products and processes; perform miscellan…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-10T11:35:12",
    "url": "https://www.adzuna.com/details/5138864998?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "Go"
    ],
    "salary_range": "£65,917"
  }
]