[
  {
    "title": "Dental Hygienist",
    "company": "Heckenberger Dental",
    "description": "Job Description Job Description We are seeking a skilled and compassionate Dental Hygienist to join our team. This position is full time in a busy two doctor practice located in Bethlehem. Our hours are Monday through Thursday from 8am-5:15-5:30pm. Not nights, no weekends. Licensed oral healthcare professional who works closely with dentists to provide preventative dental care, promote good oral hygiene, and help patients maintain healthy teeth and gums. You will perform cleanings, take x-rays,…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-12T14:21:47",
    "url": "https://www.adzuna.com/details/5142265690?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£87,796",
    "match_percentage": null
  },
  {
    "title": "CAPS QC Coordinator-Process Coordinator",
    "company": "Central Admixture Pharmacy",
    "description": "Company: Central Admixture Pharmacy Job Posting Location: Allentown (6580 Snowdrift Rd), Pennsylvania, United States Functional Area: Other Areas Working Model: Onsite Days of Work: Friday, Thursday, Wednesday, Tuesday, Monday Shift: 5X8 Relocation Available: No Requisition ID: 4184 B. Braun Medical Inc., a leader in infusion therapy and pain management, develops, manufactures, and markets innovative medical products and services to the healthcare industry. Other key product areas include nutri…",
    "location": "Wescosville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T19:49:53",
    "url": "https://www.adzuna.com/land/ad/5142713732?se=tmP4rP8X8BGUknvr1rWCew&utm_medium=api&utm_source=71cf92b8&v=E5A811C53C5E7775262EFCA374458AD439CFD03B",
    "skills": [],
    "salary_range": "£65,886",
    "match_percentage": null
  },
  {
    "title": "Quality Technician - Process Control",
    "company": "Central Admixture Pharmacy",
    "description": "Company: Central Admixture Pharmacy Job Posting Location: Allentown (6580 Snowdrift Rd), Pennsylvania, United States Functional Area: Quality Working Model: Onsite Days of Work: Friday, Thursday, Wednesday, Tuesday, Monday Shift: 5X8 Relocation Available: No Requisition ID: 4029 B. Braun Medical Inc., a leader in infusion therapy and pain management, develops, manufactures, and markets innovative medical products and services to the healthcare industry. Other key product areas include nutrition…",
    "location": "Wescosville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T19:49:53",
    "url": "https://www.adzuna.com/land/ad/5142713793?se=tmP4rP8X8BGUknvr1rWCew&utm_medium=api&utm_source=71cf92b8&v=6020EB75618474D76E84DD7EAF11D715054F804E",
    "skills": [],
    "salary_range": "£68,503",
    "match_percentage": null
  },
  {
    "title": "Residential Counselor",
    "company": "COMHAR",
    "description": "Full-time Description Effective October 15, 2021, all employees/contractors/interns/volunteers are required to provide our office with proof of COVID vaccination. Residential Counselor Salary: $15.75/HR Residential Counselor Shift Options (1 opening) Monday-Friday 12AM-8AM (40 Hours) COMHAR's Community Residential Rehabilitation Services (CRRS), located in the Northampton area, are a homelike environment providing clients with the maximum possible opportunity for independence and self-determina…",
    "location": "Walnutport, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-12T00:16:30",
    "url": "https://www.adzuna.com/details/5141664208?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£32,760 - £32,968",
    "match_percentage": null
  },
  {
    "title": "Cashier / Host / Attendant",
    "company": "Patel, Patel and Patel dba Golden Corral",
    "description": "Benefits: Competitive salary Employee discounts Flexible schedule Free food & snacks Training & development Our franchise organization,is currently seeking energetic, friendly individuals to join our team Entering and leaving Golden Corral are two of the most critical moments in the guest’s experience because lasting impressions are formed during these moments. The Cashier / Host’s interactions with our guests and these impressions ultimately dictate whether the guest will return. Guest Service…",
    "location": "Whitehall, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T09:15:23",
    "url": "https://www.adzuna.com/details/5142068309?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "go"
    ],
    "salary_range": "£20,800 - £31,200",
    "match_percentage": null
  },
  {
    "title": "Seeking Professionals for a New Approach to and Old Industry",
    "company": "Unknown Company",
    "description": "Are you ready to break free from the confines of the traditional 9-5 and unleash your full potential as a leader? Look no further We’re seeking driven individuals who are passionate about helping others and aspiring to reach top-level leadership positions. Why Join Us? 1. Work from Home: Enjoy the freedom and flexibility of working remotely, allowing you to create your ideal workspace and balance your professional and personal life with ease. 2. Help People: Make a meaningful impact by providin…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T14:12:28",
    "url": "https://www.adzuna.com/details/5142255515?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£79,315",
    "match_percentage": null
  },
  {
    "title": "Travel CT Tech - Radiology / Cardiology - $2,439 per week",
    "company": "American Medical Staffing",
    "description": "American Medical Staffing is seeking a travel CT Technologist for a travel job in Allentown, Pennsylvania. Job Description & Requirements Specialty: CT Technologist Discipline: Allied Health Professional Start Date: 05/05/2025 Duration: 13 weeks 36 hours per week Shift: 12 hours, nights Employment Type: Travel You have a lot of choices when you consider your next professional role and we know it can be hard to wade through all the calls, emails and messages from medical staffing agencies who se…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T07:30:01",
    "url": "https://www.adzuna.com/land/ad/5141998884?se=tmP4rP8X8BGUknvr1rWCew&utm_medium=api&utm_source=71cf92b8&v=A8E3E2BF1E89DDC287F9C8A097DB05A794094419",
    "skills": [],
    "salary_range": "Up to £126,828",
    "match_percentage": null
  },
  {
    "title": "Server",
    "company": "Patel, Patel and Patel dba Golden Corral",
    "description": "Benefits: Employee discounts Flexible schedule Free food & snacks Opportunity for advancement Training & development Our franchise organization, Patel, Patel and Patel dba Golden Corral, is currently seeking energetic, friendly individuals to join our team The main responsibility of the Server is “Making Pleasurable Dining Affordable.” Fulfilling Golden Corral’s mission statement requires a positive attitude and on going professionalism. Hospitality is the most important part of the Server’s re…",
    "location": "Whitehall, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T09:07:35",
    "url": "https://www.adzuna.com/details/5142066810?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "go"
    ],
    "salary_range": "£23,848",
    "match_percentage": null
  },
  {
    "title": "Customer Relationship Manager",
    "company": "Zing! Recruiting",
    "description": "Job Description Job Description Account/Customer Growth Manager Location: Allentown, NJ Schedule: Monday-Friday 8:30AM - 5PM Pay Rate: $32 - $34 per hour DOE Leading manufacturer of printing services/signage is in need of a Customer Growth Specialist to join the team Responsibilities: Build and maintain meaningful relationships with a portfolio of existing customers. Develop and maintain strong, long-term relationships with a portfolio of assigned clients. Serve as the main point of contact for…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T14:24:52",
    "url": "https://www.adzuna.com/details/5142276511?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£71,157",
    "match_percentage": null
  },
  {
    "title": "LOCAL TRAVEL RESET MERCHANDISER",
    "company": "Force One",
    "description": "Job Description Job Description Benefits: Competitive salary Opportunity for advancement Training & development Job Title: Reset Merchandiser Force 1 One is seeking an individual who can improve the consumer buying experience by executing top-notch reset merchandising at assigned stores within their territory. The ideal candidate will have strong reset merchandising experience, is a self-starter & quick learner, has a strong attention to detail, and works well in independent situations. They mu…",
    "location": "Coplay, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T13:12:38",
    "url": "https://www.adzuna.com/details/5142184479?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£35,498",
    "match_percentage": null
  },
  {
    "title": "Armed ACT 235 Female School Security Guard- Per Diem",
    "company": "KRE Security",
    "description": "Job Description Job Description Now Hiring: Armed ACT 235 Female School Security Guard Location: CONFIDENTIAL, located within 30 min from ABE Airport Are you passionate about safety and dedicated to protecting students and staff? We're looking for a Female Armed ACT 235 Security Guard to join our school security team. If you already have the necessary clearances or are willing to obtain them, we encourage you to apply As an ACT 235-certified armed security guard, you will play an essential role…",
    "location": "Slatington, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T13:17:56",
    "url": "https://www.adzuna.com/details/5142208061?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£46,420",
    "match_percentage": null
  },
  {
    "title": "Server",
    "company": "Patel, Patel and Patel dba Golden Corral",
    "description": "Benefits: Employee discounts Flexible schedule Opportunity for advancement Training & development Our franchise organization, is currently seeking energetic, friendly individuals to join our team The main responsibility of the Server is “Making Pleasurable Dining Affordable.” Fulfilling Golden Corral’s mission statement requires a positive attitude and on going professionalism. Hospitality is the most important part of the Server’s responsibilities. The keys to success for a Server include a cl…",
    "location": "Whitehall, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T09:15:23",
    "url": "https://www.adzuna.com/details/5142068308?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "go"
    ],
    "salary_range": "£21,375",
    "match_percentage": null
  },
  {
    "title": "Restaurant Kitchen Manager",
    "company": "Patel, Patel and Patel dba Golden Corral",
    "description": "Benefits: Employee discounts Flexible schedule Opportunity for advancement Training & development Our franchise organization, , is currently seeking energetic, friendly individuals to join our team At Golden Corral®, we know that successful people are the foundation of our very successful company. We hire managers with the talent, integrity, and passion to promote our Caring Culture. We provide an environment that supports and empowers our people – not only to exceed our guests' expectations, b…",
    "location": "Whitehall, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T09:07:35",
    "url": "https://www.adzuna.com/details/5142066811?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "go"
    ],
    "salary_range": "£36,273",
    "match_percentage": null
  },
  {
    "title": "Commercial Sales Representative",
    "company": "RATT INC dba Orkin Pest Control",
    "description": "Job Description Job Description Salary: 45,000-55,000 At Orkin, our purpose is to help protect the world where we live, work and play. Our Commercial Sales Representatives are committed to this purpose. As a Commercial Sales Representative with Orkin, you will be provided the opportunity to grow your sales career and control your financial opportunity. Our sales professionals earn top wages, recognition, and have the opportunity earn annual awards trips We offer extensive paid training and a re…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T13:15:31",
    "url": "https://www.adzuna.com/details/5142196991?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£66,959",
    "match_percentage": null
  },
  {
    "title": "Pharmacy Warehouse Clerk (1st shift)",
    "company": "Central Admixture Pharmacy",
    "description": "Company: Central Admixture Pharmacy Job Posting Location: Allentown (6580 Snowdrift Rd), Pennsylvania, United States Functional Area: Pharmacy Working Model: Onsite Days of Work: Friday, Thursday, Wednesday, Tuesday, Monday Shift: 5X8 Relocation Available: No Requisition ID: 4122 B. Braun Medical Inc., a leader in infusion therapy and pain management, develops, manufactures, and markets innovative medical products and services to the healthcare industry. Other key product areas include nutritio…",
    "location": "Wescosville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T19:49:53",
    "url": "https://www.adzuna.com/land/ad/5142713743?se=tmP4rP8X8BGUknvr1rWCew&utm_medium=api&utm_source=71cf92b8&v=A50017C3B0E9A90506487630107F691D84DC3857",
    "skills": [],
    "salary_range": "£66,160",
    "match_percentage": null
  },
  {
    "title": "Pharmacy Technician (2nd shift)",
    "company": "Central Admixture Pharmacy",
    "description": "Company: Central Admixture Pharmacy Job Posting Location: Allentown (6580 Snowdrift Rd), Pennsylvania, United States Functional Area: Pharmacy Working Model: Onsite Days of Work: Friday, Thursday, Wednesday, Tuesday, Monday Shift: 5X8 Relocation Available: No Requisition ID: 3951 B. Braun Medical Inc., a leader in infusion therapy and pain management, develops, manufactures, and markets innovative medical products and services to the healthcare industry. Other key product areas include nutritio…",
    "location": "Wescosville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T19:49:53",
    "url": "https://www.adzuna.com/land/ad/5142713725?se=tmP4rP8X8BGUknvr1rWCew&utm_medium=api&utm_source=71cf92b8&v=A7D12E5838BA24837DEE8E5FBD1F3131C03CEFAD",
    "skills": [],
    "salary_range": "£78,711",
    "match_percentage": null
  },
  {
    "title": "Restaurant Team Member",
    "company": "Patel, Patel and Patel dba Golden Corral",
    "description": "Benefits: Competitive salary Employee discounts Flexible schedule Opportunity for advancement Training & development Our franchise organization, is currently seeking energetic, friendly individuals to join our team Golden Corral restaurants are currently accepting applications for the opportunity to join our team with our family buffet restaurant chain with nearly 500 company and franchise restaurants located across the United States. Come be a part of our team while contributing to our vision …",
    "location": "Whitehall, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T09:07:34",
    "url": "https://www.adzuna.com/details/5142066794?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "go"
    ],
    "salary_range": "£20,800 - £31,200",
    "match_percentage": null
  },
  {
    "title": "QA Engineer-CAPS",
    "company": "Central Admixture Pharmacy",
    "description": "Company: Central Admixture Pharmacy Job Posting Location: Allentown (6580 Snowdrift Rd), Pennsylvania, United States, Phoenix, Arizona, United States Functional Area: Quality Working Model: Onsite Days of Work: Friday, Thursday, Wednesday, Tuesday, Monday Shift: 5X8 Relocation Available: No Requisition ID: 4059 B. Braun Medical Inc., a leader in infusion therapy and pain management, develops, manufactures, and markets innovative medical products and services to the healthcare industry. Other ke…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-12T07:45:57",
    "url": "https://www.adzuna.com/details/5142022490?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£83,449",
    "match_percentage": null
  },
  {
    "title": "Delivery Driver",
    "company": "Bright Flag",
    "description": "Job Description Bright Flag Recruiting on behalf of TAM Transport, a local FedEx Ground contractor has IMMEDIATE OPENINGS for delivery drivers in Northampton, PA. Our delivery drivers will be operating by delivering to local residents and businesses. You will be operating out of the FedEx terminal at 1000 Willowbrook Rd, Northampton, PA 18067 . We are looking for motivated and dependable individuals to work as part of a team If you are seeking an employer that will treat you with respect , offe…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T04:19:29",
    "url": "https://www.adzuna.com/details/5141892760?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£39,000 - £45,500",
    "match_percentage": null
  },
  {
    "title": "Dentist Job in Allentown PA Area",
    "company": "Blue Jay Dental, LLC",
    "description": "Job Description Job Description Associate Dentist Opportunity in the Allentown Area This job has been verified as open as of 3/28/25 Blue Jay Dental invites you to join an established and successful dental practice in the Allentown area , where quality care and professional growth go hand in hand. Were looking for a motivated, compassionate, and skilled Associate Dentist to become an integral part of our team. This is your chance to make a meaningful impact in a thriving practice that values pa…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T13:18:14",
    "url": "https://www.adzuna.com/details/5142209144?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£91,141",
    "match_percentage": null
  },
  {
    "title": "Optical Sales Manager 55645",
    "company": "U.S .Vision",
    "description": "Job Description Job Description Our heritage in eye care spans more than 100 years. In 1885, opticians William Wall and Charles Ochs opened their first eyeglass store and manufacturing facility in Philadelphia, PA. Their reputation for fine eyewear and superior eye care grew, and Wall & Ochs was soon synonymous with exceptional quality and great value. In the early 1970’s, Wall & Ochs became U.S. Vision in response to a growing reputation for quality and the customer base that came with it. Tod…",
    "location": "Whitehall, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T13:17:11",
    "url": "https://www.adzuna.com/details/5142204648?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£46,215",
    "match_percentage": null
  },
  {
    "title": "Occupational Therapist",
    "company": "Premier Therapy",
    "description": "Job Description Job Description Shape Lives, Transform Care Join The PREMIER THERAPY Team As Our Full-Time Occupational Therapist in Nazareth, PA and enjoy a $3,000 Sign-on Bonus Are you passionate about helping others regain their independence and improve their quality of life? At PREMIER THERAPY, we are dedicated to providing exceptional care to our residents in skilled nursing facilities. We are seeking motivated Occupational Therapists like you to join our team and make a lasting impact. Fl…",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-12T14:28:32",
    "url": "https://www.adzuna.com/details/5142288708?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£63,279",
    "match_percentage": null
  },
  {
    "title": "Continuous Improvement Specialist",
    "company": "Central Admixture Pharmacy",
    "description": "Company: Central Admixture Pharmacy Job Posting Location: Allentown (6580 Snowdrift Rd), Pennsylvania, United States Functional Area: Other Areas Working Model: Onsite Days of Work: Friday, Thursday, Wednesday, Tuesday, Monday Shift: 5X8 Relocation Available: No Requisition ID: 4189 B. Braun Medical Inc., a leader in infusion therapy and pain management, develops, manufactures, and markets innovative medical products and services to the healthcare industry. Other key product areas include nutri…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-12T07:37:50",
    "url": "https://www.adzuna.com/details/5142000865?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£110,082",
    "match_percentage": null
  },
  {
    "title": "Mold Shop Supervisor - 2nd Shift",
    "company": "B. Braun US Device Manufacturing LLC",
    "description": "B. Braun Medical, Inc. Company: B. Braun US Device Manufacturing LLC Job Posting Location: Allentown, Pennsylvania, United States Functional Area: Other Areas Working Model: Onsite Days of Work: Friday, Thursday, Wednesday, Tuesday, Monday Shift: 5X8 Relocation Available: No Requisition ID: 3841 B. Braun Medical Inc., a leader in infusion therapy and pain management, develops, manufactures, and markets innovative medical products and services to the healthcare industry. Other key product areas …",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T11:53:28",
    "url": "https://www.adzuna.com/details/5142143402?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£75,544",
    "match_percentage": null
  },
  {
    "title": "Remote - Speech Language Pathologist - SLP",
    "company": "All Care Therapies",
    "description": "Job Description Job Description Company Description All Care Therapies is at the forefront of utilizing cutting-edge technology to deliver in-home speech, occupational, and physical therapy services for a diverse clientele, spanning children to adults with various disorders and conditions. As a leading provider of virtual in-home therapy, we excel in addressing the unique needs of each client within the familiar comfort of their environment. Job Description We are hiring in all 50 states to pro…",
    "location": "Bethlehem, Northampton County",
    "is_remote": true,
    "posted_date": "2025-04-12T13:13:26",
    "url": "https://www.adzuna.com/details/5142189626?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£96,144",
    "match_percentage": null
  },
  {
    "title": "Home Care Aide",
    "company": "Help at Home",
    "description": "Job Description Job Description Help at Home is hiring TODAY in your community and we are offering a $1,000 sign-on bonus to join our team Start your career with the nation’s leading provider of in-home support to seniors and become a hero for someone in your community. Why should you join Help at Home? Flexible scheduling Highest wages in the state - typical starting wages around $13 per hour (can vary by location, experience, and/or care plan) No experience required Amazing benefits – health …",
    "location": "Northampton, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-12T13:12:32",
    "url": "https://www.adzuna.com/details/5142183687?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£39,461",
    "match_percentage": null
  },
  {
    "title": "Marketing Specialist Job at Valley Youth House in Bethlehem",
    "company": "Valley Youth House",
    "description": "Marketing Specialist Location: Bethlehem ($18hr - $24hr) The Organization: Valley Youth House is a nonprofit organization that empowers and strengthens the lives of children, youth, and families through inclusive programming that builds resilience and fosters growth and independence. Valley Youth House works from a Trauma Informed / Healing Centered perspective, incorporating positive youth and human development, and cultural awareness into all aspects of our agency. The agency is committed to …",
    "location": "Bethlehem, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-12T16:02:10",
    "url": "https://www.adzuna.com/details/5142552027?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£52,023",
    "match_percentage": null
  },
  {
    "title": "1st shift Production Control Lead",
    "company": "HOOD CONTAINER CORPORATION",
    "description": "Job Description Job Description Hood Container Corporation (HCC) in Allentown, PA is seeking a dynamic leader to join our team as Production Control Lead. The Production Control Lead is a working position that has overall first level responsibility for the efficient and correct operation of a packing or assembly line and assists with the oversight of Line Coordinators and forklift drivers. Day in the Life: Responsible for the efficient and correct set-up of assembly or packing line. Ensuring an…",
    "location": "Breinigsville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T13:13:39",
    "url": "https://www.adzuna.com/details/5142190377?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£46,130",
    "match_percentage": null
  },
  {
    "title": "1st Shift Material Handler",
    "company": "Alleguard",
    "description": "Come join a leader in Protective Foam Solutions At Alleguard, we’re built from the ground up to expand and shape our customer’s businesses. We understand the diversity of challenges that customers are facing across different industries, from confidence in their supply chain to needing the latest innovations at their fingertips. These challenges are also opportunities, and whether our customers are in construction, protective packaging, cold-chain or other industries, we are relentless in seeing…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-12T04:03:03",
    "url": "https://www.adzuna.com/details/5141888611?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£37,315",
    "match_percentage": null
  },
  {
    "title": "Patient Support Specialist - Hybrid",
    "company": "Blackbird Health",
    "description": "Job Description Job Description At Blackbird Health our commitment is to provide precision care, with powerful outcomes for children, adolescents and young adults struggling with social developmental and school related challenges. We believe that our youth deserve the very best care, not only for their physical health, but also their mental health. Through an integrated community-centered care approach, our skilled clinical team delivers exceptional virtual and in-person care across a wide rang…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T13:16:00",
    "url": "https://www.adzuna.com/details/5142198362?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£54,683",
    "match_percentage": null
  },
  {
    "title": "Staff - Registered Nurse (RN) - Hospice - $42 per hour",
    "company": "BAYADA Home Health Care",
    "description": "BAYADA Home Health Care is seeking a Registered Nurse (RN) Hospice for a nursing job in Allentown, Pennsylvania. Job Description & Requirements Specialty: Hospice Discipline: RN Duration: Ongoing Employment Type: Staff BAYADA Hospice is looking for compassionate and dedicated Full Time Registered Nurses ( RN) to join our team in the Hospice office , located in Boyertown, PA . This office services hospice clients on a per visit basis in the Lehigh County area. Apply now and speak with a recruite…",
    "location": "Lehigh Valley, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-12T10:53:42",
    "url": "https://www.adzuna.com/details/5142116859?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£38,012",
    "match_percentage": null
  },
  {
    "title": "Warehouse Supervisor",
    "company": "Coherent",
    "description": "Description Primary Duties & Responsibilities Receiving Quantity and items are verified against PO and packing list. Material is transferred or issued to the appropriate storage location. Inventory is accurate and verified. Problems are identified and the person responsible is notified to resolve Physical records of received goods are stored digitally. Receipts are entered into ERP system in a timely fashion. Lead and train members in departmental processes and procedure Shipping Shipping suppo…",
    "location": "Old Orchard, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-12T20:06:42",
    "url": "https://www.adzuna.com/details/5142723111?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£46,278",
    "match_percentage": null
  },
  {
    "title": "Pharmacy Technician",
    "company": "Schuylkill",
    "description": "Imagine a career at one of the nation's most advanced health networks. Be part of an exceptional health care experience. Join the inspired, passionate team at Lehigh Valley Health Network, a nationally recognized, forward-thinking organization offering plenty of opportunity to do great work. LVHN has been ranked among the \"Best Hospitals\" by U.S. News & World Report for 23 consecutive years. We're a Magnet(tm) Hospital, having been honored five times with the American Nurses Credentialing Cente…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T19:47:52",
    "url": "https://www.adzuna.com/details/5142710631?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£57,783",
    "match_percentage": null
  },
  {
    "title": "Home Health Aide",
    "company": "Maximum Care",
    "description": "Maximum Care, Inc., is looking for a Direct Care Worker to Join Our Team . Maximum Care, Inc. has been in business for Over 40 years , supporting the elderly, disable, and the Participants with Intellectual Disabilities. We SHOW Appreciation : Monthly Raffles Bonuses Referral Bonuses Acknowledgement when the Direct Care Worker GOES ABOVE AND BEYOND We MAKE it EASY : Application is done through your mobile All training is done through the mobile app at your convenience Face to Face via Zoom Flex…",
    "location": "Northampton, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-12T02:03:06",
    "url": "https://www.adzuna.com/details/5141807348?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£37,600",
    "match_percentage": null
  },
  {
    "title": "CAPS QC Coordinator-Process Control",
    "company": "Central Admixture Pharmacy",
    "description": "Company: Central Admixture Pharmacy Job Posting Location: Allentown (6580 Snowdrift Rd), Pennsylvania, United States Functional Area: Other Areas Working Model: Onsite Days of Work: Friday, Thursday, Wednesday, Tuesday, Monday Shift: 5X8 Relocation Available: No Requisition ID: 4031 B. Braun Medical Inc., a leader in infusion therapy and pain management, develops, manufactures, and markets innovative medical products and services to the healthcare industry. Other key product areas include nutri…",
    "location": "Wescosville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T11:55:55",
    "url": "https://www.adzuna.com/details/5142144973?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£47,340 - £59,176",
    "match_percentage": null
  },
  {
    "title": "Infrastructure & Capital Projects - Engineering Management Consultant",
    "company": "AH Anderson Consulting, LLC",
    "description": "Job Description Job Description We are: AH Anderson Consulting services are tailored to helping companies become more productive, competitive and sustainable with over 30 years of business operations and consulting experience, in specific industries. AH Anderson Consulting's passion is to help organizations become more productive, efficient and competitive. With more than 30 years of business and consulting experience, we have designed and delivered a wide array of business solutions to improve…",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T11:43:13",
    "url": "https://www.adzuna.com/details/5142136533?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£118,627",
    "match_percentage": null
  },
  {
    "title": "Breakfast Attendant",
    "company": "Unknown Company",
    "description": "Thank you for your interest in our Brand-New Fairfield Inn and Suites by Marriott Bethlehem PA. Some of the benefits you will find working for Springwood Hospitality: - Annual Retention Bonus, up to $1,000 - 401K with employer matching contribution - Multiple team member \"thank yous\" throughout the year, centered around holidays and special events - Salary starting at $16.50 per hour. Paid Time Off Flexible Schedule Competitive Wages Retention/Referral Bonus 401(k) 401(k) matching The Fairfield…",
    "location": "Butztown, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-12T14:12:23",
    "url": "https://www.adzuna.com/details/5142254978?utm_medium=api&utm_source=71cf92b8",
    "skills": [
      "spring"
    ],
    "salary_range": "£22,621",
    "match_percentage": null
  },
  {
    "title": "Financial Center Supervisor",
    "company": "Fulton Bank",
    "description": "Value Proposition Our values define us and our culture inspires us to change lives for the better. Our employees are the heart and soul of our company, and every success we experience begins with them. Together we are committed to making a positive impact in our local communities. We champion a culture of continuous learning, work-life integration, and inclusion . We promote a digitally enabled work environment to continuously enhance the experience of our employees and customers. Overview This…",
    "location": "Emmaus, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T12:47:05",
    "url": "https://www.adzuna.com/details/5142163303?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£64,792",
    "match_percentage": null
  },
  {
    "title": "Continuity of Care Specialist",
    "company": "COMHAR, Inc.",
    "description": "Job Description Job Description Description: Effective October 15, 2021, all employees/contractors/interns/volunteers are required to provide our office with proof of COVID vaccination. Work Shift: Monday-Friday 9:00AM-5:00PM Continuity of Care Specialist Position Salary: $41,184.00 ($19.80/HR) Continuity of Care Specialist Position Summary The Continuity of Care Specialist reports to the Long-Term Structured Residences (LTSR) Program Director and/or LTSR Program Director Assistant. The Continu…",
    "location": "Walnutport, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-12T13:15:05",
    "url": "https://www.adzuna.com/details/5142195439?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£63,885",
    "match_percentage": null
  },
  {
    "title": "Shipping Clerk",
    "company": "Aerotek",
    "description": "Job Description Job Description Job Title: Shipping Clerk Job Description We are seeking a diligent and organized Shipping Clerk to join our team. This role involves handling various warehouse operations, including inventory management, picking and packing, and shipping and receiving tasks. Responsibilities Manage and maintain inventory records accurately. Operate forklift to move and organize warehouse materials. Perform shipping and receiving duties efficiently. Pick and pack orders for shipm…",
    "location": "Breinigsville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T14:31:28",
    "url": "https://www.adzuna.com/details/5142290892?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£40,006",
    "match_percentage": null
  },
  {
    "title": "Craftsperson - Apprentice (Entry)",
    "company": "B. Braun US Device Manufacturing LLC",
    "description": "B. Braun Medical, Inc. Company: B. Braun US Device Manufacturing LLC Job Posting Location: Allentown, Pennsylvania, United States Functional Area: Other Areas Working Model: Onsite Days of Work: Friday, Thursday, Wednesday, Tuesday, Monday Shift: 5X8 Relocation Available: No Requisition ID: 4071 B. Braun Medical Inc., a leader in infusion therapy and pain management, develops, manufactures, and markets innovative medical products and services to the healthcare industry. Other key product areas …",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T11:53:27",
    "url": "https://www.adzuna.com/details/5142143376?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£47,271",
    "match_percentage": null
  },
  {
    "title": "Private Client Banker - Greater Lehigh Valley Market - Easton, PA",
    "company": "JPMorgan Chase Bank, N.A.",
    "description": "You have a passion for taking care of our customers and employees and making them feel welcomed and valued by building lasting relationships, doing the right thing, exceeding expectations and having a strong commitment to diversity and inclusion. Here at Chase, you will have the opportunity to help people experience our Customer Promise  helping people make the most of their money so they can make the most of their lives by providing education and advice tailored to suit their financial needs. …",
    "location": "Forks, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-12T08:51:20",
    "url": "https://www.adzuna.com/details/5142063387?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£61,833",
    "match_percentage": null
  },
  {
    "title": "Material Handler",
    "company": "Aerotek",
    "description": "Job Description Job Description Job Title: Material Handler Job Description As a Material Handler, you will be responsible for the storage of materials, fulfilling production requirements, and the movement and disbursement of materials using Powered Industrial Truck (PIT) equipment. This position requires approximately 60% of the time on a forklift and 40% picking by hand. Responsibilities Complete PIT equipment training and become certified to drive at the facility. Ensure proper warehousing o…",
    "location": "Alburtis, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T14:35:50",
    "url": "https://www.adzuna.com/details/5142294349?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£34,367",
    "match_percentage": null
  },
  {
    "title": "CAPS QC Coordinator-Process Control",
    "company": "Central Admixture Pharmacy",
    "description": "Company: Central Admixture Pharmacy Job Posting Location: Allentown (6580 Snowdrift Rd), Pennsylvania, United States Functional Area: Other Areas Working Model: Onsite Days of Work: Friday, Thursday, Wednesday, Tuesday, Monday Shift: 5X8 Relocation Available: No Requisition ID: 4028 B. Braun Medical Inc., a leader in infusion therapy and pain management, develops, manufactures, and markets innovative medical products and services to the healthcare industry. Other key product areas include nutri…",
    "location": "Wescosville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T11:55:55",
    "url": "https://www.adzuna.com/details/5142144963?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£47,340 - £59,176",
    "match_percentage": null
  },
  {
    "title": "CAPS QC Coordinator-Microbiology",
    "company": "Central Admixture Pharmacy",
    "description": "Company: Central Admixture Pharmacy Job Posting Location: Allentown (6580 Snowdrift Rd), Pennsylvania, United States Functional Area: Other Areas Working Model: Onsite Days of Work: Friday, Thursday, Wednesday, Tuesday, Monday Shift: 5X8 Relocation Available: No Requisition ID: 4027 B. Braun Medical Inc., a leader in infusion therapy and pain management, develops, manufactures, and markets innovative medical products and services to the healthcare industry. Other key product areas include nutri…",
    "location": "Wescosville, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T11:57:06",
    "url": "https://www.adzuna.com/details/5142145369?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£47,340 - £59,176",
    "match_percentage": null
  },
  {
    "title": "Sound Engineer- PT - Archer Music Hall",
    "company": "Live Nation Entertainment",
    "description": "Job Summary: WHO ARE WE? Live Nation Entertainment is the world's leading live entertainment company, comprised of global market leaders: Ticketmaster, Live Nation Concerts, and Live Nation Media & Sponsorship. Ticketmaster is the global leader in event ticketing with over 500 million tickets sold annually and more than 12,000 clients worldwide. Live Nation Concerts is the largest provider of live entertainment in the world promoting more than 40,000 shows and 100 festivals annually for nearly …",
    "location": "Allentown, Lehigh County",
    "is_remote": false,
    "posted_date": "2025-04-12T17:48:57",
    "url": "https://www.adzuna.com/details/5142657510?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£89,007",
    "match_percentage": null
  },
  {
    "title": "Store Sales Representative - Flemington, NJ",
    "company": "Sherwin-Williams",
    "description": "This position is required to grow top line sales at assigned Lowes stores within geographic territory through implementing sales/marketing programs, training activities, service and merchandising responsibilities. The store count will range based on geography and store volume. Store count ranges between 3-5 stores, average territory contains 4 stores. Lowes Stores: 1590 - Philipsburg, NJ 1656 - Hillsborough, NJ 1759 - Easton, PA 1938 - Hackettstown, NJ 2552 - Flemington, NJ Job duties involve c…",
    "location": "Palmer, Northampton County",
    "is_remote": false,
    "posted_date": "2025-04-12T02:13:29",
    "url": "https://www.adzuna.com/details/5141824003?utm_medium=api&utm_source=71cf92b8",
    "skills": [],
    "salary_range": "£43,992",
    "match_percentage": null
  }
]